{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "That is a lie.", 
      "Saruman the White has ever been our friend and ally."
   ], 
   [
      "Saruman the White has ever been our friend and ally.", 
      "Gríma... Gríma..."
   ], 
   [
      "Orcs are running freely across our lands. Unchecked. Unchallenged. Killing at will. Orcs bearing the White Hand of Saruman.", 
      "Why do you lay these troubles on an already troubled mind? Can you not see? Your uncle is wearied by your malcontent, your warmongering."
   ], 
   [
      "Too long have you watched my sister.  Too long have you haunted her steps.", 
      "You see much, Éomer, Son of Éomund.  Too much."
   ], 
   [
      "You see much, Éomer, Son of Éomund.  Too much.", 
      "You are banished forthwith from the kingdom of Rohan and all its domains under pain of death."
   ], 
   [
      "You have no authority here. Your  orders mean nothing.", 
      "He signed it this morning."
   ], 
   [
      "Be careful what you say. Do not look  for welcome here.", 
      "Oh, he must have died sometime in the night. What a tragedy for the king to lose his only son and heir."
   ], 
   [
      "Oh, he must have died sometime in the night. What a tragedy for the king to lose his only son and heir.", 
      "I understand. His passing is hard to accept. Especially now that your brother has deserted you."
   ], 
   [
      "Oh, but you are alone. Who knows what you’ve spoken to the darkness in the bitter watches of the night when all your life seems to shrink. The walls of your bower closing in about you. A hutch to trammel some wild thing in.", 
      "So fair, so cold. Like a morning pale spring still clinging to winter's chill."
   ], 
   [
      "You would not part an old man from his walking stick.", 
      "My lord, Gandalf the Grey is coming."
   ], 
   [
      "My lord, Gandalf the Grey is coming.", 
      "He’s a herald of woe."
   ], 
   [
      "He’s not welcome.", 
      "Why should I welcome you, Gandalf Stormcrow?"
   ], 
   [
      "Why should I welcome you, Gandalf Stormcrow?", 
      "A just question, my liege."
   ], 
   [
      "A just question, my liege.", 
      "Late is the hour in which this conjurer chooses to appear. Láthspell spell I name him. Ill news is an ill guest."
   ], 
   [
      "Keep your forked tongue behind your teeth. I have not passed through fire and death to bandy crooked words with a witless worm.", 
      "His staff."
   ], 
   [
      "EXT. MEDUSELD - DAY  HÁMA and GAMLING throw WORMTONGUE down the stairs. He lands hard on the lower stoop and groans in pain.   ANGLE ON: THÉODEN walks down the steps, holding HERUGRIM.   ANGLE ON: WORMTONGUE crawls away as he speaks.      THÉODEN continues his advance toward WORMTONGUE.         THÉODEN raises HERUGRIM to kill WORMTONGUE. ARAGORN stops him.       THÉODEN looks at ARAGORN and relents. ARAGORN offers his hand to WORMTONGUE, but WORMTONGUE spits in it and scrambles to his feet. ARAGORN shakes off the spittle  ANGLE ON: WORMTONGUE violently pushes his way through the CROWD OF BYSTANDERS.     Those on the STEPS solemnly watch WORMTONGUE depart.      WIDE ON: The crowd kneels before THÉODEN.", 
      "I've only ever served you, my lord."
   ], 
   [
      "Your leechcraft would have had me crawling on all fours like a beast!", 
      "Send me not from your sight."
   ], 
   [
      "No, my lord! No, my lord. Let him go. Enough blood has been spilt on his account.", 
      "Get out of my way!"
   ], 
   [
      "Gandalf the White. Gandalf the Fool!  Does he seek to humble me with his  newfound piety?", 
      "There were three who followed the wizard. An Elf, a Dwarf, and a Man."
   ], 
   [
      "There were three who followed the wizard. An Elf, a Dwarf, and a Man.", 
      "No, from the North. One of the Dúnedain  Rangers, I thought he was."
   ], 
   [
      "No, from the North. One of the Dúnedain  Rangers, I thought he was.", 
      "His cloth was poor. And yet he bore  a strange ring. Two serpents with  emerald eyes. One devouring, the other  crowned with golden flowers."
   ], 
   [
      "I do not think that will be your fate.", 
      "Théoden will not stay at Edoras."
   ], 
   [
      "Théoden will not stay at Edoras.", 
      "It’s vulnerable. He knows this. He will expect an attack on the city. They will flee to Helm’s Deep, the great fortress of Rohan."
   ], 
   [
      "It’s vulnerable. He knows this. He will expect an attack on the city. They will flee to Helm’s Deep, the great fortress of Rohan.", 
      "They will have women and children  with them."
   ], 
   [
      "Saruman's arm will have grown long  indeed if he thinks he can reach us  here.", 
      "CUT TO:"
   ], 
   [
      "CUT TO:", 
      "How? How can fire undo stone? What kind of device could bring down the wall?"
   ], 
   [
      "If the wall is breached, Helm's Deep will fall.", 
      "Even if it is breached, it would take a number beyond reckoning, thousands, to storm the keep."
   ], 
   [
      "Tens of thousands.", 
      "But, my lord, there is no such force."
   ]
]
 }