{ "lines" : [ 
{
   "sceneNum": 2, 
   "lineNum": 2, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "EXT. UCLA LAWN - DAY", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 2, 
   "lineNum": 4, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "AARON GREENBERG  is walking across the stage getting his diploma.  He could not be more excited.  If you could bottle enthusiasm, generosity of spirit and a touch of naivety, you would get this young gentleman.  He gets his diploma, hugs the president of the university hard, and waves to the crowd who cheer him on.  He throws kisses towards someone in particular.", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 2, 
   "lineNum": 6, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "ANGLE ON HIS PRETTY, ARTSY GIRLFRIEND, DAPHNE BINKS , also in a cap and gown, and her parents, MR. AND MRS. BINKS.  She smiles, waves and throws kisses back.", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 2, 
   "lineNum": 8, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "INT. ALDOUS’S GIANT MODERN APARTMENT - NIGHT", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 2, 
   "lineNum": 10, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "We hear the VOICE of Aldous Snow , English rock star, drugged out of his mind, in his empty apartment.  Floor to *ceiling windows look out on beautiful views of the Thames and  *the London cityscape.  We PAN PAST a leather couch, a pile of  *trash, an Andy Warhol on the floor, various drug paraphernalia.", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 2, 
   "lineNum": 12, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "You enjoying this?", 
   "characterName": "ALDOUS"
},{
   "sceneNum": 2, 
   "lineNum": 14, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "You know I am, love.", 
   "characterName": "PROSTITUTE"
},{
   "sceneNum": 2, 
   "lineNum": 16, 
   "scriptName": "sources/Get Him To The Greek.pdf", 
   "lineText": "REVEAL Aldous on the floor kissing a PROSTITUTE-LIKE WOMAN.", 
   "characterName": "DIRECTION"
},{
   "sceneNum": 0, 
   "lineNum": 2, 
   "scriptName": "sources/thankyouforsmoking.pdf", 
   "lineText": "A couple years ago, RJR Nabisco, the company that makes Camel cigarettes, was forced by a Supreme Court Injunction to discontinue the use of the character known as Joe Camel, due to its clear connection with teen smoking. However, many now feel that this is not enough. The question we continue to face is ‘What will it take to get kids off cigarettes?’", 
   "characterName": "OPRAH"
},{
   "sceneNum": 0, 
   "lineNum": 4, 
   "scriptName": "sources/thankyouforsmoking.pdf", 
   "lineText": "I want to introduce you to Sue Maclean, head of the National Organization of Mothers Against Smoking.", 
   "characterName": "OPRAH"
},{
   "sceneNum": 0, 
   "lineNum": 6, 
   "scriptName": "sources/thankyouforsmoking.pdf", 
   "lineText": "Just a foot soldier, Oprah.", 
   "characterName": "RON"
},{
   "sceneNum": 0, 
   "lineNum": 8, 
   "scriptName": "sources/thankyouforsmoking.pdf", 
   "lineText": "Robin Williger is a fifteen year old freshman from Racine, Wisconsin. He likes studying history and he’s on the debate team. Robin’s future looked bright, however recently, he was diagnosed with Cancer. A very tough kind of Cancer. Robin tells me he has quit smoking though and no longer thinks cigarettes are cool.", 
   "characterName": "OPRAH"
},{
   "sceneNum": 0, 
   "lineNum": 10, 
   "scriptName": "sources/thankyouforsmoking.pdf", 
   "lineText": "Nick Naylor is the Vice President of the Academy of Tobacco Studies. They are the tobacco industry’s main lobby in Washington, DC and Mr. Naylor is their chief spokesman.", 
   "characterName": "OPRAH"
}
 ]}