{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "Gandalf!", 
      "Nothing."
   ], 
   [
      "EXT. EMYN MUIL - LATER  WIDE ON: FOG lays heavy over the ROCKY LANDSCAPE of EMYN MUIL.  SUPER: THE TWO TOWERS  ANGLE ON: FRODO and SAM climb down a rock face toward the mist-covered ground.      ANGLE ON: FRODO looks down into the mist.      CLOSE ON: SAM clings to the ROPE and nods. He slowly continues.  ANGLE ON: The ROPE is tied securely around a rock at the top of the face.  ANGLE ON: SAM takes a step and loses his footing...A SMALL BOX tumbles out of his pocket! He desperately reaches for it.     ANGLE ON: FRODO looks up...THE BOX bounces down the rock... FRODO deftly catches it.   SUDDENLY, HE LOSES HIS FOOTING AND PLUNGES INTO THE MIST BELOW!     After only a few feet, FRODO lands softly on the ground.  Stunned, he looks about for a moment, and then up to SAM.     SAM quickly climbs downward and walks away from the rope.", 
      "Can you see the bottom?"
   ], 
   [
      "No! Don’t look down, Sam! Just keep  going!", 
      "Catch it! Grab it, Mr. Frodo!"
   ], 
   [
      "I think I’ve found the bottom.", 
      "5."
   ], 
   [
      "What’s in this?", 
      "Nothing. Just a bit of seasoning.  I thought maybe if we was having a  roast chicken one night or something."
   ], 
   [
      "Roast chicken?!", 
      "It’s very special, that. It’s the best  salt in all the Shire."
   ], 
   [
      "We can’t leave this here for someone  to follow us down.", 
      "Who’s gonna to follow us down here,  Mr. Frodo?"
   ], 
   [
      "Who’s gonna to follow us down here,  Mr. Frodo?", 
      "It’s a shame, really. Lady Galadriel  gave me that. Real Elvish rope."
   ], 
   [
      "It’s a shame, really. Lady Galadriel  gave me that. Real Elvish rope.", 
      "Well, there’s nothing for it. It’s one  of my knots. Won’t come free in a hurry."
   ], 
   [
      "Well, there’s nothing for it. It’s one  of my knots. Won’t come free in a hurry.", 
      "Mordor. The one place in Middle-earth  we don’t want to see any closer. And the one place we’re trying to get to. It’s just where we can’t get."
   ], 
   [
      "Mordor. The one place in Middle-earth  we don’t want to see any closer. And the one place we’re trying to get to. It’s just where we can’t get.", 
      "Let’s face it, Mr. Frodo, we’re lost."
   ], 
   [
      "Let’s face it, Mr. Frodo, we’re lost.", 
      "I don’t think Gandalf meant for us to come this way."
   ], 
   [
      "He didn’t mean for a lot of things to happen, Sam ... but they did.", 
      "SAM  It’s the Ring, isn’t it?"
   ], 
   [
      "It’s getting heavier.", 
      "Let me see."
   ], 
   [
      "Let me see.", 
      "More Lembas bread."
   ], 
   [
      "More Lembas bread.", 
      "I don't usually hold with foreign food, but this Elvish stuff, it’s not bad."
   ], 
   [
      "I don't usually hold with foreign food, but this Elvish stuff, it’s not bad.", 
      "Those rain clouds might."
   ], 
   [
      "Those rain clouds might.", 
      "This looks strangely familiar."
   ], 
   [
      "It burns! It burns us! It freezes! Nasty Elves twisted it. Take it off us!", 
      "Quiet, you!"
   ], 
   [
      "Quiet, you!", 
      "It’s hopeless. Every Orc in Mordor’s going to hear this racket. Let’s just tie him up and leave him."
   ], 
   [
      "No! That would kill us! Kill us!", 
      "It’s no more than you deserve!"
   ], 
   [
      "Yes...on the precious. On the precious.", 
      "I don’t believe you!"
   ], 
   [
      "And Orcses, thousands of Orcses.  And always the Great Eye watching,  watching.", 
      "Hey! Come back now! Come back!"
   ], 
   [
      "EXT. THE DEAD MARSHES - TWILIGHT  ANGLE ON: Sam’s foot slips in a puddle of muck...he starts backward to get a view of where they’re going.          WIDE ON: GOLLUM starts making his way across an invisible path across the wetlands. He looks back to the HOBBITS.      FRODO and SAM follow him.  EXT. AERIAL OF THE DEAD MARSHES - DAY  AERIAL: The DEAD MARSHES stretch for miles and miles as far as  the eye can see...FRODO, SAM, and GOLLUM appear AS TINY AS  SPECKS slowly crossing it.         EXT. THE DEAD MARSHES - DAY  ANGLE ON: FRODO, SAM and GOLLUM rest from the day’s journey.", 
      "It’s a bog. He’s led us into a swamp."
   ], 
   [
      "It tries to chokes us! We can’t eats  Hobbit food! We must starve!", 
      "Well, starve, then. And good riddance!"
   ], 
   [
      "EXT. THE DEAD MARSHES - DAY  GOLLUM leads SAM and FRODO into an area of the marshes where small flames burn on the surface of the mist-covered waters.   ANGLE ON: SAM suddenly stops and glimpses beneath the water’s surface.  ANGLE ON: PALLID FACES of dead MEN and ELVES float in the water.      ANGLE ON: FRODO looks to the disturbing sight.      ANGLE ON: GOLLUM stops and turns to the HOBBITS.        ANGLE ON: SAM slips into the water again...GOLLUM turns to  them quickly.     CLOSE ON: The DEAD FACES IN THE WATER.      ANGLE ON: SAM warily follows GOLLUM, but FRODO is drawn toward the water.   ANGLE ON: One of the DEAD dressed in ELVEN ARMOUR. It floats  just beneath the surface with a disturbing peacefulness.   ANGLE ON: FRODO draws himself closer and closer to the water.", 
      "There are dead things! Dead faces in  the water."
   ], 
   [
      "Or Hobbits go down to join the dead ones and light little candles of their own.", 
      "Frodo!"
   ], 
   [
      "Gollum!", 
      "Mr. Frodo! Are you all right?"
   ], 
   [
      "Hide! Hide!", 
      "Quick! They will see us! They will  see us!"
   ], 
   [
      "Quick! They will see us! They will  see us!", 
      "I thought they were dead!"
   ], 
   [
      "The Black Gate of Mordor.", 
      "Oh, save us."
   ], 
   [
      "Oh, save us.", 
      "My old Gaffer would have a thing or two to say if he could see us now."
   ], 
   [
      "EXT. BLACK GATE BATTLEMENTS - DAY  ANGLES ON: An ORC SOUNDS the HORN again...two enormous CAVE TROLLS work the MECHANISM to open the mighty gate...the ORCS  atop the BATTLEMENTS brace themselves as the GATE slowly  opens...the MIGHTY CAVE TROLLS open the heavy gate, walking along a thin walkway patrolled by the smaller ORCS.  EXT. EPHEL DÚATH - DAY  ANGLE ON: SAM points to the BLACK GATE.     HIGH WIDE ON: The BLACK GATE slowly opens to receive the approaching ARMY.  ANGLE ON: SAM crawls to a rock at the edge of the overlook.     SUDDENLY, THE ROCK GIVES WAY UNDER SAM AND RACES DOWN THE SIDE OF EPHEL DÚATH WITH SAM RIDING ATOP IT!     ANGLE ON: FRODO scrambles after SAM. GOLLUM breaks from his cowering to look up as FRODO runs off.     FRODO runs and slides down the side of EPHEL DÚATH.  EXT. BASE OF EPHEL DÚATH - DAY  FRODO slides to a stop behind a rock near the bottom.  ANGLE ON: One of the EASTERLING SOLDIERS looks up at the mountainside.  WIDE ON: A cloud of dust issues from the side of the mountain.   ANGLE ON: FRODO darts form behind one rock, slides down EPHEL DÚATH some more and comes to rest behind another rock.", 
      "Look! The gate. It's opening!"
   ], 
   [
      "Look! The gate. It's opening!", 
      "I can see a way down."
   ], 
   [
      "I do not ask you to come with me, Sam.", 
      "I know, Mr. Frodo. I doubt even these Elvish cloaks will hide us in there."
   ], 
   [
      "No! There’s another way. There’s another way. More secret. A dark way.", 
      "Why haven’t you spoken of this before?!"
   ], 
   [
      "Because Master did not ask.", 
      "He’s up to something."
   ], 
   [
      "EXT. ITHILIEN - DAY  WIDE ON: GOLLUM watches the water silently...  SUDDENLY, he thrusts in...loses his balance...and falls wholly into the stream...a fish, his prize, flies out of the water... GOLLUM grasps at it desperately causing him to slide downstream.   ANGLE ON: FRODO and SAM come over the rise behind him.         SAM stops and turns to FRODO.                    He pushes past SAM and stops.        POV: GOLLUM looks about for the fish...slowly, he realises it is lost...he looks up at FRODO and smiles.", 
      "Hey, stinker, don’t go getting too far ahead!"
   ], 
   [
      "Why do you do that?", 
      "What?"
   ], 
   [
      "Call him names. Run him down all the time.", 
      "Because. Because that's what he is, Mr. Frodo. There's naught left in him but lies and deceit. It's the Ring he wants. It's all he cares about."
   ], 
   [
      "Because I have to believe he can come back.", 
      "You can’t save him, Mr. Frodo."
   ], 
   [
      "I'm sorry, Sam. I don't know why I  said that.", 
      "I know what I have to do Sam. The Ring was entrusted to me. It's my task. Mine! My own!"
   ], 
   [
      "They are tender. They are nice. Yes, they are. Eat them. Eat them!", 
      "You’ll make him sick, you will..."
   ], 
   [
      "You’ll make him sick, you will...", 
      "...behaving like that!"
   ], 
   [
      "...behaving like that!", 
      "There’s only one way to eat a brace of coneys."
   ], 
   [
      "What’s to ruin? There’s hardly any meat on them.", 
      "What we need is a few good taters."
   ], 
   [
      "What’s taters, precious? What’s taters? Eh?", 
      "Po-ta-toes. Boil them, mash them, stick them in a stew. Lovely big golden chips with a nice piece of fried fish."
   ], 
   [
      "Po-ta-toes. Boil them, mash them, stick them in a stew. Lovely big golden chips with a nice piece of fried fish.", 
      "Even you couldn’t say no to that."
   ], 
   [
      "EXT. ITHILIEN FOREST - DAY  ANGLE ON: FRODO walks through the woods, still searching. The sound ensues again. FRODO looks in that direction and continues towards it.  EXT. ITHILIEN CAMPSITE - DAY  SAM brings down his ladle and looks about.      EXT. EDGE OF ITHILIEN - DAY  FRODO crawls to the edge of an overlook.   HIGH WIDE ON: A HARADRIM ARMY marches across the land below  him.   ANGLE ON: SAM and GOLLUM come up behind him.                     FRODO starts to leave...SUDDENLY, SAM grabs Frodo’s arm, entranced with the sight.", 
      "Mr. Frodo?"
   ], 
   [
      "Mr. Frodo?", 
      "Who are they?"
   ], 
   [
      "Who are they?", 
      "Ready to do what?"
   ], 
   [
      "To make his war. The last war that will cover all the world in Shadow.", 
      "Mr. Frodo. Look. It’s an oliphaunt."
   ], 
   [
      "Mr. Frodo. Look. It’s an oliphaunt.", 
      "No one at home will believe this."
   ], 
   [
      "Come on, Sam.", 
      "There are no travelers in this land. Only servants of the Dark Tower."
   ], 
   [
      "My Men tell me that you are Orc  spies.", 
      "Spies?! Now wait just a minute!"
   ], 
   [
      "Your bodyguard?", 
      "His gardener."
   ], 
   [
      "My Precious!", 
      "You can do it. Use the Ring, Mr. Frodo. Just this once. Put it on. Disappear."
   ], 
   [
      "I can’t. You were right, Sam. You tried to tell me but ... I’m sorry. The Ring’s taking me, Sam.   If I put it on, he’ll find me. He’ll see.", 
      "Mr. Frodo..."
   ], 
   [
      "No!!", 
      "Stop it! Leave him alone! Don’t you understand? He’s got to destroy it! That’s where we’re going ... into Mordor ... to the mountain of fire."
   ], 
   [
      "Osgiliath is under attack. They call for reinforcements.", 
      "Captain?"
   ], 
   [
      "Tell him Faramir sends a mighty gift. A weapon that will change our fortunes in this war.", 
      "You want to know what happened to Boromir?"
   ], 
   [
      "You want to know what happened to Boromir?", 
      "Watch out!"
   ], 
   [
      "Mr. Frodo?", 
      "They’re here."
   ], 
   [
      "Hold on little Hobbits!", 
      "What are you doing?"
   ], 
   [
      "What are you doing?", 
      "Where are you going?!"
   ], 
   [
      "I can’t do this, Sam.", 
      "I know. It’s all wrong. By rights we shouldn’t even be here."
   ], 
   [
      "I know. It’s all wrong. By rights we shouldn’t even be here.", 
      "But we are."
   ], 
   [
      "But we are.", 
      "How could the world go back to the way it was when so much bad had happened?"
   ], 
   [
      "Victory! We have victory!", 
      "But in the end, it’s only a passing thing, this shadow."
   ], 
   [
      "But in the end, it’s only a passing thing, this shadow.", 
      "Even darkness must pass. A new day will come."
   ], 
   [
      "Even darkness must pass. A new day will come.", 
      "Those were the stories that stayed  with you..."
   ], 
   [
      "Those were the stories that stayed  with you...", 
      "...that meant something. Even if you were too small to understand why."
   ], 
   [
      "...that meant something. Even if you were too small to understand why.", 
      "But I think, Mr. Frodo, I do understand. I know now."
   ], 
   [
      "But I think, Mr. Frodo, I do understand. I know now.", 
      "Folk in those stories had lots of chances of turning back only they didn’t. They kept going because they were holding on to something."
   ], 
   [
      "What are we holding on to, Sam?", 
      "There’s some good in this world, Mr. Frodo. And it’s worth fighting for."
   ], 
   [
      "This is the old sewer. Runs right under the river through to the edge of the city. You’ll find cover in  the woods there.", 
      "Captain Faramir...you have shown your quality, sir."
   ], 
   [
      "Captain Faramir...you have shown your quality, sir.", 
      "The very highest."
   ], 
   [
      "May death find you quickly if you  bring them to harm.", 
      "Save me?"
   ], 
   [
      "Nice Hobbits.", 
      "Very decent of you. Very decent, indeed, Gollum."
   ], 
   [
      "...somewhere in the wilderness.", 
      "I wonder if we’ll ever be put into songs or tales."
   ], 
   [
      "What?", 
      "I wonder if people will ever say,“Let’s hear about Frodo and the Ring.” And they’ll say “Yes, that’s one of my favorite stories. Frodo was really courageous, wasn’t he, dad.” “Yes, my boy, the most famousest of Hobbits. And that’s saying a lot.”"
   ], 
   [
      "So was I.", 
      "“Samwise the Brave.”"
   ], 
   [
      "Sméagol!", 
      "We’re not gonna wait for you. Come on!"
   ], 
   [
      "It’s too risky. It’s too risky.", 
      "Where is he? Where’s he gone? Hey, Gollum! Where are you?"
   ]
]
 }