{ "lines" :  
[
   [
      "sources/Get Him To The Greek.pdf", 
      "EXT. UCLA LAWN - DAY"
   ], 
   [
      "EXT. UCLA LAWN - DAY", 
      "AARON GREENBERG  is walking across the stage getting his diploma.  He could not be more excited.  If you could bottle enthusiasm, generosity of spirit and a touch of naivety, you would get this young gentleman.  He gets his diploma, hugs the president of the university hard, and waves to the crowd who cheer him on.  He throws kisses towards someone in particular."
   ], 
   [
      "AARON GREENBERG  is walking across the stage getting his diploma.  He could not be more excited.  If you could bottle enthusiasm, generosity of spirit and a touch of naivety, you would get this young gentleman.  He gets his diploma, hugs the president of the university hard, and waves to the crowd who cheer him on.  He throws kisses towards someone in particular.", 
      "ANGLE ON HIS PRETTY, ARTSY GIRLFRIEND, DAPHNE BINKS , also in a cap and gown, and her parents, MR. AND MRS. BINKS.  She smiles, waves and throws kisses back."
   ], 
   [
      "ANGLE ON HIS PRETTY, ARTSY GIRLFRIEND, DAPHNE BINKS , also in a cap and gown, and her parents, MR. AND MRS. BINKS.  She smiles, waves and throws kisses back.", 
      "INT. ALDOUS’S GIANT MODERN APARTMENT - NIGHT"
   ], 
   [
      "INT. ALDOUS’S GIANT MODERN APARTMENT - NIGHT", 
      "We hear the VOICE of Aldous Snow , English rock star, drugged out of his mind, in his empty apartment.  Floor to *ceiling windows look out on beautiful views of the Thames and  *the London cityscape.  We PAN PAST a leather couch, a pile of  *trash, an Andy Warhol on the floor, various drug paraphernalia."
   ], 
   [
      "You know I am, love.", 
      "REVEAL Aldous on the floor kissing a PROSTITUTE-LIKE WOMAN."
   ], 
   [
      "How about this?", 
      "Suddenly Aldous is peeing on the Prostitute."
   ], 
   [
      "How about this?", 
      "Aldous THROWS UP on the prostitute and COLLAPSES."
   ], 
   [
      "You piece of shit!", 
      "The Prostitute KICKS Aldous.  Aldous laughs as she leaves."
   ], 
   [
      "You are welcome, milady!", 
      "He lights a cigarette, grabs the remote and FLIPS ON THE TV."
   ], 
   [
      "He lights a cigarette, grabs the remote and FLIPS ON THE TV.", 
      "INT. SATURN DEALERSHIP - DAY"
   ], 
   [
      "INT. SATURN DEALERSHIP - DAY", 
      "We ZOOM IN on Aaron getting the keys to a brand new SATURN VUE.  He’s with Daphne.  They hug and kiss."
   ], 
   [
      "We ZOOM IN on Aaron getting the keys to a brand new SATURN VUE.  He’s with Daphne.  They hug and kiss.", 
      "EXT. HORSE AND CARRIAGE PUB - NIGHT"
   ], 
   [
      "EXT. HORSE AND CARRIAGE PUB - NIGHT", 
      "A crazily drunk Aldous gets TOSSED OUT of the pub’s PLATE GLASS WINDOW.  A BIG IRISH GUY comes out."
   ], 
   [
      "We should have killed all you Irish when we had the chance.", 
      "The Irish Guy GRABS Aldous.  Aldous licks the Irish guy’s face.  The Irish Guy drops him, disgusted."
   ], 
   [
      "*", 
      "EXT. DOWNTOWN LOS ANGELES ARTISTS’ LOFT BUILDING - DAY"
   ], 
   [
      "EXT. DOWNTOWN LOS ANGELES ARTISTS’ LOFT BUILDING - DAY", 
      "Aaron and Daphne are in a rather grungy area of downtown LA.  They walk through a protective cage into a newly renovated building that is advertising “Real Artists’ Lofts.”"
   ], 
   [
      "Aaron and Daphne are in a rather grungy area of downtown LA.  They walk through a protective cage into a newly renovated building that is advertising “Real Artists’ Lofts.”", 
      "INT. ARTIST LOFT APARTMENT - DAY"
   ], 
   [
      "INT. ARTIST LOFT APARTMENT - DAY", 
      "Aaron and Daphne walk with a REALTOR around the loft space.  There’s a studio with a potter’s wheel.  Daphne’s clearly in heaven."
   ], 
   [
      "Definitely!", 
      "Daphne jumps up and down, hugs Aaron and heads off to explore the loft.  Aaron looks very, very nervous."
   ], 
   [
      "Daphne jumps up and down, hugs Aaron and heads off to explore the loft.  Aaron looks very, very nervous.", 
      "INT. ALDOUS SNOWS’S LIVING ROOM - DAY"
   ], 
   [
      "INT. ALDOUS SNOWS’S LIVING ROOM - DAY", 
      "Aldous and a COURTNEY LOVE-ESQUE girlfriend."
   ], 
   [
      "THEN GET OUT OF HERE ALREADY YOU FUCKING BLOODY HELL BITCH!", 
      "Aldous grabs her.  She punches him in the face.  He punches her in the chest, and then they get into a crazy fist fight like a couple burly man.  In a crazy almost karate like move, she kicks his feet out from under him.  He CRASHES through a glass coffee table.  She leaves the room."
   ], 
   [
      "Aldous grabs her.  She punches him in the face.  He punches her in the chest, and then they get into a crazy fist fight like a couple burly man.  In a crazy almost karate like move, she kicks his feet out from under him.  He CRASHES through a glass coffee table.  She leaves the room.", 
      "His door flies open.  It’s the middle of the day in the center of London.  It’s very, very busy.  She’s walking across the lawn."
   ], 
   [
      "DON’T GO!!!  I LOVE YOU!!!  DON’T GO!!!  PLEASE!!!!", 
      "A YOUNG TWEEN GIRL and her FRIEND see Aldous."
   ], 
   [
      "It’s Aldous Snow!", 
      "They start taking photos with their camera phones.  Aldous flips them off."
   ], 
   [
      "Fuck off you cunts!", 
      "He heads back into his house."
   ], 
   [
      "That was brilliant!", 
      "Daphne’s parents, MR. AND MRS. BINKS are outside the protective cage.  They hit the buzzer.  A large group of homeless people walk by."
   ], 
   [
      "Where the hell are we, Kabul?", 
      "They hit the buzzer again."
   ], 
   [
      "Mom, dad, come on up!", 
      "INT. AARON AND DAPHNE’S LOFT APARTMENT - NIGHT"
   ], 
   [
      "INT. AARON AND DAPHNE’S LOFT APARTMENT - NIGHT", 
      "Aaron serves dinner to Daphne and DAPHNE’S PARENTS."
   ], 
   [
      "No.  Thank you./Couldn’t possibly.", 
      "Aaron sits down."
   ], 
   [
      "You should see the sculptures she’s doing.  She’s got some great projects up her sleeve.", 
      "We see that Daphne’s touched by Aaron standing up for her."
   ], 
   [
      "I guess I’ll just have to resort to my previous work -- male escort.", 
      "Daphne snickers.  Her parents do not."
   ], 
   [
      "Mom, you want to take a tour of the building?", 
      "Aaron’s awkwardly sitting in silence with Daphne’s dad in the living room."
   ], 
   [
      "*", 
      "Daphne and her mom return to the apartment."
   ], 
   [
      "Well that was fun.  I love your neighborhood.  It’s so... urban.  We should go before it gets any darker.", 
      "Aaron and Daphne are cleaning up the meal."
   ], 
   [
      "Are you kidding?  This is so super pretty.", 
      "REVEAL they’re discussing a sculpture of a bloody, screaming woman holding a bloody, screaming baby.  It’s more terrifying than pretty.  She definitely has talent, a dark weird talent."
   ], 
   [
      "Let’s make a game plan.  Rent a gallery downtown.  Advertise the show in LA Weekly.  Maybe do some guerrilla marketing stuff.  We’ll just get this done.", 
      "Aaron’s relentless positivity is starting to grate."
   ], 
   [
      "***", 
      "Daphne smiles at this."
   ], 
   [
      "And as for getting your career off the ground, just make a list of what needs doing.  That’s how I get stuff done.", 
      "Daphne takes a deep breath."
   ], 
   [
      "Cool.  I’ll try that.  I’ll just make a list.", 
      "Daphne leaves the room.  Aaron smiles after her."
   ], 
   [
      "Daphne leaves the room.  Aaron smiles after her.", 
      "INT. AARON AND DAPHNE’S LOFT APARTMENT - MORNING"
   ], 
   [
      "INT. AARON AND DAPHNE’S LOFT APARTMENT - MORNING", 
      "Aaron and Daphne are asleep.  The radio alarm goes off.  It’s six am.  Aaron sits up and smiles."
   ], 
   [
      "Aaron and Daphne are asleep.  The radio alarm goes off.  It’s six am.  Aaron sits up and smiles.", 
      "MUSIC CUE: Talking Heads “Love - Building on Fire.”"
   ], 
   [
      "MUSIC CUE: Talking Heads “Love - Building on Fire.”", 
      "-- Aaron’s singing to Talking Heads in the shower."
   ], 
   [
      "-- Aaron’s singing to Talking Heads in the shower.", 
      "-- Aaron flips on the coffee."
   ], 
   [
      "-- Aaron flips on the coffee.", 
      "-- Daphne lays out Aaron’s clothes on the bed.  Aaron puts on his clothes and looks at them in the mirror.  She gives him a thumbs up."
   ], 
   [
      "-- Daphne lays out Aaron’s clothes on the bed.  Aaron puts on his clothes and looks at them in the mirror.  She gives him a thumbs up.", 
      "-- Aaron peruses the LA Times, Variety, Billboard, and several other music magazines."
   ], 
   [
      "-- Aaron peruses the LA Times, Variety, Billboard, and several other music magazines.", 
      "-- Aaron drives to work, still singing to Talking Heads."
   ], 
   [
      "-- Aaron drives to work, still singing to Talking Heads.", 
      "Aaron pulls his car into the valet station at Pinnacle."
   ], 
   [
      "Then you have to park on the street.", 
      "MUSIC CUE: Talking Heads again"
   ], 
   [
      "MUSIC CUE: Talking Heads again", 
      "-- Aaron looks for parking"
   ], 
   [
      "-- Aaron looks for parking", 
      "-- Tries to park in a tiny space."
   ], 
   [
      "-- Tries to park in a tiny space.", 
      "-- Aaron reads the parking signs and realizes he has to move."
   ], 
   [
      "-- Aaron reads the parking signs and realizes he has to move.", 
      "Aaron pulls back in, big smile on his face."
   ], 
   [
      "Then it’s a $1.50 every twenty minutes.", 
      "Aaron walks into Pinnacle.  Marble, glass, brightly lit atrium.  It’s gorgeous.  A row of clocks LOS ANGELES NEW YORK  LONDON  MOSCOW  TOKYO line the wall."
   ], 
   [
      "How adorable.  Interns don’t meet with the head of the company.", 
      "The Receptionist looks on her computer."
   ], 
   [
      "And you have been assigned to classical.  Three floors down.  Enjoy.", 
      "Aaron looks past the receptionist at Sergio’s door opening and his assistant walking out."
   ], 
   [
      "Aaron looks past the receptionist at Sergio’s door opening and his assistant walking out.", 
      "Aaron sits before the GRAY-HAIRED VICE PRESIDENT of the CLASSICAL MUSIC DEPARTMENT."
   ], 
   [
      "Box those LPs.", 
      "He points to a disorderly pile of LPs and leaves the room."
   ], 
   [
      "He points to a disorderly pile of LPs and leaves the room.", 
      "CUT TO ONE HOUR LATER.  Aaron is finished boxing them.  He looks out."
   ], 
   [
      "CUT TO ONE HOUR LATER.  Aaron is finished boxing them.  He looks out.", 
      "*The Classical Music VP is looking at porn on his computer.  Aaron walks out past him.  He stops at the coffee machine and  *pours two cups of coffee.*"
   ], 
   [
      "*The Classical Music VP is looking at porn on his computer.  Aaron walks out past him.  He stops at the coffee machine and  *pours two cups of coffee.*", 
      "He sees the receptionist."
   ], 
   [
      "Sup, Andrea.", 
      "He walks past her."
   ], 
   [
      "Roma wants his latte.  I know.  You’d think he could get it himself.  Oh, and here’s a caramel latte for you.  Got an extra one.  Whatcha gonna do?", 
      "Aaron PUTS a caramel latte on her desk.  Andrea smiles, despite herself as Aaron heads STRAIGHT into Sergio’s office."
   ], 
   [
      "Aaron PUTS a caramel latte on her desk.  Andrea smiles, despite herself as Aaron heads STRAIGHT into Sergio’s office.", 
      "INT. SERGIO ROMA’S OFFICE - DAY"
   ], 
   [
      "INT. SERGIO ROMA’S OFFICE - DAY", 
      "Aaron walks in.  SERGIO ROMA, the charismatic terrifying president of Pinnacle, is on the phone.  He never yells.  Yelling is beneath him."
   ], 
   [
      "I am not the who gets fucked.  I am the one who does the fucking.  You see what I’m saying?  Ciao.", 
      "He hangs up."
   ], 
   [
      "Sergio, what is up?", 
      "Aaron holds out his hand.  Sergio looks at it for an uncomfortably long amount of time."
   ], 
   [
      "I remember everything.", 
      "He HITS a button."
   ], 
   [
      "Andrea, baby!", 
      "Andrea POKES HER HEAD IN."
   ], 
   [
      "Did I hire this guy from Columbia Records Vancouver?", 
      "Aaron smiles at her with all his might.  She can’t believe he’s lying."
   ], 
   [
      "Alright, baby.  Go now, go.", 
      "She leaves."
   ], 
   [
      "Honestly no.", 
      "-- Aaron washes Sergio’s car."
   ], 
   [
      "-- Aaron washes Sergio’s car.", 
      "-- Aaron shines Sergio’s shoes and picks up his dry cleaning.   *"
   ], 
   [
      "-- Aaron shines Sergio’s shoes and picks up his dry cleaning.   *", 
      "-- Aaron picks up Sergio’s food and then literally cuts his steak into bite size chunks."
   ], 
   [
      "-- Aaron picks up Sergio’s food and then literally cuts his steak into bite size chunks.", 
      "-- A very upset Sergio hands him a box.  Aaron opens it.  Inside is a dead cat.  Sergio hands Aaron a note.  CUT TO Aaron dropping the cat corpse off at a lab called GENETIC SAVINGS AND CLONE."
   ], 
   [
      "-- A very upset Sergio hands him a box.  Aaron opens it.  Inside is a dead cat.  Sergio hands Aaron a note.  CUT TO Aaron dropping the cat corpse off at a lab called GENETIC SAVINGS AND CLONE.", 
      "-- Aaron appears in the doorway holding a tray of cookies."
   ], 
   [
      "OK.", 
      "Aaron LEAVES the cookies.  Sergio takes a bite of cookie."
   ], 
   [
      "That’s a good fucking cookie.", 
      "Aaron drives out of the garage.  The PARKING ATTENDANT takes his parking ticket."
   ], 
   [
      "That’ll be $58.50.", 
      "INT. AARON AND DAPHNE’S APARTMENT - NIGHT"
   ], 
   [
      "INT. AARON AND DAPHNE’S APARTMENT - NIGHT", 
      "Aaron walks in.  Daphne watches Grey’s Anatomy with several girlfriends who wave at Aaron."
   ], 
   [
      "You started Grey’s without me!?", 
      "Aaron makes a pouty face."
   ], 
   [
      "Aaron makes a pouty face.", 
      "INT. AARON AND DAPHNE’S APARTMENT - LATER"
   ], 
   [
      "INT. AARON AND DAPHNE’S APARTMENT - LATER", 
      "Aaron and the girls all watch Grey’s together."
   ], 
   [
      "See, I disagree with that.  He’s really selfish; it’s just disguised as not knowing what he wants.  I’m sorry, I am just not on the McDreamy train.  Now, Dr. O’Malley.  Hello!", 
      "All the girls and Aaron laugh.  There are a couple cracker crumbs on the table.  Aaron grabs the Dustbuster and vacuums them up."
   ], 
   [
      "All the girls and Aaron laugh.  There are a couple cracker crumbs on the table.  Aaron grabs the Dustbuster and vacuums them up.", 
      "INT. AARON AND DAPHNE’S BEDROOM - NIGHT"
   ], 
   [
      "INT. AARON AND DAPHNE’S BEDROOM - NIGHT", 
      "Aaron gets into bed next to Daphne who’s reading Cosmo."
   ], 
   [
      "Totally.", 
      "They both laugh."
   ], 
   [
      "I didn’t think so.  Just kidding anyway.", 
      "They laugh some more.  Awkward pause.  Then Aaron kisses Daphne."
   ], 
   [
      "Good night.", 
      "Aaron flips off his light and turns over.  He kind of wants it and she kind of wants to do it."
   ], 
   [
      "Aaron flips off his light and turns over.  He kind of wants it and she kind of wants to do it.", 
      "Aldous’s in a drug induced stupor watching television.  He flips through the channels."
   ], 
   [
      "The Sunni Triangle is reporting more casualties --/World stock prices took a dip this morning --/ Pakistani officials would not respond--", 
      "Jackie Q, a slutty Fergie style singer, dances to a song called “Pound Me in the Buttocks.”  Aldous is risen from his stupor and pays attention to this news story."
   ], 
   [
      "********", 
      "Aldous looks shocked."
   ], 
   [
      "Aldous looks shocked.", 
      "Shots of Jackie Q, Aldous and a toddler with very long hair."
   ], 
   [
      "Aldous’s father, Jonathan Snow, in an unauthorized biography about his son titled “He’s Snow Angel” said that it was his son’s relationship with Jackie Q that knocked him off the wagon.", 
      "VIDEO OF ALDOUS’S FATHER, JONATHAN SNOW:"
   ], 
   [
      "Is it true you two are no longer in touch?", 
      "BACK TO THE ANCHORS:"
   ], 
   [
      "Aldous Snow?  Where’s that guy been?", 
      "They both laugh.  Aldous stares in disbelief."
   ], 
   [
      "They both laugh.  Aldous stares in disbelief.", 
      "Sergio’s in his office.  The Receptionist walks in."
   ], 
   [
      "No.  It’s not.  It’s really him.", 
      "Sergio takes a deep breath and grabs the phone.  SPLIT SCREEN.  Aldous is shirtless in bed.  He looks like death warmed over.  However, he has put on a super fake super happy positive voice."
   ], 
   [
      "Course, baby.  It was done yesterday.", 
      "Sergio PUMPS his fist.  On Aldous’s side, A TRAMPY GIRL comes  *up from under the covers."
   ], 
   [
      "Does it seem like I’m done down there?", 
      "She goes back below the covers."
   ], 
   [
      "She goes back below the covers.", 
      "INT. SERGIO’S OFFICE - MOMENTS LATER"
   ], 
   [
      "INT. SERGIO’S OFFICE - MOMENTS LATER", 
      "Sergio meets with Pinnacle’s Lawyer."
   ], 
   [
      "Good actually.  Different even.", 
      "The Pinnacle Lawyer gets up.  At the door, he turns."
   ], 
   [
      "I got an “ex” drug addict as a brother in law.  He always seems different.  Till he’s got a knife at your throat and your kids’ Nintendo Wii in his Jetta.", 
      "INT. SERGIO’S OFFICE - LATER"
   ], 
   [
      "INT. SERGIO’S OFFICE - LATER", 
      "*Sergio and several other EXECUTIVES are watching a youtube clip of Aldous on Sergio’s computer.  He’s on a stage in some  *outdoor festival."
   ], 
   [
      "You all want to see something fantastic?", 
      "The crowd cheers.  Aldous PUNCHES HIMSELF IN THE HEAD OVER AND OVER AGAIN, turning his head into a bloody mess.  We then CUT BACK TO THE EXECUTIVES."
   ], 
   [
      "There’s no way this could get any worse.", 
      "Suddenly all three of them turn away from the screen.  We don’t see what it happened."
   ], 
   [
      "**", 
      "REVEAL Aaron standing at the doorway."
   ], 
   [
      "REVEAL Aaron standing at the doorway.", 
      "INT. SERGIO’S OFFICE"
   ], 
   [
      "INT. SERGIO’S OFFICE", 
      "Sergio sits across from Aaron who’s pitching his heart out."
   ], 
   [
      "Yeah, I think you do.", 
      "Beat.  Sergio smiles at Aaron’s balls."
   ], 
   [
      "Understood.", 
      "Aaron leaves the office, a huge smile on his face."
   ], 
   [
      "Aaron leaves the office, a huge smile on his face.", 
      "Aaron runs in.  Daphne is reading a magazine."
   ], 
   [
      "English.", 
      "INT. AARON AND DAPHNE’S APARTMENT - EARLY MORNING"
   ], 
   [
      "INT. AARON AND DAPHNE’S APARTMENT - EARLY MORNING", 
      "FULL SCREEN CHYRON: 48 HOURS UNTIL THE GREEK"
   ], 
   [
      "FULL SCREEN CHYRON: 48 HOURS UNTIL THE GREEK", 
      "The alarm goes off.  It reads 6:00AM.  Aaron’s already awake."
   ], 
   [
      "The alarm goes off.  It reads 6:00AM.  Aaron’s already awake.", 
      "MUSIC CUE: Talking Heads."
   ], 
   [
      "MUSIC CUE: Talking Heads.", 
      "-- Aaron jumps out of bed."
   ], 
   [
      "-- Aaron jumps out of bed.", 
      "-- Daphne helps Aaron finish packing his suitcase."
   ], 
   [
      "-- Daphne helps Aaron finish packing his suitcase.", 
      "-- Aaron kisses Daphne."
   ], 
   [
      "-- Aaron kisses Daphne.", 
      "An Escalade limo’s parked outside.  Aaron walks out with his backpack."
   ], 
   [
      "Aaron Greenberg?  You need help with your luggage?", 
      "Aaron is about to get into the limo."
   ], 
   [
      "Actually, sure.", 
      "Aaron hands the limo driver his backpack.  The limo driver opens the back of the Escalade and puts the backpack in it."
   ], 
   [
      "Aaron hands the limo driver his backpack.  The limo driver opens the back of the Escalade and puts the backpack in it.", 
      "INT. LIMO - DAY"
   ], 
   [
      "INT. LIMO - DAY", 
      "Aaron’s in the backseat.  The limo driver’s driving.  There’s at least an acre of space between Aaron and the limo driver.  Aaron’s in heaven."
   ], 
   [
      "Can’t say.", 
      "Beat."
   ], 
   [
      "They’re all you.", 
      "Aaron takes a Diet Coke.  He then takes a glass out of the cabinet and tries to pour it into the glass so as to use all the limo accoutrements.  They hit a pothole and he spills the Diet Coke everywhere.  He looks at the driver who doesn’t seem to have noticed.  He starts to pour again and the driver STOPS SHORT.  He spills the rest of the Coke all over himself.  He gingerly places the cup back into the cupholder."
   ], 
   [
      "Sweet.", 
      "INT. BRITISH AIRWAYS - FIRST CLASS - LATER"
   ], 
   [
      "INT. BRITISH AIRWAYS - FIRST CLASS - LATER", 
      "Aaron sits down in first class.  He can’t believe how nice it is.  A FLIGHT ATTENDANT WALKS BY."
   ], 
   [
      "I’m actually on the clock, Veronica, but... what the hell.  You only live once.", 
      "CUT TO LATER ON THE FLIGHT.  Aaron’s asleep while dressed head to toe in the British Airways first class schwag with his television on I, Robot."
   ], 
   [
      "CUT TO LATER ON THE FLIGHT.  Aaron’s asleep while dressed head to toe in the British Airways first class schwag with his television on I, Robot.", 
      "FULL SCREENED TITLE: LONDON, UK."
   ], 
   [
      "FULL SCREENED TITLE: LONDON, UK.", 
      "Aaron stands outside, getting his courage to hit the buzzer.   *He finally HITS it.  A dude OPENS the door.  *"
   ], 
   [
      "Right-o.", 
      "The Dude WALKS into the building, Aaron following."
   ], 
   [
      "The Dude WALKS into the building, Aaron following.", 
      "Aaron walks into the Aldous’s apartment.  Aldous’s hanging out with the a bunch of super cool, English Guys."
   ], 
   [
      "It’s super lame, I know.", 
      "An older sexy lady named LENA walks up to Aaron.  Aldous puts  *his arm around her like they’re a couple.*"
   ], 
   [
      "This is my mother, Lena.  Looking gorgeous as always.", 
      "Aldous and Lena KISS on the lips."
   ], 
   [
      "Not as much as you spoil me.  No other woman on Earth has ever loved me as much as you do.", 
      "They kiss on the lips again.  Lena heads out."
   ], 
   [
      "So then what happened?", 
      "Aldous hands Aaron his joint.  Aaron, not wanting to seem uncool, takes a toke."
   ], 
   [
      "Cops busted in, looked for my shit, couldn’t find it, left, and then we fucked.", 
      "The guys all laugh.  Then out of the laughter, we here Aaron say..."
   ], 
   [
      "One time I was on the road, teen tour, and me and my junk buddies -- we were like super into junk at the time.  Like you know that movie Trainspotting?", 
      "They all nod."
   ], 
   [
      "It was something.  It was.", 
      "Long awkward beat."
   ], 
   [
      "And tea and chocolate Hobnobs are served.", 
      "Aldous and Aaron are accompanied out the door by his mom."
   ], 
   [
      "I love you, mum.  We’re always afraid to say what we really mean.  I mean, this could very well be the last time I ever see you.  I love you and I’m not afraid to tell you that.", 
      "Aldous and Lena hug.  Aldous starts tearing up."
   ], 
   [
      "What a sensitive lad.  Keep an eye on him, Aaron of Los Angeles.", 
      "Lena hugs Aldous and kisses him on the lips.  She then hugs *Aaron and Aaron awkwardly and accidentally kisses Lena on the  *lips.  No one seems to notice.  Aaron leans into the car.*"
   ], 
   [
      "Not yet.  We gotta stop by Captain Knob’s first.  If I’m gonna perform, I need my bandmates.", 
      "EXT. CAPTAIN KNOB’S HOUSE - DAY"
   ], 
   [
      "EXT. CAPTAIN KNOB’S HOUSE - DAY", 
      "Aldous and Aaron stand outside a country house.  The door swings open revealing CAPTAIN KNOB."
   ], 
   [
      "What the fuck are you doing here?", 
      "After a charged moment, they hug."
   ], 
   [
      "Aaron Greenberg from Pinnacle --", 
      "Captain Knob’s INCREDIBLY HOT WIFE, ABBY, appears behind him with two kids."
   ], 
   [
      "Oh, shit.", 
      "Aldous waves to her."
   ], 
   [
      "All cleaned up now, Abby.  I promise.", 
      "INT. CAPTAIN KNOB’S HOUSE"
   ], 
   [
      "INT. CAPTAIN KNOB’S HOUSE", 
      "Captain Knob sits on the couch feeding a baby with a bottle while TWO BOYS wrestle behind him.  Abby puts tea sandwiches down before them."
   ], 
   [
      "Look.  I would love to.  And I’m thankful, believe you me, I am.  Infant Sorrow got me all this.  The house, the wife’s clothes, the two Bentleys, my soccer field.", 
      "PAN TO REVEAL that through his living room windows is his own  **personal soccer field."
   ], 
   [
      "But my life is perfect now.  I grow my own strawberries.  I cook.  I’ve started painting.", 
      "PAN TO REVEAL a porny, nude portrait of Captain Knob’s wife."
   ], 
   [
      "One moment please.", 
      "The boys leave."
   ], 
   [
      "Every one of my days is filled with such joy and meaning and familial love.  And after one day on the road with this bloke, I’ll be licking coke out of some whore’s asshole.  And then I’ll lose this, all of it.", 
      "Captain Knob BURPS his baby."
   ], 
   [
      "Captain Knob BURPS his baby.", 
      "The Limo Driver gets into the front seat.  Aaron starts to sit in the front with the Limo Driver."
   ], 
   [
      "Oh, yeah.  Of course.", 
      "Aaron and Aldous sit in the back seat."
   ], 
   [
      "Totally.  It’s like...", 
      "Aaron mimes a pussy-whipping.  Aldous looks at Aaron, sizing him up for the first time."
   ], 
   [
      "This bird I love who lives in LA, she just got engaged, so I’m gonna try to get her back and if she don’t take me back I’m gonna kill myself.", 
      "Aaron laughs, thinking Aldous is joking."
   ], 
   [
      "I’m not the rock star.  You are.", 
      "Aaron looks out the window and smiles.  This is way easier than he thought it would be."
   ], 
   [
      "Aaron looks out the window and smiles.  This is way easier than he thought it would be.", 
      "INT. HEATHROW - BATHROOM - DAY"
   ], 
   [
      "INT. HEATHROW - BATHROOM - DAY", 
      "Aaron’s on his cell phone.  SPLIT SCREEN with Sergio who runs  **on a treadmill incredibly fast without sweating or even really breathing hard.*"
   ], 
   [
      "Turn your back at your own peril.  Call me the millisecond you land.", 
      "Sergio hangs up on Aaron."
   ], 
   [
      "Sergio hangs up on Aaron.", 
      "INT. HEATHROW - SECURITY LINE - LATER"
   ], 
   [
      "INT. HEATHROW - SECURITY LINE - LATER", 
      "Aldous and Aaron are standing in line.  Aaron is talking and smiling while Aldous is starting to look a bit uneasy."
   ], 
   [
      "What?  Why’re you whispering, buddy?  You got a secret?", 
      "Aldous is shoving a balloon of heroin into Aaron’s hand.  As Aaron and Aldous have this exchange the line moves them closer and closer to the scary looking British security services.  NOTE: This whole fight is done in angry whispers."
   ], 
   [
      "It’s heroin, what do you think it is?", 
      "Aldous grabs Aaron’s pants and starts to try to shove the heroin down his pants.  Aaron tries to get away.  The Security looks over to see what the commotion is about."
   ], 
   [
      "Shove it up your ass or I throw a bloody fit and we’re both sent to Guantanamo to be assraped by bin Laden.", 
      "They’re almost at the head of the line... Aaron sees his life flashing before his eyes.  He grabs the balloon and shoves it down the back of his pants."
   ], 
   [
      "Not so hasty.", 
      "Aldous pulls a tube of KY Jelly out of his manpurse and spritzes it on the balloon in Aaron’s hand.  Aaron shoves the balloon down his pants, grimaces and shoves it up his ass.  He removes his hand."
   ], 
   [
      "On occasion.", 
      "Suddenly they’re at the front of the line.  Aaron holds his hand away from his body, disgusted as to where it’s been."
   ], 
   [
      "What’s the deal with this?", 
      "REVEAL the manpurse is filled with needles."
   ], 
   [
      "Good to meet you mate.", 
      "The Heathrow Security Guy holds out his hand.  Aaron doesn’t know what to do.  Before he knows it, he’s shaking the Security guy’s hand with his dirty hand.  The guy then picks his nose and helps an old lady through the detector."
   ], 
   [
      "The Heathrow Security Guy holds out his hand.  Aaron doesn’t know what to do.  Before he knows it, he’s shaking the Security guy’s hand with his dirty hand.  The guy then picks his nose and helps an old lady through the detector.", 
      "Aaron and Aldous sit in the first class club.  Aldous is leafing through NME magazine.  Aaron’s trying not to hyperventilate."
   ], 
   [
      "You’d feel like a warmth, followed by like a stinging pain, like a real sharp stinging fiery pain, followed by organ failure and death.", 
      "A Club Waitress appears."
   ], 
   [
      "Here you go, Mr. Greenberg.", 
      "The Flight Attendant heads off."
   ], 
   [
      "Drink it the fuck down.", 
      "Aldous grabs the drink and brings it up to Aaron’s lips.  Aaron drinks it down."
   ], 
   [
      "I’m just going to see if our flight’s on time.", 
      "INT. BRITISH AIRWAYS CLUB - DESK"
   ], 
   [
      "INT. BRITISH AIRWAYS CLUB - DESK", 
      "Aaron’s at the desk, talking to the female Club Attendant."
   ], 
   [
      "It is.", 
      "Aldous comes up behind Aaron."
   ], 
   [
      "Here you go, love.", 
      "Aldous tosses a bundle of cash on the table."
   ], 
   [
      "I see no reason not to.", 
      "Aaron watches in terror as their old tickets are TORN UP and replaced with new NEW YORK CITY tickets."
   ], 
   [
      "Aaron watches in terror as their old tickets are TORN UP and replaced with new NEW YORK CITY tickets.", 
      "INT. BRITISH AIRWAYS - FIRST CLASS"
   ], 
   [
      "INT. BRITISH AIRWAYS - FIRST CLASS", 
      "A terrified Aaron and Aldous head down the gangplank.  They are greeted by the Flight Attendant."
   ], 
   [
      "May I lead you to your seats?", 
      "The Flight Attendant leads them to their seats.  Aldous heads to the bathroom.  Aaron’s phone rings.  He answers it. SPLIT SCREEN between him and Daphne.  Daphne has a giant bouquet of flowers."
   ], 
   [
      "How’s it going?", 
      "Aaron decides whether to lie."
   ], 
   [
      "That’s hilarious.  I love you and your hilarity.", 
      "He hangs up."
   ], 
   [
      "He hangs up.", 
      "EXT. AIRPLANE - DAY"
   ], 
   [
      "EXT. AIRPLANE - DAY", 
      "The plane takes off."
   ], 
   [
      "The plane takes off.", 
      "INT. BRITISH AIRWAYS - DAY"
   ], 
   [
      "INT. BRITISH AIRWAYS - DAY", 
      "Aaron stares at the Fasten Seat Belt sign.  It’s still illuminated.  Aldous opens his manpurse."
   ], 
   [
      "If for any crazy reason, I have a health emergency, solution’s in here.", 
      "REVEAL that the manpurse is filled with needles and every single kind of painkiller.  As Aldous says each thing, he pulls the appropriate pill or bandage out of the purse."
   ], 
   [
      "I got a headache, I got a bad headache, I got a really bad headache, I got a bullet in m’leg or knife in m’arm, and, of course, if my heart’s stopped.", 
      "Aldous pulls out an adrenaline needle."
   ], 
   [
      "Yeah, sure.", 
      "The Fasten Seat Belt Light flips off."
   ], 
   [
      "You take a shit you owe me a thousand quid.", 
      "The seatbelt sign BINGS off."
   ], 
   [
      "**", 
      "*Aaron nods.  We follow him in ONE LONG, UNCUT SHOT as he *WALKS UP TO THE GALLEY, pours himself a glass of water and *then HEADS BACK TO HIS SEAT to find Aldous HAVING SEX WITH A FLIGHT ATTENDANT.  Aaron, not knowing what to do, continues *PAST THEIR SEATS to the bathroom.  Aaron starts to sweat hard   *The bathroom light goes out and a businessman steps out.  Aaron heads into the bathroom."
   ], 
   [
      "*Aaron nods.  We follow him in ONE LONG, UNCUT SHOT as he *WALKS UP TO THE GALLEY, pours himself a glass of water and *then HEADS BACK TO HIS SEAT to find Aldous HAVING SEX WITH A FLIGHT ATTENDANT.  Aaron, not knowing what to do, continues *PAST THEIR SEATS to the bathroom.  Aaron starts to sweat hard   *The bathroom light goes out and a businessman steps out.  Aaron heads into the bathroom.", 
      "Aaron sits down on the toilet and starts to do his business."
   ], 
   [
      "Aaron sits down on the toilet and starts to do his business.", 
      "INT. BRITISH AIRWAYS - FIRST CLASS"
   ], 
   [
      "INT. BRITISH AIRWAYS - FIRST CLASS", 
      "Aldous sees Aaron’s seat is empty.   Aldous jumps up and heads to the bathroom and starts knocking on the door."
   ], 
   [
      "Because if you’re currently shitting, you are stealing from me.  Let me in or I swear I’ll punch my shoulder straight through the door.  I’m hyperventilating!  Let me in!", 
      "Aaron opens the door."
   ], 
   [
      "Everything’s fine.", 
      "Aldous pushes Aaron into the bathroom and closes the door."
   ], 
   [
      "Aldous pushes Aaron into the bathroom and closes the door.", 
      "INT. BRITISH AIRWAYS - BATHROOM - CONTINUOUS"
   ], 
   [
      "INT. BRITISH AIRWAYS - BATHROOM - CONTINUOUS", 
      "Aaron and Aldous are now in the bathroom."
   ], 
   [
      "You fucking evacuated it you cunt!  If we don’t find it you owe me a thousand quid!", 
      "Aldous starts digging around in the toilet."
   ], 
   [
      "I wouldn’t do that.  Seriously, let’s just go back to our seats.  I’m sure we can figure this out once we get to New York.  They have H in New York, right?  Please, Aldous --", 
      "Aldous brings his hand into frame.  It’s covered in the blue liquid of the toilet"
   ], 
   [
      "You calm down immediately and help me retrieve my property!", 
      "Aaron starts digging around in the toilet along with Aldous."
   ], 
   [
      "I’m afraid!  I heard that this woman was sitting on the toilet and hit the flusher and it sucked out her intestines!  I do not want that to happen to me.", 
      "Aldous HITS the flusher and Aaron’s hand gets sucked and stuck partially in the toilet."
   ], 
   [
      "I can’t, it’s stuck!", 
      "Aldous grabs Aaron’s arm and YANKS IT out of the toilet."
   ], 
   [
      "You’ve got it!", 
      "Aaron looks in his hand.  There indeed is the balloon."
   ], 
   [
      "Thanks.  Thank you.", 
      "Aldous hugs Aaron."
   ], 
   [
      "Here’s your property.", 
      "Aaron tries to hand Aldous back the drugs."
   ], 
   [
      "Put it back up there.  You know what happens if I’m caught with it?  You know, right?  I’ll give you some privacy.", 
      "Aldous leaves the bathroom."
   ], 
   [
      "Aldous leaves the bathroom.", 
      "INT. BRITISH AIRWAYS - FIRST CLASS"
   ], 
   [
      "INT. BRITISH AIRWAYS - FIRST CLASS", 
      "Aaron sits back down next to Aldous.  Aldous leans over and shows Aaron a photo on his cell."
   ], 
   [
      "Check this out.  That’s our flight attendant, ten minutes ago.", 
      "It’s a photo Aldous took of him having sex with the flight attendant."
   ], 
   [
      "Them meal carts are sharp.", 
      "Aaron takes the phone and starts scrolling through it.  It’s filled with photos of Aldous with different women."
   ], 
   [
      "If my mobile could talk... it would mainly talk about fucking.", 
      "FULL SCREEN CHYRON: MANHATTAN, NEW YORK.  36 HOURS UNTIL GREEK."
   ], 
   [
      "FULL SCREEN CHYRON: MANHATTAN, NEW YORK.  36 HOURS UNTIL GREEK.", 
      "Aaron and Aldous get in the car."
   ], 
   [
      "I know that.  You’re like a nagging wife.  Nag nag nag.", 
      "INT. FOUR SEASONS NEW YORK - BATHROOM"
   ], 
   [
      "INT. FOUR SEASONS NEW YORK - BATHROOM", 
      "Aaron’s on his cell while washing the drug balloon."
   ], 
   [
      "Two first class one ways from New York to LA.  Whatever airline leaves first.  I don’t care.", 
      "His phone beeps.  Aaron looks at it.  Shit.  SPLIT SCREEN with Sergio who’s having brunch in a beautiful outdoor cafe with ten FASHIONABLE, WEALTHY-SEEMING GUYS."
   ], 
   [
      "Flight 543 --", 
      "Aaron mumbles the rest.  We hear a NYC siren go by in the BG."
   ], 
   [
      "Don’t do that.", 
      "Sergio hangs up.  Aaron flips back."
   ], 
   [
      "Alrighty then.  It’s a Mastercard.", 
      "Aaron brings the now squeaky clean heroin balloon into frame."
   ], 
   [
      "Aaron brings the now squeaky clean heroin balloon into frame.", 
      "INT. FOUR SEASONS NEW YORK - INCREDIBLE SUITE - DAY"
   ], 
   [
      "INT. FOUR SEASONS NEW YORK - INCREDIBLE SUITE - DAY", 
      "Aldous is sitting on the balcony.  Pigeons walk along the railing.  Aaron walks out onto the balcony and puts the now cleaned up balloon in front of Aldous."
   ], 
   [
      "But hopped up on smack.  And fucking Giselle Bunchen.  Enjoy the view and order anything you want from room service.", 
      "Aldous heads into the room.  Aaron looks out at the view.  It’s a pretty amazing view.  He smiles again.  This is rock star living no matter if you had to have a balloon of heroin up your ass to achieve it.  He sees the balloon on the table.  He touches it.  He holds it in his hand and squeezes it.  He squeezes it again.  He starts absentmindedly squeezing it like a stress ball while looking out at the view."
   ], 
   [
      "New York City.", 
      "Suddenly POP.  Powder heroin everywhere."
   ], 
   [
      "Oh, boy.", 
      "Aaron stands, panicked.  He looks up and sees a napkin inside.  He runs inside and runs back out with the napkin.  A flock of pigeons descend and start eating the heroin."
   ], 
   [
      "No!  Shoo!  No!  Don’t eat that!  You do not want to eat that!", 
      "The pigeons won’t budge.  Aldous walks out."
   ], 
   [
      "So, where do you want to go tonight?", 
      "He sees what’s going on.  Aaron doesn’t know what to do."
   ], 
   [
      "He sees what’s going on.  Aaron doesn’t know what to do.", 
      "EXT. UNDER THE TRIBORO BRIDGE - DAY"
   ], 
   [
      "EXT. UNDER THE TRIBORO BRIDGE - DAY", 
      "Aaron and Aldous are in a car service in a particularly seedy section of New York.  A group of homeless men are talking around a garbage can."
   ], 
   [
      "How many pounds of heroin has Geffen transported up his ass in his lifetime to get his yacht?  More than an ounce.", 
      "EXT. UNDER THE TRIBORO BRIDGE - DAY"
   ], 
   [
      "EXT. UNDER THE TRIBORO BRIDGE - DAY", 
      "Aaron walks towards the trash can.  He turns to see the limo drive away, Aldous giving him a thumbs up.  Aaron joins the group of guys around the garbage can."
   ], 
   [
      "Fuck off.", 
      "The Homeless Guy walks away."
   ], 
   [
      "Alright, that’s cool.", 
      "Aaron looks around.  A SCUMBAG GUY comes up to him."
   ], 
   [
      "Toss your cash down there.  Or I’ll blow your brains out.", 
      "The Scumbag wanders away.  Aaron looks around and then tosses the cash in the garbage can.  He looks at the alley."
   ], 
   [
      "Mother effer.", 
      "EXT. ALLEY - DAY"
   ], 
   [
      "EXT. ALLEY - DAY", 
      "It’s a terrifying alley.  Like it could not be scarier.  Aaron looks down the alley.  Aaron takes out his cell and dials.  Daphne answers.  She’s at Banana Republic.  As Aaron talks, he walks down the alley."
   ], 
   [
      "I love the Banana Republic.  I love you forever.", 
      "He gets to the end of the alley.  Suddenly the same Scumbag comes out of the shadows.  He’s dressed slightly differently."
   ], 
   [
      "Gotta go.", 
      "Aaron abruptly hangs up."
   ], 
   [
      "*", 
      "He holds his hand out.  Aaron shakes it."
   ], 
   [
      "I’m ready when you are.", 
      "Gritty opens his mouth and points to the package which is in his mouth."
   ], 
   [
      "Then you ain’t getting no package.", 
      "Aaron and Gritty basically French kiss so that Gritty can pass the package to Aaron’s mouth.  Aaron takes it out and puts it in his pocket."
   ], 
   [
      "Put that shit in your mouth or I’ll shiv you and you’ll be dead in seconds.", 
      "Aaron puts the package of drugs in his mouth."
   ], 
   [
      "You’re a good dude.  Now turn away!  Do not look to see where I am going!  If you look I will shiv you!", 
      "Aaron looks away.  After a couple minutes he looks up.  Gritty’s standing at the end alley."
   ], 
   [
      "Man, cabs just do not come down here.  Wanna walk with me to the subway?", 
      "INT. FOUR SEASONS NEW YORK - INCREDIBLE SUITE"
   ], 
   [
      "INT. FOUR SEASONS NEW YORK - INCREDIBLE SUITE", 
      "Aaron puts the drugs on the table."
   ], 
   [
      "You are a dear.  A total dear.", 
      "Aldous hugs Aaron."
   ], 
   [
      "I got you a present.", 
      "Aldous hands Aaron diamond earrings."
   ], 
   [
      "I’ve been a shit.  It is completely necessary.  It is the most necessary thing I have done in my entire life.  I’ll be back in a moment and then let’s go to Manny’s to get me an axe.", 
      "Aldous leaves.  Aaron looks at the diamonds."
   ], 
   [
      "Wow.", 
      "INT. FOUR SEASONS NEW YORK - BEDROOM"
   ], 
   [
      "INT. FOUR SEASONS NEW YORK - BEDROOM", 
      "Aldous WATCHES television.  ANGLE ON THE TELEVISION is a Jackie Q video.  She’s singing an incredibly sultry version of “Ring Around the Rosy.”"
   ], 
   [
      "*****", 
      "Jackie pushes her hands down towards her crotch and winks *towards camera.  Then an Aldous from happier times appears on  *screen next to her. *"
   ], 
   [
      "And we all!  Go!  Down!", 
      "They kiss and then FALL OUT OF FRAME.  ANGLE ON THE DOOR AS Aaron enters the bedroom.  Aldous’s passed out on the bed in a drug induced stupor.  It’s a creepy, sad moment."
   ], 
   [
      "Of course.", 
      "Aaron closes the door.  He doesn’t look happy about this."
   ], 
   [
      "Aaron closes the door.  He doesn’t look happy about this.", 
      "EXT. MANNY’S MUSIC - DAY"
   ], 
   [
      "EXT. MANNY’S MUSIC - DAY", 
      "Aldous and Aaron get out of a limo at the venerable New York institution, Manny’s Music."
   ], 
   [
      "Aldous and Aaron get out of a limo at the venerable New York institution, Manny’s Music.", 
      "INT. MANNY’S MUSIC - CONTINUOUS"
   ], 
   [
      "INT. MANNY’S MUSIC - CONTINUOUS", 
      "They walk inside.  Guitars everywhere.  Guitars cover the walls, the floor, etc.  The shop is immediately abuzz.  Aldous Snow, famous rocker, has walked inside.  PHIL, the store’s owner, comes up to them."
   ], 
   [
      "What do you think?", 
      "Phil hands an electric Stratocaster to Aldous."
   ], 
   [
      "I heard a bit about that, sure.", 
      "Aldous starts strumming Let It Be.  As he plays, a crowd gathers around him.  Aaron starts to smile.  This is actually pretty cool."
   ], 
   [
      "When I find myself in times of trouble, mother Mary comes to me,speaking words of wisdom, let it be./", 
      "The crowd starts crying as well.  Even Aaron is tearing up."
   ], 
   [
      "Let it be, let it be, let it be, let it be.  Whisper words of wisdom, let it be./Let it be, let it be, let it be, there will be answer, let it be, let it be.", 
      "Aldous is crying.  Phil is crying.  Aaron is crying.  The crowd is crying.  It’s an incredibly emotional moment.  Aldous starts to howl with sadness.  Suddenly some of the crowd stop crying.  Aldous then takes the guitar and smashes it.  In his extreme sadness, Aldous takes the destroyed guitar and starts smashing all the guitars on the floor and in the store."
   ], 
   [
      "Aldous is crying.  Phil is crying.  Aaron is crying.  The crowd is crying.  It’s an incredibly emotional moment.  Aldous starts to howl with sadness.  Suddenly some of the crowd stop crying.  Aldous then takes the guitar and smashes it.  In his extreme sadness, Aldous takes the destroyed guitar and starts smashing all the guitars on the floor and in the store.", 
      "Phil and Aaron go to grab him."
   ], 
   [
      "Let is be!  Let it be!  Let it be!", 
      "With wild abandon, Aldous goes crazy.  Aaron jumps on Aldous’s back to try to stop him."
   ], 
   [
      "Ahhhh!  Unhand me!  Let me be!  Let me be!", 
      "Aldous spins wildly and then backs Aaron into the glass window, cracking it."
   ], 
   [
      "Aldous spins wildly and then backs Aaron into the glass window, cracking it.", 
      "EXT. MANNY’S MUSIC"
   ], 
   [
      "EXT. MANNY’S MUSIC", 
      "Aaron pulls Aldous out of the shop.  The limo pulls up.  The Limo Driver gets out and Aldous jumps in.  Phil comes out."
   ], 
   [
      "Does it look like I give a shit?  He just destroyed easily a hundred grand worth of equipment.  I should punch you in the face.", 
      "Aldous ROLLS the window down."
   ], 
   [
      "I’m really sorry, Phil.  My head is like wohhh.  Are we all good?", 
      "Immediately, Phil and Aaron are on their best yes man behavior."
   ], 
   [
      "We’re just figuring out the damage.  Bill.", 
      "Aldous rolls up the window.  Aaron pulls Phil behind the limo out of Aldous’s sight."
   ], 
   [
      "I’m superbummed you got caught up in this whole thing.", 
      "Phil PUNCHES Aaron in the face."
   ], 
   [
      "Because I can’t do it to him.", 
      "Phil PUNCHES Aaron again.  Aaron takes a swing at Phil.  Phil easily grabs Aaron’s hand and makes him punch himself in the head with it.  Aldous sticks his head out of the limo.  Phil and Aaron immediately act like they’re just talking."
   ], 
   [
      "I’m a little busy today, Aldous, but thanks for the invite.", 
      "Aldous goes back into the limo.  Aaron SUCKER punches Phil.  Phil punches Aaron back.  Aaron kicks Phil hard.  Phil starts punching Aaron."
   ], 
   [
      "You!  Will!  Pay!  For!  My!  Guitars!  Now!", 
      "Suddenly the LIMO DRIVER is right there.  He pulls Phil off of Aaron and throws him away like a piece of paper."
   ], 
   [
      "Suddenly the LIMO DRIVER is right there.  He pulls Phil off of Aaron and throws him away like a piece of paper.", 
      "INT. LIMO - DAY"
   ], 
   [
      "INT. LIMO - DAY", 
      "Aaron and Aldous are in the backseat.  Aaron is breathing hard and covered in sweat, but trying to cover.  Phil stands up.  Aldous rolls down the window."
   ], 
   [
      "The pleasure was all mine.", 
      "The limo takes off.  In the BG, we see Phil FLIPPING THEM OFF.  Aaron flips him off behind Aldous’s head so Aldous can’t see.  Before Aaron says anything Aldous cuts him off."
   ], 
   [
      "**", 
      "EXT. JFK - DAY"
   ], 
   [
      "EXT. JFK - DAY", 
      "A plane TAKES OFF."
   ], 
   [
      "A plane TAKES OFF.", 
      "INT. AMERICAN AIRLINES - DAY"
   ], 
   [
      "INT. AMERICAN AIRLINES - DAY", 
      "Aldous and Aaron are in flight.  Aldous grabs his phone and looks at the photos."
   ], 
   [
      "Last I head he’s a card shark in Vegas.", 
      "Beat.   Aaron considers and then jumps in."
   ], 
   [
      "I’ve been told that.  All I’m saying is it’s never too late to make amends.", 
      "This lands with Aldous."
   ], 
   [
      "This lands with Aldous.", 
      "INT. AMERICAN AIRLINES - LATER"
   ], 
   [
      "INT. AMERICAN AIRLINES - LATER", 
      "The plane’s in flight.  Aaron’s reading.  Aldous is watching Two and a Half Men and laughing way too hard."
   ], 
   [
      "Just wanted to let y’all know that in a couple minutes those on the right side of the aircraft will be able to see the beautiful lights of Las Vegas.", 
      "Aldous HITS his call buzzer.  A FLIGHT ATTENDANT heads over."
   ], 
   [
      "I’ll get you another set.", 
      "She leaves and returns a second later with another set."
   ], 
   [
      "How do you know?  You haven’t tried them yet.", 
      "Aldous RIPS THEM in half."
   ], 
   [
      "I can’t use yours!  I can’t use anyone’s!  CAUSE THERE’S A BOMB ON THIS PLANE!  I CAN FEEL IT IN M’ BONES!", 
      "EXT. LAS VEGAS CITYSCAPE - NIGHT"
   ], 
   [
      "EXT. LAS VEGAS CITYSCAPE - NIGHT", 
      "The plane, surrounded by fire trucks with their sirens a-blazing, performs an emergency landing in Vegas."
   ], 
   [
      "The plane, surrounded by fire trucks with their sirens a-blazing, performs an emergency landing in Vegas.", 
      "FULL SCREEN CHYRON: LAS VEGAS, NEVADA.  24 HOURS UNTIL THE GREEK."
   ], 
   [
      "FULL SCREEN CHYRON: LAS VEGAS, NEVADA.  24 HOURS UNTIL THE GREEK.", 
      "INT. LAS VEGAS LIMO - NIGHT"
   ], 
   [
      "INT. LAS VEGAS LIMO - NIGHT", 
      "Aaron and Aldous are in a limo.  Aaron’s pissed."
   ], 
   [
      "I was just making that all up.", 
      "EXT. BELLAGIO - NIGHT"
   ], 
   [
      "EXT. BELLAGIO - NIGHT", 
      "Aldous and Aaron are walking into the casino."
   ], 
   [
      "I don’t know, tell him the way you really feel.  Be honest and open.  And brief.   Incredibly brief.", 
      "INT. BELLAGIO - NIGHT"
   ], 
   [
      "INT. BELLAGIO - NIGHT", 
      "Aaron and Aldous walk into the casino and walk up to Aldous’s  *Father, JONATHAN SNOW, an older man dealing blackjack.  *"
   ], 
   [
      "Aaron and Aldous walk into the casino and walk up to Aldous’s  *Father, JONATHAN SNOW, an older man dealing blackjack.  *", 
      "The Blackjack Dealer looks up."
   ], 
   [
      "Ay!  Ay!  Everyone look ‘ere it’s my son, famous rocker Aldy Snow.", 
      "A crowd gathers."
   ], 
   [
      "A crowd gathers.", 
      "EXT. BELLAGIO - MOMENTS LATER"
   ], 
   [
      "EXT. BELLAGIO - MOMENTS LATER", 
      "Jonathan, Aldous and Aaron walk out of the casino."
   ], 
   [
      "Well, I’ve got just the thing.  This is going to blow your minds.", 
      "INT. MAGIC SHOW - NIGHT"
   ], 
   [
      "INT. MAGIC SHOW - NIGHT", 
      "Jonathan, Aldous and Aaron have front row seats at a magic show.  The three of them are drinking giant fruity drinks while they watch.  The Magician throws a handkerchief in the air and it turns into birds."
   ], 
   [
      "What did I tell you?", 
      "INT. MAGIC SHOW - BATHROOM"
   ], 
   [
      "INT. MAGIC SHOW - BATHROOM", 
      "Aaron is peeing.  Jonathan walks in and goes up to the urinal  *right next to Aaron."
   ], 
   [
      "Oh.  Cool.", 
      "Aaron flushes and heads out of the bathroom."
   ], 
   [
      "Aaron flushes and heads out of the bathroom.", 
      "INT. STRIP CLUB - NIGHT"
   ], 
   [
      "INT. STRIP CLUB - NIGHT", 
      "Aaron, Aldous and Jonathan are sitting in seats, drinking.  They all three do a shot.  A group of STRIPPERS come over to give them lapdances."
   ], 
   [
      "*", 
      "Aldous and his dad start laughing hard at Aaron.  Aaron gets a call.  It’s Sergio.  SPLIT SCREEN with Sergio in his convertible Bentley.  He’s stopped at a cross walk.  Some pedestrians walk by and accidentally brush against his car."
   ], 
   [
      "I’ll meet you there in twenty minutes.", 
      "Sergio hangs up."
   ], 
   [
      "Fuck.", 
      "Aaron dials."
   ], 
   [
      "*", 
      "His phone beeps.  It’s Daphne."
   ], 
   [
      "We’re actually in Vegas.  More press stuff.", 
      "ANGLE ON Jonathan AND ALDOUS."
   ], 
   [
      "It’s good to see you, boy.  It really is.", 
      "Jonathan rubs Aldous’s hair like he’s a little boy.  This is while they’re both getting lapdances."
   ], 
   [
      "Jonathan rubs Aldous’s hair like he’s a little boy.  This is while they’re both getting lapdances.", 
      "ANGLE BACK ON AARON:"
   ], 
   [
      "We went to a magic show and now we’re at like a nightclub.", 
      "A group of naked strippers walk by Aaron, really close."
   ], 
   [
      "Like a cool nightclub.  It’s called --", 
      "Aaron looks up to see the sign above the bar.  It’s called “The Wet Pussy Lounge.”"
   ], 
   [
      "Oh.  OK.", 
      "They both breathe.  Aaron’s phone beeps.  He looks at it.  Four Seasons.  Aaron silently flips over to the other side.  TRIPLE SCREEN between Aaron, Sergio in the lobby of the Four Seasons, and Daphne breathing."
   ], 
   [
      "Aw, how cute.  Wake the baby up and put him on the phone.  Right now.", 
      "Aaron flips back to Daphne who’s still breathing.  Aaron does some breathing as he heads over to Aldous and his dad.  He hits the phone on mute."
   ], 
   [
      "*", 
      "Aldous grabs the phone and hits the unmute button."
   ], 
   [
      "I’m getting lapdances in Vegas with my pop.  We’ll be in LA in the AM.  I love this kid by the way.  He’s fantastic.  Ciao.", 
      "Aldous hands the phone back to a stunned Aaron."
   ], 
   [
      "You made me drive to the Four Seasons for no fucking reason.  Don’t do that again.", 
      "Sergio hangs up.  Aaron flips back to Daphne."
   ], 
   [
      "I’m here.  I’m here.  Sorry.  Just a weird connection.  Battery’s on its way out.", 
      "Aaron looks at Aldous who winks at him.  Aaron looks over at the stripper’s pole where a REALLY DRUNK STRIPPER is doing a routine.  She climbs up the pole and then tries to slide down upside down.  Instead she falls off the pole and lands hard on her head.  Aaron takes this opportunity to leave."
   ], 
   [
      "Aaron looks at Aldous who winks at him.  Aaron looks over at the stripper’s pole where a REALLY DRUNK STRIPPER is doing a routine.  She climbs up the pole and then tries to slide down upside down.  Instead she falls off the pole and lands hard on her head.  Aaron takes this opportunity to leave.", 
      "EXT. STRIP CLUB"
   ], 
   [
      "EXT. STRIP CLUB", 
      "Aaron walks outside with the phone.  A second later a girl  comes out.  She’s petite, blonde and busty -- exactly Aaron’s ideal."
   ], 
   [
      "I love you!", 
      "Krissy makes eyes at Aaron."
   ], 
   [
      "And me you.", 
      "Aaron hangs up."
   ], 
   [
      "Sure thing.", 
      "Aaron hands Krissy his drink.  Aldous and Jonathan stumble out of the strip club with their strippers."
   ], 
   [
      "Of course not.", 
      "Krissy rolls her eyes at Aaron, not wanting to go."
   ], 
   [
      "Krissy rolls her eyes at Aaron, not wanting to go.", 
      "INT. BELLAGIO SUITE - LIVING ROOM - NIGHT"
   ], 
   [
      "INT. BELLAGIO SUITE - LIVING ROOM - NIGHT", 
      "The four of them are bent over doing coke."
   ], 
   [
      "Just a little won’t hurt a bittle.", 
      "Aaron snorts a tiny amount of coke."
   ], 
   [
      "Well that was super fun.", 
      "INT. BELLAGIO SUITE - MASTER BEDROOM - NIGHT"
   ], 
   [
      "INT. BELLAGIO SUITE - MASTER BEDROOM - NIGHT", 
      "Jonathan & Millenium and Aldous & Jet have sex in a giant Oriental King.  Aldous pulls out his cell and takes a photo of him and Katherine in the midst of sex.  PAN OVER to Aaron and Krissy just sitting on the balcony, trying not to watch."
   ], 
   [
      "Jonathan & Millenium and Aldous & Jet have sex in a giant Oriental King.  Aldous pulls out his cell and takes a photo of him and Katherine in the midst of sex.  PAN OVER to Aaron and Krissy just sitting on the balcony, trying not to watch.", 
      "INT. BELLAGIO SUITE - BALCONY - NIGHT"
   ], 
   [
      "INT. BELLAGIO SUITE - BALCONY - NIGHT", 
      "They are both pretty drunk and coked up."
   ], 
   [
      "I’m a student.  Studying to be a doctor.", 
      "Krissy puts her hand on his.  Aaron stares at it."
   ], 
   [
      "I’ll be right back.", 
      "Aaron goes inside into the bathroom."
   ], 
   [
      "Aaron goes inside into the bathroom.", 
      "Aaron closes the door and looks in the mirror.  Aldous walks in, holding a large terrifying looking joint."
   ], 
   [
      "I call it the Jeffrey.  It’s a bit o this, a bit o that.", 
      "Aaron takes it and starts puffing on it."
   ], 
   [
      "Then go out there and fuck that girl.  It’s the morally correct thing to do.", 
      "Aldous starts to pee in the toilet."
   ], 
   [
      "Man I had to pee the entire time we were having sex.  Isn’t that the worst?  As I came I was literally thinking about Victoria Falls.", 
      "Aaron walks out of the bathroom back to the balcony.  Aldous carefully inspects his hair in the mirror.  He sees one gray hair.  He carefully PLUCKS it out."
   ], 
   [
      "Aaron walks out of the bathroom back to the balcony.  Aldous carefully inspects his hair in the mirror.  He sees one gray hair.  He carefully PLUCKS it out.", 
      "EXT. BELLAGIO SUITE - BALCONY - NIGHT"
   ], 
   [
      "EXT. BELLAGIO SUITE - BALCONY - NIGHT", 
      "Aaron rejoins Krissy on the balcony and hands her the joint.  Krissy takes it and puffs it."
   ], 
   [
      "You’re cute.", 
      "Krissy grabs Aaron and kisses him hard."
   ], 
   [
      "Krissy grabs Aaron and kisses him hard.", 
      "INT. BELLAGIO SUITE - GUEST ROOM - NIGHT"
   ], 
   [
      "INT. BELLAGIO SUITE - GUEST ROOM - NIGHT", 
      "They fall into a bed.   Krissy’s “nice” shtick suddenly drop and she becomes a voraciously sexual."
   ], 
   [
      "*", 
      "Krissy tears off Aaron’s pants."
   ], 
   [
      "*", 
      "Krissy removes her shirt and puts Aaron’s hands on her boobs."
   ], 
   [
      "Silicone can get into your bloodstream and fuck your shit up.", 
      "She goes down on Aaron.  We can’t tell what she’s doing."
   ], 
   [
      "What is that?  What are you doing?  I’m not sure but I think I love what is currently happening to me.  Why can’t I stop narrating what is happening to me while it’s happening --", 
      "Aaron BUSTS into the room."
   ], 
   [
      "That is the most amazing expression ever.", 
      "Aldous takes out his camera phone and takes a photo of Aaron.  Aaron spazzily takes a drag off the joint."
   ], 
   [
      "You made me this way!  You made me incapable of connecting with people except by having sex with them!", 
      "Aldous PUNCHES his dad.  Aldous and his Dad get into a vicious fist fight."
   ], 
   [
      "Woh!  Woh!  Stop it!  That man is sick.", 
      "Aaron gets in the middle.  Jonathan PUNCHES Aaron in the head.  Aaron crazily starts scratching Jonathan’s face up."
   ], 
   [
      "Catwoman!  It’s Catwoman!", 
      "Aldous pulls Aaron off of Jonathan."
   ], 
   [
      "What the bloody fuck?  You’re like Catwoman!", 
      "Aldous starts laughing.  Jonathan starts laughing."
   ], 
   [
      "Just calm down, alright?  Now look at me.  Think about the beauty in this world.  Like check out this ant.", 
      "Aldous picks up an ant crawling on the table."
   ], 
   [
      "Aldous picks up an ant crawling on the table.", 
      "Aaron looks at it and starts to calm down.  Aldous SNORTS IT."
   ], 
   [
      "My heart’s definitely stopped.", 
      "Aaron takes off around the room and then passes out.  He wakes up briefly to see Jonathan peeing on the floor."
   ], 
   [
      "Aaron takes off around the room and then passes out.  He wakes up briefly to see Jonathan peeing on the floor.", 
      "INT. BELLAGIO SUITE - BALCONY - DAWN"
   ], 
   [
      "INT. BELLAGIO SUITE - BALCONY - DAWN", 
      "Aaron is asleep.  He gets a rude kick in the side."
   ], 
   [
      "Aaron is asleep.  He gets a rude kick in the side.", 
      "Aaron shakily stands.  They walk into the suite to see Aldous’s dad passed out on the floor without pants.  Or underpants."
   ], 
   [
      "Should we wake him up so you can say goodbye?", 
      "INT. SUV LIMO - MORNING"
   ], 
   [
      "INT. SUV LIMO - MORNING", 
      "Aaron and Aldous are in the backseat of the car in early morning silence.  After a long beat..."
   ], 
   [
      "I’m in love with Jackie Q.  I know it now.  She’s so gorgeous and sexy and has these perfect tits.  Really, something.  Like an angel’s tits.  And she always kept me guessing.  I was with her at this party in Monaco and she leans over and whispers to me “I’m wet.”  She just said that to me, you know, like she was telling me the weather, with McCartney and Judi Dench and the Dalai Lama just standing like two feet away.  I swear I fell in love right then, right there.  Then later that week, we’re at a nightclub in Goa and she went and made out with Emma Bunton right in front of me.  Under different circumstances I would have been happy to be seeing this, this would have been my idea of nirvana.  But not this time.  This time I was mad.  And as I watched them make out and strip and begin the process of engaging in oral sex I got angrier and angrier till I realized this was love, I was in love.", 
      "Beat."
   ], 
   [
      "You’re right, if I’m honest I’ll get her.  And once I’ve gotten her I can finally put an end to this interminable, miserable single life.  Presently I can go wherever I want with whoever I want and do whatever I want to whomever I want.  It’s not as good as eating dinner at 6:30 with the same person and having nothing new to talk about ever.  It’s like when I was on Branson’s private island in an ecstasy orgy with these two Indian models I was like “I wish I was locked in a small apartment in Los Angeles with the same person forever.”", 
      "Aaron’s unsure whether to be offended or laugh it off."
   ], 
   [
      "Oh, you.", 
      "Aaron playfully pushes Aldous.  Aldous playfully pushes Aaron back.  Aaron playfully pushes Aldous back.  IN ONE LIGHTNING QUICK MOVE, Aldous unlatches the car door on Aaron’s side and PUSHES AARON OUT THE DOOR.  We see in one shot, no cuts, as Aaron flies out the door and tumbles behind the car onto the highway.  Cars swerve around his body.  In the receding background we see Aaron JUMP UP and dive away from two cars that SMASH into each other."
   ], 
   [
      "Aaron playfully pushes Aldous.  Aldous playfully pushes Aaron back.  Aaron playfully pushes Aldous back.  IN ONE LIGHTNING QUICK MOVE, Aldous unlatches the car door on Aaron’s side and PUSHES AARON OUT THE DOOR.  We see in one shot, no cuts, as Aaron flies out the door and tumbles behind the car onto the highway.  Cars swerve around his body.  In the receding background we see Aaron JUMP UP and dive away from two cars that SMASH into each other.", 
      "A DRIVER of one of the cars HOPS OUT and PUNCHES Aaron in the  **face.  Aldous casually hits the divider button in the limo."
   ], 
   [
      "It seems my compatriot has fallen out of the vehicle.", 
      "The Limo Driver looks in the rear window and SCREECHES to the side of the highway."
   ], 
   [
      "The Limo Driver looks in the rear window and SCREECHES to the side of the highway.", 
      "Aaron stands about a hundred yards from the limo."
   ], 
   [
      "Aaron stands about a hundred yards from the limo.", 
      "INT. SUV LIMO"
   ], 
   [
      "INT. SUV LIMO", 
      "Aaron sits as far from Aldous as possible, completely and totally terrified."
   ], 
   [
      "I’m fine.  I’m just going to get some shut eye.", 
      "Aaron closes his eyes.  He leaves them a little open so he can keep an eye on Aldous."
   ], 
   [
      "Aaron closes his eyes.  He leaves them a little open so he can keep an eye on Aldous.", 
      "EXT. FOUR SEASONS LOS ANGELES - DAY"
   ], 
   [
      "EXT. FOUR SEASONS LOS ANGELES - DAY", 
      "Aldous and Aaron pull up in front of the Four Seasons."
   ], 
   [
      "Aldous and Aaron pull up in front of the Four Seasons.", 
      "CHYRON: LOS ANGELES, CALIFORNIA.  TWELVE HOURS UNTIL THE GREEK."
   ], 
   [
      "You have my contact information.  If you need me you know how to reach me.", 
      "Aldous gets out of the car.  The car takes off.  Aaron picks up his cell and dials."
   ], 
   [
      "Aldous gets out of the car.  The car takes off.  Aaron picks up his cell and dials.", 
      "INT. SERGIO’S OFFICE"
   ], 
   [
      "INT. SERGIO’S OFFICE", 
      "Sergio is doing pilates like a master.  He answers the phone."
   ], 
   [
      "Aaron Greenberg.  Aldous Snow has been delivered to his hotel.", 
      "EXT. JACKIE Q’S BEL AIR MANSION - DAY"
   ], 
   [
      "EXT. JACKIE Q’S BEL AIR MANSION - DAY", 
      "Aldous, in a limo, pulls up outside the mansion."
   ], 
   [
      "Thanks, mate.", 
      "Aldous gets out of the car and heads towards the front of the house.  He knocks on the door.  Jackie Q answers."
   ], 
   [
      "Alright.", 
      "INT. JACKIE Q’S BEDROOM - DAY"
   ], 
   [
      "INT. JACKIE Q’S BEDROOM - DAY", 
      "Aldous and Jackie have finished having sex."
   ], 
   [
      "As are you my dear, as are you.", 
      "NAPLES, a six year old of indeterminate gender, comes in."
   ], 
   [
      "Mommy, nook!   Nook!", 
      "Naples holds up a very sharp kitchen knife."
   ], 
   [
      "Nook!", 
      "Naples makes a stabbing gesture with the knife."
   ], 
   [
      "What a beautiful child.", 
      "Naples’ Jamaican Nanny, SUZETTE, pops her head in."
   ], 
   [
      "Leave him.  He’s perfection.  Aren’t you?  Aren’t you?", 
      "Aldous picks up Naples and holds him upside down.  Aldous is oddly good with Naples."
   ], 
   [
      "No.  Cause I’m the monster!", 
      "Aldous stalks after Naples like a monster."
   ], 
   [
      "And I love both of you!", 
      "Aldous sees Naples Fisher-Price piano and “karoake” machine.   **It’s not a real piano or karoake machine; but rather a *brightly-colored piece of plastic that acts as one.  Aldous hits the keys.  It automatically start playing “Heads, **Shoulders, Knees and Toes.”"
   ], 
   [
      "Aldous sees Naples Fisher-Price piano and “karoake” machine.   **It’s not a real piano or karoake machine; but rather a *brightly-colored piece of plastic that acts as one.  Aldous hits the keys.  It automatically start playing “Heads, **Shoulders, Knees and Toes.”", 
      "Aldous and Jackie perform an amazing version of “Head, Shoulders, Knees and Toes” as Naples claps."
   ], 
   [
      "Aldous and Jackie perform an amazing version of “Head, Shoulders, Knees and Toes” as Naples claps.", 
      "EXT. JACKIE Q’S BEL AIR MANSION - POOL"
   ], 
   [
      "EXT. JACKIE Q’S BEL AIR MANSION - POOL", 
      "Naples runs to the pool."
   ], 
   [
      "Well I don’t want to be a rotten egg!", 
      "Naples jumps into the pool.  Aldous strips and jumps in after him.  Jackie watches from the side and laughs."
   ], 
   [
      "I’m not a rotten egg.  I’m the monster!", 
      "Aldous takes Naples and throws him farther into the pool.  Naples is giggling.  Jackie is giggling.  Aldous looks around.  Life is perfect."
   ], 
   [
      "My emotions can’t be controlled.  You know that.", 
      "Suzette scoops Naples out of the pool.  Naples howls."
   ], 
   [
      "I don’t care if he’s not my son!  I still love him! I LOVE YOU, KID!", 
      "EXT. LOS ANGELES SKYLINE - DAY"
   ], 
   [
      "EXT. LOS ANGELES SKYLINE - DAY", 
      "Aldous walks down Mulholland, crying hysterically."
   ], 
   [
      "Aldous walks down Mulholland, crying hysterically.", 
      "CHYRON: FOUR HOURS UNTIL THE GREEK."
   ], 
   [
      "I have no one!  NO ONE!!!", 
      "He looks out over Los Angeles.  He collapses.  He looks down at his phone.  He scrolls through the photos on his phone.  It’s just naked trampy girl after naked trampy girl .  He gets to the photo of Aaron from the night in Vegas when he was freaking out."
   ], 
   [
      "He looks out over Los Angeles.  He collapses.  He looks down at his phone.  He scrolls through the photos on his phone.  It’s just naked trampy girl after naked trampy girl .  He gets to the photo of Aaron from the night in Vegas when he was freaking out.", 
      "Aaron and Daphne are eating dinner.  Aaron is holding Daphne’s hand."
   ], 
   [
      "I didn’t even notice.", 
      "The doorbell rings.  Aaron goes to the door and opens it, revealing Aldous."
   ], 
   [
      "If you need me I can totally go to wherever you are.", 
      "Daphne shows up behind Aaron."
   ], 
   [
      "Are you Daphne?  You are even more lovely in person.", 
      "Daphne holds out her hand.  Aldous kisses it."
   ], 
   [
      "Daphne holds out her hand.  Aldous kisses it.", 
      "INT. AARON AND DAPHNE’S APARTMENT - MOMENTS LATER"
   ], 
   [
      "INT. AARON AND DAPHNE’S APARTMENT - MOMENTS LATER", 
      "Aaron, Daphne and Aldous are sitting in the living room.  They’re drinking wine.  Aldous stares at the sculpture from the beginning that Aaron described as “pretty.”"
   ], 
   [
      "*", 
      "Aaron downs his glass of wine."
   ], 
   [
      "**", 
      "Aaron’s about to cover but Daphne giggles in an oddly flirtatious way."
   ], 
   [
      "Aaron’s about to cover but Daphne giggles in an oddly flirtatious way.", 
      "QUICK CUTS OF THEM DRINKING AND LAUGHING TOGETHER while Aaron  *looks more and more uncomfortable.*"
   ], 
   [
      "QUICK CUTS OF THEM DRINKING AND LAUGHING TOGETHER while Aaron  *looks more and more uncomfortable.*", 
      "Aldous plays and sings John Mayer’s “Daughters” on a guitar while Daphne and Aaron watch, holding hands."
   ], 
   [
      "I got this mate who I had a threesome with and he didn’t like it and then he never had one again.", 
      "Daphne looks at Aaron like “see?”"
   ], 
   [
      "Perfect!  Let me get my whip.", 
      "Aldous starts very casually taking his clothes off."
   ], 
   [
      "Well, what’re you waiting for?", 
      "Daphne and Aaron start taking their clothes off too.  It’s very awkward and proforma."
   ], 
   [
      "Daphne and Aaron start taking their clothes off too.  It’s very awkward and proforma.", 
      "INT. AARON AND DAPHNE’S BEDROOM - LATER"
   ], 
   [
      "INT. AARON AND DAPHNE’S BEDROOM - LATER", 
      "Aldous, Aaron and Daphne are awkwardly sitting on the bed."
   ], 
   [
      "So... how do we start this?  Because if we can’t, we don’t need to --", 
      "Aldous starts making out with Daphne."
   ], 
   [
      "Aldous starts making out with Daphne.", 
      "PAN FROM Aldous having crazy amazing sex with Daphne to Aaron sitting on the bed looking not really all that happy."
   ], 
   [
      "I’d love some.", 
      "Aaron gets off the bed and goes into the kitchen."
   ], 
   [
      "Aaron gets off the bed and goes into the kitchen.", 
      "INT. KITCHEN - CONTINUOUS"
   ], 
   [
      "INT. KITCHEN - CONTINUOUS", 
      "Aaron fills up a glass with water.  Then a second glass with water.  He then looks at himself holding two glasses of water.  He is literally serving water to his girlfriend and the man who is fucking her."
   ], 
   [
      "I am ejaculating!  Ahhhhhh!", 
      "Aaron rushes back into the bathroom.  Aldous is somehow having sex with Daphne’s face.  Or at least that’s what we have to assume.  All the drive drops out of Aaron."
   ], 
   [
      "C’mon, baby, get involved.", 
      "Aaron awkwardly tries to get into the action."
   ], 
   [
      "Oh boy!  Oh boy!  Oh boy!  I am going to ejaculate again!", 
      "Aldous pulls out and ejaculates.  We don’t see it.  We just see Aaron’s face change."
   ], 
   [
      "You got it on me, man!", 
      "Aaron is frozen in terror/disgust."
   ], 
   [
      "This isn’t about rules or not rules!  This is about you fucking her right in front of me!  And why are you in this conversation?  Why are you even here?", 
      "Aldous leaves the room."
   ], 
   [
      "GET OUT!", 
      "Aldous leaves again."
   ], 
   [
      "I don’t know.", 
      "Daphne and Aaron both start to tear up."
   ], 
   [
      "I want to hug you too.  It’s OK.", 
      "Daphne and Aaron hug."
   ], 
   [
      "Why am I letting you do this?  Get away from me, you... you... whore.", 
      "Neither Aaron nor Daphne can believe he just called her a whore."
   ], 
   [
      "I’m gonna go.", 
      "Daphne goes.  He notices that Aldous’s black manpurse is still in the apartment.  He picks it up and it spills opens, revealing a box of needles.  Aldous walks in."
   ], 
   [
      "You’re jealous of my piddly life so you destroy it.", 
      "Aaron takes a needle out of the box and TOSSES IT at Aldous."
   ], 
   [
      "Congrats.  Destruction complete.", 
      "Aaron throws a second needle like a dart and NAILS Aldous in the arm."
   ], 
   [
      "Ow!", 
      "Aaron throws a third and fourth and fifth.  They land in Aldous’s leg, chest and right below his eye."
   ], 
   [
      "What the hell, man?", 
      "Aldous pulls the needle out of his face and tosses it back, sticking Aaron in the arm."
   ], 
   [
      "Yeah, but that one was in you.  Now I’ve got whatever blood diseases you’ve got.", 
      "Aldous takes another and throws it at Aaron.  Suddenly they are in a FULL SCALE NEEDLE FIGHT, tossing needles back and forth with frighteningly fast abandon."
   ], 
   [
      "Draw!  Draw!", 
      "They stop.  Aldous throws another needle at Aaron.  The needle fight starts again.   While throwing needles, they say the following things --"
   ], 
   [
      "Get out!", 
      "Aldous leaves.  Aaron collapses on the couch."
   ], 
   [
      "Aldous leaves.  Aaron collapses on the couch.", 
      "INT. AARON AND DAPHNE’S APARTMENT - EVENING"
   ], 
   [
      "INT. AARON AND DAPHNE’S APARTMENT - EVENING", 
      "Aaron watches television, depressed.  The phone rings."
   ], 
   [
      "Hey, Aaron, it’s Daphne.  We should probably talk about what just happened.  I’m at my parent’s house.  Please call.  I love you.  Like a lot.  I’m sorry.", 
      "She starts to cry and hangs up.  The phone rings again.  He lets it go to answering machine."
   ], 
   [
      "Where the fuck are you guys?  He was supposed to be here --", 
      "Aaron pulls the phone cord from the wall and throws it against the wall.  A piece of the phone hits Aaron in the head.  Aaron goes into the bathroom.  On the mirror there’s a note.  He opens the envelope.  The note reads:"
   ], 
   [
      "Dear Aaron.  This is my last will and testament.  Since I have no kids or wife or really anything I’m leaving my estate to you.  If you want to see me off, I’ll be jumping from the Hollywood sign at nine, depending on traffic.  I want my body to be cryogenically frozen, to be unfrozen when there’s a chemical cure for addiction or heroin becomes legal, whichever comes first.  Yours, Aldous.  P.S.  I’m sorry for making love to your girlfriend.  That was done out of self-anger.  P.P.S.  I do not know if this last will and testament will hold up in a court of law.  I apologize if it doesn’t.  In fact, the more I think about it the more unlikely it seems that it will.  Sorry, mate.", 
      "Aaron takes a beat."
   ], 
   [
      "Fuck him.", 
      "Aaron throws out the note.  He looks at a clock on the wall.  It’s 7:00PM."
   ], 
   [
      "No, fuck him.", 
      "Aaron takes a shower.  The radio’s on."
   ], 
   [
      "Fuck him.", 
      "INT. DENNY’S - NIGHT"
   ], 
   [
      "INT. DENNY’S - NIGHT", 
      "Aaron’s at Denny’s.  He orders a coffee.  He looks at his watch.  It’s 8:30PM."
   ], 
   [
      "Fuck him.", 
      "The waitress comes over."
   ], 
   [
      "If you like corn.", 
      "MOMENTS LATER Aaron waits for his food.  He checks his watch.  It’s now 8:35."
   ], 
   [
      "Fuck him.", 
      "The Waitress returns with the corn pancakes, eggs and bacon."
   ], 
   [
      "*", 
      "Aaron looks at his watch.  It’s now 8:36."
   ], 
   [
      "Fuck him.", 
      "MOMENTS LATER: Aaron’s reading LA Weekly.  He looks at his watch.  It’s now 8:37."
   ], 
   [
      "Fuck him.", 
      "His cell rings.  Aaron jumps.  He looks and sees that it says “Daphne.”  He hits it to voicemail.  He reads the paper and sees an ad for Aldous Snow at the Greek.  He looks at his watch again.  It’s still 8:37."
   ], 
   [
      "Fuck him.", 
      "A BUS BOY clearing a nearby table looks at Aaron.  Aaron looks at his watch again.  He stares as it changes from 8:37 to 8:38."
   ], 
   [
      "A BUS BOY clearing a nearby table looks at Aaron.  Aaron looks at his watch again.  He stares as it changes from 8:37 to 8:38.", 
      "INT. AARON’S CAR"
   ], 
   [
      "INT. AARON’S CAR", 
      "Aaron is driving really fast."
   ], 
   [
      "Fuck him fuck him fuck him fuck him fuck him fuck him --", 
      "His cell rings.  It’s Sergio.  He hits it to voicemail."
   ], 
   [
      "His cell rings.  It’s Sergio.  He hits it to voicemail.", 
      "MOMENT WHERE Aaron is pulled to the side of the road, very laboriously putting in “Hollywood Sign” in his point of interest in his GPS device."
   ], 
   [
      "Fuck him fuck him fuck him... Hollywood Tire... Hollywood Dog Track... Hollywood Sheepskin... what the fuck?  Why doesn’t it just have the Hollywood sign?", 
      "Aaron pulls up alongside a TOUR BUS."
   ], 
   [
      "**", 
      "The people on the tour bus laugh."
   ], 
   [
      "I said where’s the fucking Hollywood sign?  I will ram my car into your bus if you don’t tell me right the fuck now!", 
      "EXT. TOP OF THE HOLLYWOOD SIGN - NIGHT"
   ], 
   [
      "EXT. TOP OF THE HOLLYWOOD SIGN - NIGHT", 
      "Aaron pulls up in his car.  The clock on his car reads 8:57PM."
   ], 
   [
      "Fuck him fuck him fuck him fuck him fuck him fuck him!", 
      "Aaron jumps out of his car."
   ], 
   [
      "Fuck him fuck him fuck him fuck him fuck him fuck him fuck him --", 
      "Aaron scrambles down the desert hill.  He reaches a barbed wire fence and tries to climb over it, getting caught in the barbed wire.  He jumps down from the fence."
   ], 
   [
      "Fuck him fuck him fuck him fuck him --", 
      "Aaron’s phone rings.  It’s Sergio.  He hits send to voicemail.  Aaron sees an opening in the fence.  Someone has clearly cut an opening out.  He crawls through the hole."
   ], 
   [
      "Aaron’s phone rings.  It’s Sergio.  He hits send to voicemail.  Aaron sees an opening in the fence.  Someone has clearly cut an opening out.  He crawls through the hole.", 
      "Aaron is now down at the Hollywood sign.  He sees Aldous standing on top of the “H.”"
   ], 
   [
      "Hey asshole, don’t jump!", 
      "Aaron crawls down to the sign."
   ], 
   [
      "Tell me that you love me and me specifically, not just the general concept of humanity.", 
      "Beat.  Aldous moves to the edge of the “H.”"
   ], 
   [
      "I love you too, Aaron Greenberg.  I love you too.", 
      "Aldous, taking an intentional Christ like pose, JUMPS off the “H” and hits the dusty desert below with a resounding and sickening thud.  He rolls down the hill."
   ], 
   [
      "Fuck you!", 
      "Aaron SCRAMBLES down the hill after Aldous."
   ], 
   [
      "Aaron SCRAMBLES down the hill after Aldous.", 
      "Aldous rolls down the hill, crashing through a fence and --"
   ], 
   [
      "Aldous rolls down the hill, crashing through a fence and --", 
      "-- into a Hills house backyard, splashing right into a hot tub.  Aaron jumps down and sees Aldous floating in the hot tub."
   ], 
   [
      "Fuck you, man!  Fuck you!", 
      "Aaron jumps into the hot tub and flips Aldous over."
   ], 
   [
      "Aldous?  Aldy?  Aldous?  Mr. Snow?", 
      "He pokes the body.  No movement.  He starts performing CPR on Aldous, gingerly breathing into Aldous’s mouth and pumping his chest.  Soon his CPR gets more and more vigorous."
   ], 
   [
      "Fuck!  You!  Fuck!  You!  You!  Are!  A!  Dick!  I!  Hope!  This!  Doesn’t!  Work!  Why!  Do!  I!  Have!  Mor!  Als!", 
      "Aldous comes to and sucks in a breath.  As Aldous and Aaron talk, the hot tub slowly turns red with Aldous’s blood."
   ], 
   [
      "I’m always at least four hours late.  My fans all know this.  Once, in Manchester, I went on at 2:10AM.  Performed for six hours.  We can still make it.", 
      "Aaron looks at Aldous’s arm.  The bone’s sticking through.  Aaron THROWS UP on Aldous."
   ], 
   [
      "Aaron looks at Aldous’s arm.  The bone’s sticking through.  Aaron THROWS UP on Aldous.", 
      "INT. AARON’S CAR"
   ], 
   [
      "INT. AARON’S CAR", 
      "Aaron’s frantically driving Aldous."
   ], 
   [
      "It’s just pain.  Pain is fleeting.  Love is forever.  You have given me love so in turn I shall give you sobriety.  From now on nothing’s more important to me than my sobriety.", 
      "Aldous opens up his manpurse and downs a bunch of pain pills."
   ], 
   [
      "Please stop referencing your bone.", 
      "Aldous touches his bone."
   ], 
   [
      "It’s so weird.  You can’t feel your bone if you touch it.  It’s like touching a drumstick or something.", 
      "Aaron gags."
   ], 
   [
      "Aaron gags.", 
      "EXT. GREEK THEATER - ENTRANCE"
   ], 
   [
      "EXT. GREEK THEATER - ENTRANCE", 
      "Aaron and Aldous pull up the driveway to the Greek past a giant sign that says “Aldous Snow -- LIVE FOR THE FIRST TIME IN THREE YEARS!”  We hear booing from the auditorium."
   ], 
   [
      "Aaron and Aldous pull up the driveway to the Greek past a giant sign that says “Aldous Snow -- LIVE FOR THE FIRST TIME IN THREE YEARS!”  We hear booing from the auditorium.", 
      "EXT. GREEK THEATER - BACKSTAGE"
   ], 
   [
      "EXT. GREEK THEATER - BACKSTAGE", 
      "Aaron and a limping Aldous head backstage.  The crowd is booing and partying.  Sergio heads towards them."
   ], 
   [
      "*", 
      "Aldous is already on stage."
   ], 
   [
      "Allo, Los Angeles!  Are you ready to rock out?", 
      "The crowd cheers."
   ], 
   [
      "***", 
      "Sergio stares him down."
   ], 
   [
      "I will happily take it.", 
      "ANGLE ON THE STAGE:"
   ], 
   [
      "This song is dedicated to my good buddy Aaron Greenberg -- get on out here.", 
      "Aaron doesn’t want to."
   ], 
   [
      "Get on out here, Aaron Greenberg!  Get on out here, Aaron Greenberg!", 
      "The crowd starts chanting this as well."
   ], 
   [
      "GET ON OUT HERE, AARON GREENBERG!  GET ON OUT HERE, AARON GREENBERG!", 
      "Sergio nods to Aaron.  Aaron walks out onto stage.  The crowd  *cheers.  Aaron smiles."
   ], 
   [
      "This man, while he didn’t save me from jumping off the Hollywood sign, at least showed up.  Even after I made love to his girlfriend.  Now that’s true friendship.", 
      "The crowd doesn’t know how to respond to this."
   ], 
   [
      "I also wish to make an announcement.  I’m quitting drugs and the alcohol.", 
      "The audience starts booing."
   ], 
   [
      "If anyone ever sees me drinking a beer or smoking a joint or doing any other kind of controlled substance you have my legal permission to beat the living shit out of me.", 
      "The crowd cheers like crazy."
   ], 
   [
      "And a one!  A two!  A one two three!", 
      "Aldous tries to strum the guitar and HOWLS IN PAIN."
   ], 
   [
      "That fucking hurts!  Holy shit that hurts!  Ahhh!", 
      "Aldous unwraps his bandage to reveal his bone."
   ], 
   [
      "Check out my bone!  Check it out!  Ahhh!  The pain!!!!!", 
      "The band stops playing."
   ], 
   [
      "What’re you doing!?  Keep playing!", 
      "They start playing again.  Aldous begins singing and howling in pain all at once."
   ], 
   [
      "Love explosion!  It’s a love explosion!  My love explodes into your heart!  It explodes all over your chest!", 
      "It’s awesome.  The crowd goes crazy.  Aldous begins jumping up and down and then PASSES OUT on the stage.  In a moment of odd enthusiasm, Aaron grabs the microphone and motions for the band to start playing.  Aaron continues the song."
   ], 
   [
      "My love explodes all over the Earth!  My loves explodes across the universe!", 
      "The crowd BOOS."
   ], 
   [
      "Well fuck you all too!", 
      "Aaron starts proudly parading around the stage flipping them off as medics rush onstage to take care of Aldous.  Aaron rushes over to Aldous.  Aldous’s eyes flutter open."
   ], 
   [
      "Get your lady back, man.  You’re too much of a pussy to live in this world without her.", 
      "EXT. DAPHNE’S PARENTS HOUSE - NIGHT"
   ], 
   [
      "EXT. DAPHNE’S PARENTS HOUSE - NIGHT", 
      "Aaron pulls up to Daphne’s parents’ house.  It’s a nice house on the ocean in Laguna.  He runs up to the door.  Not wanting to wake anyone up, he knocks lightly on the door.  Then he finally hits the doorbell.  A very long door chime version of “Lollipop” plays.  Mr. Binks opens the door."
   ], 
   [
      "Respectfully, sir, I don’t care what you think.", 
      "Aaron PUSHES past Mr. Binks and into the house."
   ], 
   [
      "Aaron PUSHES past Mr. Binks and into the house.", 
      "INT. DAPHNE’S PARENTS HOUSE - CONTINUOUS"
   ], 
   [
      "INT. DAPHNE’S PARENTS HOUSE - CONTINUOUS", 
      "Aaron heads into the Great Room."
   ], 
   [
      "Daphne!  Daphne!", 
      "Daphne and her mom come to the head of the stairs.  Aaron and Daphne have this entire conversation in front of her parents."
   ], 
   [
      "And one other thing, I do understand what it takes to be a creative type.  And when you say I don't it's condescending and bitchy and I don’t like it at all and rather than whining about whether your sculptures will or won’t sell or whether people will or won’t like them you should just get a fucking gallery and show them already.", 
      "As the sun rises through the windows of their Great Room, Daphne tears down the stairs --"
   ], 
   [
      "I love you when you’re honest.", 
      "-- and kisses him."
   ], 
   [
      "I’m so sorry, baby.", 
      "Aaron hugs Daphne."
   ], 
   [
      "Three weeks is a long time from now.  It’ll give me time to prepare mentally.", 
      "INT. AARON AND DAPHNE’S BEDROOM - NIGHT"
   ], 
   [
      "INT. AARON AND DAPHNE’S BEDROOM - NIGHT", 
      "A nervous looking Aaron looks at something."
   ], 
   [
      "You sure you’re OK with this?", 
      "REVEAL Daphne is tied up."
   ], 
   [
      "Now let’s get going already!", 
      "Aaron PULLS OUT his Dustbuster."
   ], 
   [
      "Aaron PULLS OUT his Dustbuster.", 
      "We hear the drone of the vacuum cleaner and Daphne’s SHRIEKS of delight."
   ], 
   [
      "We hear the drone of the vacuum cleaner and Daphne’s SHRIEKS of delight.", 
      "EXT. YOSEMITE - DAY"
   ], 
   [
      "EXT. YOSEMITE - DAY", 
      "Aaron, Aldous, and Naples are hiking. As they hike, Aldous is sucking down a sucrose gel pack."
   ], 
   [
      "He’s just my mate.  His dad’s actually Hugh Grant.  Who knew?  He’s staying with me for the month.  His mother’s kind of a W-H-O-R-E.", 
      "He sucks down another gel pack."
   ], 
   [
      "The point is I’m finally living the clean life we’re all meant to live and it’s all because of you.  Thank you, Aaron, for pulling me back from the edge and showing me the way towards a healthy, safe existence.", 
      "PULL BACK TO REVEAL they’re at the edge of a cliff."
   ], 
   [
      "Meet you both at the bottom!", 
      "Aldous straps on a backpack and BASE JUMPS OFF THE CLIFF.  Aaron and Naples watch him drift down."
   ], 
   [
      "Kind of.", 
      "We see the youtube clip from the beginning.  Aldous is punching himself in the face.  It’s horrific.  Then he reaches into his mouth and pulls out tooth after tooth, whipping each one at the audience."
   ]
]
 }