{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "Don’t talk to it, Merry. Don’t  encourage it!", 
      "TREEBEARD, some call me."
   ], 
   [
      "And whose side are you on?", 
      "Side? I am on nobody’s side because nobody’s on my side, little Orc. Nobody cares for the woods anymore."
   ], 
   [
      "Hobbits? Never heard of a Hobbit before. Sounds like Orc mischief to me!", 
      "They come with fire. They come with axes. Gnawing, biting, breaking, hacking, burning! Destroyers and usurpers! Curse them!"
   ], 
   [
      "They come with fire. They come with axes. Gnawing, biting, breaking, hacking, burning! Destroyers and usurpers! Curse them!", 
      "No! You don’t understand. We’re Hobbits! Halflings! Shire-folk!"
   ], 
   [
      "No! You don’t understand. We’re Hobbits! Halflings! Shire-folk!", 
      "Maybe you are and maybe you aren’t. The White Wizard will know."
   ], 
   [
      "CUT TO:", 
      "O Rowan mine I saw you shine Upon a summer’s day Upon your head How golden-red The crown you bore aloft"
   ], 
   [
      "O Rowan mine I saw you shine Upon a summer’s day Upon your head How golden-red The crown you bore aloft", 
      "Is it much further?"
   ], 
   [
      "Bru-ra-hroom. Don’t be hasty. You might call it far, perhaps. My home lies deep in the forest near the roots of the mountain. I told Gandalf I would keep you safe. And safe is where I’ll keep you. I believe you will enjoy this next one too. It’s one of my own compositions. Right.", 
      "Beneath the roof of sleeping leaves And the dreams of trees unfold When woodland halls are green and cool And the wind is in the West Come back to me Come back to me And say my land is best"
   ], 
   [
      "Beneath the roof of sleeping leaves And the dreams of trees unfold When woodland halls are green and cool And the wind is in the West Come back to me Come back to me And say my land is best", 
      "Sleep, little Shirelings. Heed no  nightly noise. Sleep till morning light."
   ], 
   [
      "Help!", 
      "Away with you. You should not be  waking. Eat earth. Dig deep. Drink  water."
   ], 
   [
      "Away with you. You should not be  waking. Eat earth. Dig deep. Drink  water.", 
      "Come, the forest is waking up. It  isn’t safe."
   ], 
   [
      "Why are there so few of you when you  have lived so long? Are there Ent  children?", 
      "Bru-ra-hroom. There have been no Entings  for a terrible long count of years."
   ], 
   [
      "What do they look like?", 
      "I don’t remember now."
   ], 
   [
      "Isengard?", 
      "There was a time when Saruman would  walk in my woods."
   ], 
   [
      "There was a time when Saruman would  walk in my woods.", 
      "But now he has a mind of metal and wheels. He no longer cares for growing things."
   ], 
   [
      "The Ents have not troubled about the wars of Men and wizards for a very long time.", 
      "But now, something is about to happen that has not happened for an age ... Entmoot."
   ], 
   [
      "What’s that?", 
      "'Tis a gathering."
   ], 
   [
      "A gathering of what?", 
      "Beech. Oak. Chestnut. Ash. Good. Good. Good. Many have come."
   ], 
   [
      "Beech. Oak. Chestnut. Ash. Good. Good. Good. Many have come.", 
      "Now we must decide if the Ents will go to war."
   ], 
   [
      "It’s been going for hours.", 
      "Decided? No."
   ], 
   [
      "Decided? No.", 
      "We only just finished saying...good morning."
   ], 
   [
      "TREEBEARD We have just agreed.", 
      "I have told your names to the Entmoot and we have agreed ... you are not Orcs."
   ], 
   [
      "And what about Saruman? Have you come  to a decision about him?", 
      "Now don’t be hasty, Master Meriadoc."
   ], 
   [
      "Hasty? Our friends are out there. They need our help. They cannot fight this war on their own.", 
      "CUT TO:"
   ], 
   [
      "EXT. ENT MOOT - NIGHT  TREEBEARD stands over the HOBBITS, the other ENTS behind him.                 ANGLE ON: TREEBEARD stands up uncomfortably. MERRY looks to the other ENTS.     ANGLE ON: The ENTS looks at each other, surprised at this outburst.             CLOSE ON: MERRY stands speechless ... angry ... frustrated.  LATER...  MERRY is putting on his jacket. PIPPIN approaches him slowly.", 
      "The Ents cannot hold back this storm.  We must weather such things as we have always done."
   ], 
   [
      "They have broken through! The castle  is breached! Retreat!", 
      "I will leave you at the western borders of the forest. You can make your way north to your homeland from there."
   ], 
   [
      "Turn around. Turn around. Take us south!", 
      "South? But that will lead you past Isengard."
   ], 
   [
      "South? But that will lead you past Isengard.", 
      "That doesn’t make sense to me. But  then, you are very small. Perhaps you’re right."
   ], 
   [
      "That doesn’t make sense to me. But  then, you are very small. Perhaps you’re right.", 
      "South it is then. Hold on, little Shirelings."
   ], 
   [
      "CUT TO:", 
      "And a little family of field mice that climb up sometimes, and they tickle me awfully. They’re always trying to get somewhere where they..."
   ], 
   [
      "I’m sorry, Treebeard.", 
      "They had voices of their own."
   ], 
   [
      "They had voices of their own.", 
      "Saruman."
   ], 
   [
      "Saruman.", 
      "A wizard should know better!"
   ], 
   [
      "A wizard should know better!", 
      "There is no curse in Elvish, Entish or the tongues of Men for this treachery."
   ], 
   [
      "Where are they going?", 
      "My business is with Isengard tonight... with rock and stone."
   ], 
   [
      "Yes!", 
      "Come my friends. The Ents are going to war. It is likely that we go to our doom. Last march of the Ents!"
   ], 
   [
      "Pippin! Hold on!", 
      "Hold on little Hobbits!"
   ]
]
 }