{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "They must have caught our scent.   Hurry!", 
      "Three days and nights pursuit. No food. No rest. And no sign of our quarry but what bare rock can tell."
   ], 
   [
      "Not idly do the leaves of Lórien fall.", 
      "They may yet be alive."
   ], 
   [
      "Less than a day ahead of us. Come.", 
      "I am wasted on cross-country. We  dwarves are natural sprinters. Very dangerous over short distances."
   ], 
   [
      "Legolas! What do your Elf eyes see?", 
      "The Uruks turn northeast. They’re taking the Hobbits to Isengard!"
   ], 
   [
      "Keep breathing. That’s the key. Breathe.", 
      "They run as if the very whips of their  masters were behind them."
   ], 
   [
      "EXT. PLAINS OF ROHAN - DAY  The dawning sun rises as the THREE HUNTERS continue their trek across the fields at high speed.   ANGLE ON: LEGOLAS pauses and looks upon the sun with dread.      Without another word, he continues on the hunt.  EXT. PLAINS OF ROHAN - DAY  At the top of a rise, ARAGORN stops again to examine the  ground.   ON THE SOUNDTRACK: The SOUNDS OF HORSES NEIGHING BREAKS THE  AIR!   ANGLE ON: ARAGORN looks up warily. He gestures to LEGOLAS and GIMLI to hasten behind a nearby rock formation to hide.  WIDE ON: The ÉOMER AND HIS RIDERS OF ROHAN ride over the hill.   ANGLE ON: ARAGORN looks up at them passing. He walks calmly out of hiding.       WIDE ON: The HEAD HORSEMAN signals the pack with his spear.  With astonishing speed and skill, the ROHIRRIM check their steeds, wheel around, and charge the THREE.   ANGLE ON: ARAGORN is joined by LEGOLAS and GIMLI. Together,  they watch the ROHIRRIM approach.  WIDE ON: The RIDERS circle around the THREE HUNTERS tightly. They suddenly stop and point their spears at the THREE.  ANGLE ON: ARAGORN holds up his hands in surrender...ÉOMER rides forward and addresses them from his steed.", 
      "A red sun rises. Blood has been  spilled this night."
   ], 
   [
      "I would cut off your head, beard and all, Master Dwarf, if it stood but a little higher from the ground.", 
      "You would die before your stroke fell."
   ], 
   [
      "It’s one of their wee belts.", 
      "Hiro hyn hîdh ab 'wanath."
   ], 
   [
      "The air is so close in here.", 
      "The trees are speaking to each other."
   ], 
   [
      "Lower your axe.", 
      "They have feelings, my friend. The Elves began it. Waking up the trees, teaching them to speak."
   ], 
   [
      "Aragorn, nad nâ ennas!", 
      "Something is out there."
   ], 
   [
      "What do you see?", 
      "The White Wizard approaches."
   ], 
   [
      "It cannot be.", 
      "Forgive me. I mistook you for Saruman."
   ], 
   [
      "This new Gandalf’s more grumpy than  the old one.", 
      "That is one of the Mearas, unless my eyes are cheated by some spell."
   ], 
   [
      "Wargs!", 
      "A scout!"
   ], 
   [
      "Aragorn!", 
      "Aragorn?"
   ], 
   [
      "Took a little tumble off the cliff.", 
      "You lie."
   ], 
   [
      "Gimli, where is the king?", 
      "Le ab-dollen."
   ], 
   [
      "Le ab-dollen.", 
      "You look terrible."
   ], 
   [
      "We’ll place the reserves along the wall.  They can support the archers from above  the gate.", 
      "Aragorn, you must rest. You’re no use  to us half alive."
   ], 
   [
      "Or too few.", 
      "Look at them. They’re frightened. I  can see it in their eyes."
   ], 
   [
      "Look at them. They’re frightened. I  can see it in their eyes.", 
      "Boe a hûn...neled herain...dan caer menig!"
   ], 
   [
      "Si beriathar hýn. Amar nâ ned Edoras.   They have more hope of defending themselves here than at Edoras.", 
      "Aragorn, we are warriors. They cannot win this fight. They are all going to die!"
   ], 
   [
      "INT. ARMORY, HELM’S DEEP - NIGHT  SERIES OF IMAGES: ARAGORN quickly dons his CHAIN MAIL, LEATHER VEST, and ELVEN DAGGER.   ANGLE ON: SOMEONE hands ARAGORN his SWORD...ARAGORN looks up... LEGOLAS stands before ARAGORN, ARAGORN’S sword in hand. ARAGORN takes it and nods in thanks.       ARAGORN shakes his head.        They smile at each other, their friendship renewed.   ANGLE ON: GIMLI wrestles with a shirt of CHAIN MAIL.     He gets the shirt on, and drops the bundle to the floor. It lands in a heap.  ANGLE ON: ARAGORN and LEGOLAS smile...GIMLI is unphased.     ANGLE ON: ARAGORN and LEGOLAS nod in feigned agreement.  ON THE SOUNDTRACK: A HORN sounds from outside.  ANGLE ON: LEGOLAS turns in curiosity.     ANGLE ON: LEGOLAS and ARAGORN run out of the ARMORY.", 
      "We have trusted you this far. You have not led us astray. Forgive me. I was wrong to despair."
   ], 
   [
      "We had time, I’d get this adjusted.", 
      "That is no Orc horn."
   ], 
   [
      "Well lad, whatever luck you live by, let’s hope it lasts the night.", 
      "Your friends are with you, Aragorn."
   ], 
   [
      "What’s happening out there?", 
      "Shall I describe it to you?"
   ], 
   [
      "Shall I describe it to you?", 
      "Or would you like me to find you a box?"
   ], 
   [
      "Tangado halad!", 
      "Faeg i-varv dîn na lanc...a nu ranc."
   ], 
   [
      "Legolas! Two already!", 
      "I’m on seventeen!"
   ], 
   [
      "I’ll have no pointy-ear outscoring me!", 
      "Nineteen!"
   ], 
   [
      "Gimli! Aragorn! Get out of there!", 
      "ARAGORN!"
   ], 
   [
      "Stay out of the forest! Keep away from the trees!", 
      "Final count...42."
   ], 
   [
      "Forty-two? That’s not bad for a  pointy-eared Elvish princeling. I  myself am sitting pretty on 43.", 
      "Forty-three."
   ], 
   [
      "He was already dead.", 
      "He was twitching."
   ]
]
 }