{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "The enemy?", 
      "His sense of duty was no less than  yours, I deem."
   ], 
   [
      "His sense of duty was no less than  yours, I deem.", 
      "You wonder what his name is, where he came from. And if he was really evil at heart. What lies or threats led him on this long march from home. If he would not rather have stayed there...in peace."
   ], 
   [
      "You wonder what his name is, where he came from. And if he was really evil at heart. What lies or threats led him on this long march from home. If he would not rather have stayed there...in peace.", 
      "War will make corpses of us all. Bind  their hands."
   ], 
   [
      "GALADRIEL   Do we leave Middle-earth to its fate?  Do we let them stand alone?", 
      "What news?"
   ], 
   [
      "Some thousands. More come every  day.", 
      "Who’s covering the river to the north?"
   ], 
   [
      "We pulled 500 Men at Osgiliath, but if the city is attacked, we won’t hold it.", 
      "Saruman attacks from Isengard."
   ], 
   [
      "Saruman attacks from Isengard.", 
      "Sauron from Mordor."
   ], 
   [
      "Sauron from Mordor.", 
      "The fight will come to Men on both fronts. Gondor is weak."
   ], 
   [
      "The fight will come to Men on both fronts. Gondor is weak.", 
      "He knows now we do not have the strength to repel him."
   ], 
   [
      "INT. HENNETH ANNÛN - LATER  CLOSE ON: FRODO’S BLINDFOLD is ripped of him.  ANGLE ON: FRODO and SAM stand in the midst of the GONDORIAN RANGERS, all walking to and fro in their duties.  ANGLE ON: FARAMIR enters and address FRODO and SAM.             SAM looks over to FRODO, who remains silent and unmoving... FARAMIR sits to address them.     FRODO and SAM stay silent for a moment...finally, FRODO speaks.                 ANGLE ON: FRODO looks suddenly nervous, his eyes widening.", 
      "My Men tell me that you are Orc  spies."
   ], 
   [
      "Spies?! Now wait just a minute!", 
      "Well if you’re not spies, then who  are you?"
   ], 
   [
      "Well if you’re not spies, then who  are you?", 
      "We are Hobbits of the Shire. Frodo Baggins is my name, and this is Samwise Gamgee."
   ], 
   [
      "We are Hobbits of the Shire. Frodo Baggins is my name, and this is Samwise Gamgee.", 
      "Your bodyguard?"
   ], 
   [
      "His gardener.", 
      "That gangrel creature. He had an ill- favored look."
   ], 
   [
      "One we lost in Moria, two were my kin, a Dwarf there was also, and an Elf. And two Men, Aragorn, son of Arathorn, and Boromir of Gondor.", 
      "You’re a friend of Boromir?"
   ], 
   [
      "If something has happened to Boromir, we would have you tell us.", 
      "His horn washed up on the riverbank, about six days past. It was cloven in two. But more than this, I know it in my heart. He was my brother."
   ], 
   [
      "This city of Osgiliath has been  reclaimed for Gondor!", 
      "Good speech. Nice and short."
   ], 
   [
      "What?", 
      "He’s here."
   ], 
   [
      "Always you cast a poor reflection on me.", 
      "That is not my intent."
   ], 
   [
      "Would you deny your own father?", 
      "If there is a need to go to Rivendell, send me in his stead."
   ], 
   [
      "INT. HENNETH ANNÛN - NIGHT  ANGLE ON: FRODO and SAM sleep. FRODO’S eyes slowly open as footsteps approach. He looks up at figures before him.  ANGLE ON: FARAMIR stands before him with 2 other GONDORIAN RANGERS.     FRODO silently rises and follows them.  EXT. HENNETH ANNÛN - NIGHT  WIDE ON: The Waterfall concealing their location flows over the cliff leaving space on the sides. FARAMIR inches toward the edge.  ANGLE ON: FARAMIR gestures to FRODO.     ANGLE ON: FRODO carefully walks to the edge and looks down. FARAMIR eyes him watchfully.  ANGLE ON: Far below, GOLLUM jumps into the pool at the base of the waterfall.  ANGLE ON: FRODO’S eyes open wide, as if caught in his lie.       FRODO looks at FARAMIR with fear. FARAMIR gestures to the sides of the waterfall...ARCHERS stationed on both sides of the pool lean in and draw their bows...FRODO looks back to GOLLUM.     ANGLE ON: Far below, GOLLUM emerges from the pool with a fish in his teeth and sits on a rock.  ANGLE ON: FARAMIR still calmly watches FRODO’S reactions.", 
      "You must come with me. Now."
   ], 
   [
      "You must come with me. Now.", 
      "Down there."
   ], 
   [
      "Down there.", 
      "They wait for my command."
   ], 
   [
      "They wait for my command.", 
      "Shall I shoot?"
   ], 
   [
      "INT. HENNETH ANNÛN - NIGHT  CLOSE ON: GOLLUM is slung against a wall of the cave. He wails in agony.  ANGLES ON: FARAMIR’S MEN throw GOLLUM to the ground, beating and kicking him. GOLLUM is helpless against their strength.  ANGLE ON: FARAMIR watches out into the night. Finally, he turns to them.     ANGLE ON: The MEN throw GOLLUM to the ground. He scrambles into a corner. FARAMIR approaches him.     ANGLE ON: GOLLUM cowers away from him, whimpering.     GOLLUM continues sobbing. Suddenly, his hand starts stroking his shoulder, comfortingly.     ANGLE ON: FARAMIR looks upon GOLLUM, confused.         SMÉAGOL sobs again.", 
      "That’s enough."
   ], 
   [
      "That’s enough.", 
      "Answer me!"
   ], 
   [
      "Mr. Frodo...", 
      "The Ring of Power within my grasp."
   ], 
   [
      "The Ring of Power within my grasp.", 
      "A chance for Faramir, captain of Gondor, to show his quality."
   ], 
   [
      "Captain?", 
      "Prepare to leave."
   ], 
   [
      "Mordor has come.", 
      "Hurry."
   ], 
   [
      "It’s calling to him, Sam. His Eye is almost on me.", 
      "Take them to my father."
   ], 
   [
      "Take them to my father.", 
      "Tell him Faramir sends a mighty gift. A weapon that will change our fortunes in this war."
   ], 
   [
      "They’ve come.", 
      "Nazgûl!"
   ], 
   [
      "Nazgûl!", 
      "Take cover!"
   ], 
   [
      "There’s some good in this world, Mr. Frodo. And it’s worth fighting for.", 
      "I think at last we understand one another, Frodo Baggins."
   ], 
   [
      "I think at last we understand one another, Frodo Baggins.", 
      "Then it is forfeit. Release them."
   ], 
   [
      "Exactly.  Bah-hrum.", 
      "This is the old sewer. Runs right under the river through to the edge of the city. You’ll find cover in  the woods there."
   ], 
   [
      "The very highest.", 
      "What road will you take once you reach  the woods?"
   ], 
   [
      "Gollum says there’s a path near Minas  Morgul that climbs up into the  mountains.", 
      "Cirith Ungol?"
   ], 
   [
      "Cirith Ungol?", 
      "Is that its name?"
   ], 
   [
      "No. No!", 
      "Frodo, they say a dark terror dwells in the passes above Minas Morgul. You  cannot go that way."
   ], 
   [
      "I must.", 
      "Go, Frodo. Go with the goodwill of all Men."
   ], 
   [
      "Thank you.", 
      "May death find you quickly if you  bring them to harm."
   ]
]
 }