{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "EXT. EMYN MUIL - NIGHT  ANGLE ON: FRODO and SAM sleep.   HIGH WIDE: A dark, spidery shape appears on top of the cliff  and makes its way down to the slumbering HOBBITS.   ANGLE ON: The emaciated creature is dressed only in a tattered loincloth, and appears mostly human in appearance. Its frame is quite thin, but its hands, feet, and eyes are oversized. What hair remains is thin and falls where it may about its shoulders. It descends the rock face upside down like an insect. This is GOLLUM. He speaks in an ancient, gravely voice.      CRANE BEHIND GOLLUM as he climbs down.       GOLLUM reaches his hand out to snatch his prize.  SUDDENLY, the HOBBITS spring and snatch GOLLUM off the side of the rock. Amidst the struggle, GOLLUM wriggles loose and throws them both away from him.   As FRODO falls back, the RING comes out of his shirt.   GOLLUM recovers and sees the RING. He leaps straight for it. GOLLUM desperately tries to get his hands on his  precious while FRODO struggles to prevent this.  SAM recovers and grabs GOLLUM by the ankle, dragging him  away from FRODO...GOLLUM reels back and hits SAM in the face, knocking him away.   He pounces back on FRODO and reaches for the RING...FRODO  grabs Gollum’s hand, and struggles against his considerable strength.   CLOSE ON: GOLLUM’S cheeks puff with exertion as he struggles  with FRODO, his enormous eyes fixed on the RING.", 
      "The thieves. The thieves. The filthy little thieves. Where is it?"
   ], 
   [
      "The thieves. The thieves. The filthy little thieves. Where is it?", 
      "Where is it? They stole it from us. My precious. Curse them, we hates them! It’s ours, it is, and we wants it!"
   ], 
   [
      "Release him or I’ll cut your throat!", 
      "It burns! It burns us! It freezes! Nasty Elves twisted it. Take it off us!"
   ], 
   [
      "It’s hopeless. Every Orc in Mordor’s going to hear this racket. Let’s just tie him up and leave him.", 
      "No! That would kill us! Kill us!"
   ], 
   [
      "It’s no more than you deserve!", 
      "We be nice to them if they be nice to us. Take it off us."
   ], 
   [
      "We be nice to them if they be nice to us. Take it off us.", 
      "We swears to do what you wants. We swears."
   ], 
   [
      "There’s no promise you can make that I can trust.", 
      "We swears to serve the master of the precious. We will swear on the...on the precious.    Gollum. Gollum."
   ], 
   [
      "The Ring is treacherous. It will hold you to your word.", 
      "Yes...on the precious. On the precious."
   ], 
   [
      "You know the way to Mordor?", 
      "Yes."
   ], 
   [
      "You’ve been there before?", 
      "Yes."
   ], 
   [
      "But we swore to serve the master of  the precious.", 
      "No. Ashes and dust and thirst there  is, and pits, pits, pits."
   ], 
   [
      "No. Ashes and dust and thirst there  is, and pits, pits, pits.", 
      "And Orcses, thousands of Orcses.  And always the Great Eye watching,  watching."
   ], 
   [
      "Hey! Come back now! Come back!", 
      "This way, Hobbits. Follow me!"
   ], 
   [
      "Saruman.", 
      "Very lucky we find you."
   ], 
   [
      "Very lucky we find you.", 
      "CUT TO:"
   ], 
   [
      "It’s a bog. He’s led us into a swamp.", 
      "A swamp, yes, yes. Come, master. We will take you on safe paths through the mist."
   ], 
   [
      "A swamp, yes, yes. Come, master. We will take you on safe paths through the mist.", 
      "Come, Hobbits, come. We go quickly."
   ], 
   [
      "Come, Hobbits, come. We go quickly.", 
      "I hate this place. It’s too quiet. There’s been no sight or sound of a bird for two days."
   ], 
   [
      "I hate this place. It’s too quiet. There’s been no sight or sound of a bird for two days.", 
      "No, no birdses to eat. No crunchable birdses."
   ], 
   [
      "No, no birdses to eat. No crunchable birdses.", 
      "We are famished! Yes! Famished we are,  precious!"
   ], 
   [
      "Here.", 
      "It tries to chokes us! We can’t eats  Hobbit food! We must starve!"
   ], 
   [
      "Well, starve, then. And good riddance!", 
      "Oh, cruel Hobbit. It does not care if  we be hungry. Does not care if we  should die."
   ], 
   [
      "Oh, cruel Hobbit. It does not care if  we be hungry. Does not care if we  should die.", 
      "Not like master."
   ], 
   [
      "Not like master.", 
      "Once it takes hold of us, it never lets go."
   ], 
   [
      "There are dead things! Dead faces in  the water.", 
      "All dead. All rotten. Elves and Men and Orcses. A great battle long ago."
   ], 
   [
      "All dead. All rotten. Elves and Men and Orcses. A great battle long ago.", 
      "Dead Marshes. Yes. Yes, that is their  name.   This way. Don’t follow the lights."
   ], 
   [
      "Dead Marshes. Yes. Yes, that is their  name.   This way. Don’t follow the lights.", 
      "Or Hobbits go down to join the dead ones and light little candles of their own."
   ], 
   [
      "Mr. Frodo! Are you all right?", 
      "FRODO What did you say?"
   ], 
   [
      "Who are you?", 
      "Mustn’t ask us. Not its business.  Gollum. Gollum."
   ], 
   [
      "Gandalf told me you were one of the river-folk.", 
      "Cold be heart and hand and bone Cold be travelers far from home"
   ], 
   [
      "He said your life was a sad story.", 
      "They do not see what lies ahead,    when sun has failed and moon is dead."
   ], 
   [
      "You were not so very different from a Hobbit once. Were you?", 
      "What did you call me?"
   ], 
   [
      "That was your name once, wasn’t it?  A long time ago.", 
      "My name...my name...  Sméagol."
   ], 
   [
      "My name...my name...  Sméagol.", 
      "Hide! Hide!"
   ], 
   [
      "I thought they were dead!", 
      "Dead? No, you cannot kill them. No."
   ], 
   [
      "Dead? No, you cannot kill them. No.", 
      "They are calling for it. They are calling for the precious."
   ], 
   [
      "They are calling for it. They are calling for the precious.", 
      "Hurry, Hobbits. The Black Gate is very  close."
   ], 
   [
      "CUT TO:", 
      "The Black Gate of Mordor."
   ], 
   [
      "My old Gaffer would have a thing or two to say if he could see us now.", 
      "Master says to show him the way into Mordor. So good Sméagol does, master says so."
   ], 
   [
      "Master!", 
      "I do not ask you to come with me, Sam."
   ], 
   [
      "Now!", 
      "They catch you! They catch you!"
   ], 
   [
      "They catch you! They catch you!", 
      "Don’t take it to him."
   ], 
   [
      "Don’t take it to him.", 
      "No! There’s another way. There’s another way. More secret. A dark way."
   ], 
   [
      "Why haven’t you spoken of this before?!", 
      "Because Master did not ask."
   ], 
   [
      "Are you saying there’s another way into Mordor?", 
      "Yes. There’s a path...and some stairs... and then...a tunnel."
   ], 
   [
      "Lead the way, Sméagol.", 
      "Good Sméagol always helps."
   ], 
   [
      "EXT. ITHILIEN - NIGHT  SAM and FRODO sleep.   CLOSE ON: FRODO clutches the RING in his hand.      ANGLE ON: GOLLUM watches them from a distance...hatred is etched across his face.       Suddenly, his expression softens, and he shakes his head. His eyes grow wide, as if looking at his GOLLUM half.     His expression turns to hate again. His head turns as if responding to the SMÉAGOL half.", 
      "We wants it. We needs it."
   ], 
   [
      "We wants it. We needs it.", 
      "Must have the precious. They stole it from us. Sneaky little Hobbitses. Wicked. Tricksy. False."
   ], 
   [
      "No. Not Master.", 
      "SMÉAGOL Master’s my friend."
   ], 
   [
      "Not listening. I’m not listening.", 
      "You’re a liar and a thief."
   ], 
   [
      "You’re a liar and a thief.", 
      "Murderer."
   ], 
   [
      "Go away.", 
      "Go away?"
   ], 
   [
      "I hate you. I hate you.", 
      "Where would you be without me?   Gollum. Gollum. I saved us. It was me. We survived because of me."
   ], 
   [
      "Master looks after us now. We don’t need you.", 
      "Leave now and never come back."
   ], 
   [
      "Gone! Gone! Gone! Sméagol is free!", 
      "They are young."
   ], 
   [
      "They are young.", 
      "They are tender. They are nice. Yes, they are. Eat them. Eat them!"
   ], 
   [
      "There’s only one way to eat a brace of coneys.", 
      "What’s to ruin? There’s hardly any meat on them."
   ], 
   [
      "What we need is a few good taters.", 
      "What’s taters, precious? What’s taters? Eh?"
   ], 
   [
      "Even you couldn’t say no to that.", 
      "Oh, yes, we could. Spoil a nice fish."
   ], 
   [
      "Oh, yes, we could. Spoil a nice fish.", 
      "SAM You’re hopeless."
   ], 
   [
      "Ready to do what?", 
      "To make his war. The last war that will cover all the world in Shadow."
   ], 
   [
      "Come, Sméagol. Trust master. Come!", 
      "We must go now?"
   ], 
   [
      "No. Not its business. Leave us alone!", 
      "Filthy little Hobbitses. They stole it from us!"
   ], 
   [
      "No ... No.", 
      "My Precious!"
   ], 
   [
      "Is that its name?", 
      "No. No!"
   ], 
   [
      "Frodo, they say a dark terror dwells in the passes above Minas Morgul. You  cannot go that way.", 
      "I must."
   ], 
   [
      "Save me?", 
      "So there’s no hard feelings. Forgive  and forget."
   ], 
   [
      "So there’s no hard feelings. Forgive  and forget.", 
      "No, no, no hard feelings.  Gollum, Gollum. Yes, master."
   ], 
   [
      "No, no, no hard feelings.  Gollum, Gollum. Yes, master.", 
      "Nice Hobbits."
   ], 
   [
      "Master. Master looks after us. Master wouldn’t hurt us.", 
      "Master broke his promise."
   ], 
   [
      "Don’t ask Sméagol. Poor, poor Sméagol.", 
      "Master betrayed us. Wicked. Tricksy. False. We ought to wring his filthy little neck. Kill him! Kill him! Kill them both. And then we take the precious and we be the master!"
   ], 
   [
      "Yes! Yes! Yes!", 
      "Kill them both."
   ]
]
 }