{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "The woman who gave you that jewel.", 
      "Our time here is ending. Arwen’s time is ending. Let her go. Let her take the ship into the west. Let her bear away her love for you to the Undying Lands. There it will be ever green."
   ], 
   [
      "She stays because she still has hope.", 
      "CUT TO:"
   ], 
   [
      "Brego.", 
      "Tollen i lû. I chair gwannar na Valannor. Si bado...no círar."
   ], 
   [
      "I have made my choice.", 
      "He is not coming back. Why do you  linger here when there is no hope?"
   ], 
   [
      "There is still hope.", 
      "If Aragorn survives this war, you will still be parted. If Sauron is defeated and Aragorn made king and all that you hope for comes true, you will still have to taste the bitterness of mortality. Whether by the sword or the slow decay of time, Aragorn will die."
   ], 
   [
      "If Aragorn survives this war, you will still be parted. If Sauron is defeated and Aragorn made king and all that you hope for comes true, you will still have to taste the bitterness of mortality. Whether by the sword or the slow decay of time, Aragorn will die.", 
      "ELROND  He will come to death, an image of  the splendor of the kings of Men in  glory undimmed before the breaking of  the world.  But you, my daughter, you will linger on in darkness and in doubt as nightfall in winter that comes without a star."
   ], 
   [
      "ELROND  He will come to death, an image of  the splendor of the kings of Men in  glory undimmed before the breaking of  the world.  But you, my daughter, you will linger on in darkness and in doubt as nightfall in winter that comes without a star.", 
      "Here you will dwell, bound to your grief..."
   ], 
   [
      "Here you will dwell, bound to your grief...", 
      "...under the fading trees, until all the world has changed and the long years of your life are utterly spent."
   ], 
   [
      "...under the fading trees, until all the world has changed and the long years of your life are utterly spent.", 
      "There is nothing for you here, only death."
   ], 
   [
      "There is nothing for you here, only death.", 
      "A im, ú-'erin veleth lîn?"
   ]
]
 }