{ "lines" :  
[
   [
      "Jackie Q, a slutty Fergie style singer, dances to a song called “Pound Me in the Buttocks.”  Aldous is risen from his stupor and pays attention to this news story.", 
      "Pound me in the buttocks!  Pound me right now!  You gotta pound me in the buttocks!  Pound me with a pow!"
   ], 
   [
      "*", 
      "********"
   ], 
   [
      "Aldous WATCHES television.  ANGLE ON THE TELEVISION is a Jackie Q video.  She’s singing an incredibly sultry version of “Ring Around the Rosy.”", 
      "*****"
   ], 
   [
      "Aldous gets out of the car and heads towards the front of the house.  He knocks on the door.  Jackie Q answers.", 
      "Well fuck me."
   ], 
   [
      "Aldous and Jackie have finished having sex.", 
      "**"
   ], 
   [
      "Naples holds up a very sharp kitchen knife.", 
      "Now what are you doing with that, Naples?"
   ], 
   [
      "Naples makes a stabbing gesture with the knife.", 
      "C’mere, Naples, and say hello to your friend, Aldous."
   ], 
   [
      "Sorry about that, Ms. Jackie.", 
      "Leave him.  He’s perfection.  Aren’t you?  Aren’t you?"
   ], 
   [
      "Aldous stalks after Naples like a monster.", 
      "I love you, you crazy, crazy man!"
   ], 
   [
      "We should get married.", 
      "What?"
   ], 
   [
      "Let’s just go get married.  We already have bundled our genes into this perfect little moppet.  Let’s stop lying to ourselves and tie the knot already.", 
      "Paul’s docking later this afternoon so you should probably dry off and go."
   ], 
   [
      "Screw Paul Allen.  Unengage him.  Screw our little boxes that we’ve put our lives in.", 
      "*"
   ], 
   [
      "***", 
      "I will be honest with you.  You were only good for the sex and the child support cash.  Now that I’m marrying Paul I don’t need you.  And it’s not just the money; he’s also much nicer to me than you ever were.  You and I are terrible together.  We’re just good at sex.  Sex isn’t love.  Sex isn’t commitment.  Sex is sex is sex is sex."
   ], 
   [
      "Sexsexsexsexsexsexsex!", 
      "Suzette!"
   ], 
   [
      "But you just told me you loved me.", 
      "That was then, this is now."
   ], 
   [
      "That was like twenty minutes ago.", 
      "My emotions can’t be controlled.  You know that."
   ], 
   [
      "Suzette scoops Naples out of the pool.  Naples howls.", 
      "Now look what you’ve done.  You’ve gotten Naples all pissed.  Suzette!"
   ], 
   [
      "I don’t want to go!", 
      "*"
   ], 
   [
      "That’s gonna change right now!  I love him!  A son should be raised by his father!", 
      "Well in that case he should be raised by Hugh Grant."
   ], 
   [
      "What?  No.  Me.  He’s half me.", 
      "No he’s not.  He’s half me, he’s half Hugh Grant.  That’s the truth."
   ], 
   [
      "No he’s not.  He’s half me, he’s half Hugh Grant.  That’s the truth.", 
      "I shoulda told you six years ago but if I had you woulda stopped sending me child support payments.  That’s not right which is why I’m going to pay you back.  In fact I’ll write the check right now."
   ]
]
 }