{ "lines" :  
[
   [
      "Aaron and Daphne walk with a REALTOR around the loft space.  There’s a studio with a potter’s wheel.  Daphne’s clearly in heaven.", 
      "Are you sure you can afford it?"
   ], 
   [
      "They hit the buzzer again.", 
      "Mom, dad, come on up!"
   ], 
   [
      "*", 
      "You don’t have to be so dismissive of it, dad."
   ], 
   [
      "Daphne snickers.  Her parents do not.", 
      "Mom, you want to take a tour of the building?"
   ], 
   [
      "Aaron and Daphne are cleaning up the meal.", 
      "What if my dad’s right?  What if I have no talent?"
   ], 
   [
      "First of all, he said you had talent.  He just said there’s not enough customers.  Which there are, by the way.  Forget I mentioned it.", 
      "Maybe this is all just shit shit shit and shit.  I just want to break it all and start over again."
   ], 
   [
      "Did you use glaze?", 
      "Yeah.  He’s right.  My career’s going nowhere.  I suck."
   ], 
   [
      "Aaron’s relentless positivity is starting to grate.", 
      "The point isn’t the show, Aaron.  It’s not that easy.  Trying to do something creative is just different than what you do.  It’s not a linear process.  No offense."
   ], 
   [
      "You’re not being a bitch.", 
      "I was being a bitch.  You can be mad at me."
   ], 
   [
      "I’m not mad at you.", 
      "I love that you’re nice.  You’re the first nice guy I’ve ever dated and I love that about you.  But when I’m being a bitch and you don’t say I’m being a bitch you’re keeping a part of yourself closed off from me.  Feel free to be honest and tell me when you’re annoyed at me."
   ], 
   [
      "Daphne takes a deep breath.", 
      "Cool.  I’ll try that.  I’ll just make a list."
   ], 
   [
      "Aaron gets into bed next to Daphne who’s reading Cosmo.", 
      "Check this out.  It says that the number one sex secret for men is licking his butt.  Isn’t that hilarious?"
   ], 
   [
      "They both laugh.", 
      "You wouldn’t ever want me to do that?"
   ], 
   [
      "No.  Of course not.", 
      "I didn’t think so.  Just kidding anyway."
   ], 
   [
      "Guess who’s going to hang out with Aldous Snow, baby?", 
      "What accent is that?"
   ], 
   [
      "The Flight Attendant leads them to their seats.  Aldous heads to the bathroom.  Aaron’s phone rings.  He answers it. SPLIT SCREEN between him and Daphne.  Daphne has a giant bouquet of flowers.", 
      "Baby you shouldn’t have!  You’re only away for one night!"
   ], 
   [
      "Didn’t want anyone stealing you away.", 
      "How’s it going?"
   ], 
   [
      "Great.  Really great.", 
      "What’s Aldous like?"
   ], 
   [
      "Super cool.  Like couldn’t be a better guy.", 
      "Really?  Cause from afar he seems like he’d be totally crazy."
   ], 
   [
      "Funnily enough, turns out we’re going to New York instead of LA first so I’m probably not going to be home for another night.", 
      "That sucks.  Why the change?"
   ], 
   [
      "Totally planned.  Turns out he needs to do some press stuff in New York first.", 
      "You really have no stories?  He didn’t say or do anything funny?"
   ], 
   [
      "Nope.  Pretty straight laced, good guy.", 
      "You’re using your lying voice."
   ], 
   [
      "I’d be lying if I said anything interesting happened.", 
      "I don’t want to find out he’s been making you do crazy stuff like smuggling a bong on the plane and you’ve been too scared to tell me."
   ], 
   [
      "It’s a terrifying alley.  Like it could not be scarier.  Aaron looks down the alley.  Aaron takes out his cell and dials.  Daphne answers.  She’s at Banana Republic.  As Aaron talks, he walks down the alley.", 
      "Hey, baby.  What’s going on?"
   ], 
   [
      "I just wanted to tell you, sweetie, how much I love you.  Like love love you.", 
      "Me too."
   ], 
   [
      "No, like, I love love you.", 
      "I love love you too.  Are you crying?  Cause you crying is going to make me cry."
   ], 
   [
      "What if I never saw you again?  I don’t know what I’d do with myself.", 
      "It’s so good to hear you open up and be emotional.  So often I feel like the needy one in our relationship."
   ], 
   [
      "His phone beeps.  It’s Daphne.", 
      "Hi, baby.  When do you get in?"
   ], 
   [
      "-- The Lounge.  Palms Casino.  I don’t know why it’s not on the website.  Maybe because it’s next door.  Is everything OK?", 
      "**"
   ], 
   [
      "Well, I’m sure it looks beautiful.", 
      "It does and that’s the problem."
   ], 
   [
      "Sergio hangs up.  Aaron flips back to Daphne.", 
      "Hello?  Hello?  Hello?  Aaron?"
   ], 
   [
      "I’m sure your piece is much better than you think it is.", 
      "But if I think it’s bad then in my reality it is simply bad and isn’t that the only thing that counts?"
   ], 
   [
      "I don’t know -- Uh, my battery’s dying,", 
      "I love you!"
   ], 
   [
      "Aaron and Daphne are eating dinner.  Aaron is holding Daphne’s hand.", 
      "You’re really going to hold my hand all the way through dinner?"
   ], 
   [
      "Daphne shows up behind Aaron.", 
      "My gosh, Aldous Snow!"
   ], 
   [
      "I love this piece.", 
      "Thanks."
   ], 
   [
      "I don’t know about --", 
      "**"
   ], 
   [
      "Where’s this?", 
      "Buenos Aires.  That was our first transatlantic trip together."
   ], 
   [
      "It’s only been three years.", 
      "I getcha, man.  It’s my longest relationship by far.  Sometimes, it’s like, wow."
   ], 
   [
      "I was just joking.", 
      "I’d love to try a threesome.  You know, before I die."
   ], 
   [
      "If you’d like, but I certainly don’t want to apply any pressure.  I have had my share of threesomes.", 
      "C’mon, let’s do a threesome.  Wouldn’t that be fun?"
   ], 
   [
      "I was speaking completely theoretically.  I’m not actually sure whether we should really be having a threesome in reality.", 
      "You just said it’s something that you’d like to try."
   ], 
   [
      "Well, I mean, it is.", 
      "So why not try it?  If we don’t like it we don’t have to do it again."
   ], 
   [
      "Daphne looks at Aaron like “see?”", 
      "I mean, unless you’re scared."
   ], 
   [
      "I’m not scared.  I was just worried that you might be scared.  I didn’t want to press you into anything.", 
      "You aren’t."
   ], 
   [
      "If you’re not scared.", 
      "I’m not scared."
   ], 
   [
      "So... I’m... gonna get some water.", 
      "I’d love some."
   ], 
   [
      "Hey, guys.  Where do you want me to put your water?", 
      "C’mon, baby, get involved."
   ], 
   [
      "I didn’t mean to.  That was an unintentional sperming.", 
      "Hey, you gotta expect that kind of thing is going to happen in this sort of situation."
   ], 
   [
      "Nahhh, I’m good, mate.  I think I’d rather stay here then watch you eat pancakes after you’ve had sex with every part of my girlfriend and then jizzed on my leg now GET THE FUCK OUT OF HERE RIGHT NOW!", 
      "Hey, Aaron, let’s talk about this!"
   ], 
   [
      "I don’t think it’s cheating when it’s a consensual threesome.", 
      "I thought you were cool with the whole threesome thing."
   ], 
   [
      "Aldous leaves the room.", 
      "I’m sorry, Aaron, I didn’t mean for this happen."
   ], 
   [
      "You were the one who said you’d be into a threesome!", 
      "After you said it!  If you didn’t want to, why weren’t you honest about that?  I would’ve said no if you didn’t want to do it."
   ], 
   [
      "How could this happen?  Our life was just going along at a great, awesome clip.  Why?", 
      "I don’t know."
   ], 
   [
      "I want you to hug me even though you were having sex with a different guy like two minutes ago.  What is wrong with me?", 
      "I want to hug you too.  It’s OK."
   ], 
   [
      "Neither Aaron nor Daphne can believe he just called her a whore.", 
      "I’m gonna go."
   ], 
   [
      "Aaron watches television, depressed.  The phone rings.", 
      "Hey, Aaron, it’s Daphne.  We should probably talk about what just happened.  I’m at my parent’s house.  Please call.  I love you.  Like a lot.  I’m sorry."
   ], 
   [
      "Daphne and her mom come to the head of the stairs.  Aaron and Daphne have this entire conversation in front of her parents.", 
      "Aaron?  What’re you doing here?"
   ], 
   [
      "I’m sorry I called you a whore.", 
      "I deserved it."
   ], 
   [
      "No one deserves to be called a whore.  Not even an actual whore.  I want to get back together.", 
      "I do too.  Desperately."
   ], 
   [
      "But only if you promise never to have sex with another man in front of me.", 
      "I won’t."
   ], 
   [
      "As the sun rises through the windows of their Great Room, Daphne tears down the stairs --", 
      "I love you when you’re honest."
   ], 
   [
      "While I was watching him there was nothing he was doing that I couldn’t physically do -- except for that one thing on the floor.  I just wouldn’t have the courage to ask you.", 
      "You don’t have to do every thing Aldous did.  But maybe one of the twelve things."
   ], 
   [
      "Great.  So let’s go do this --", 
      "I can’t do it now.  I have some kind of infection down there.  I hate that fucking guy.  It stings so bad."
   ], 
   [
      "So when should we do this?", 
      "I can have sex again in three weeks."
   ], 
   [
      "And you promise you won’t be thinking of Aldous while we’re doing it?", 
      "I promise."
   ], 
   [
      "I promise.", 
      "Now let’s get going already!"
   ]
]
 }