{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "Gerich meleth nîn, ada.", 
      "I amar prestar aen... han mathon ne nen, han mathon ne chae, a han nostan  ned gwilith."
   ], 
   [
      "I amar prestar aen... han mathon ne nen, han mathon ne chae, a han nostan  ned gwilith.", 
      "The power of the enemy is growing.  Sauron will use his puppet Saruman..."
   ], 
   [
      "The power of the enemy is growing.  Sauron will use his puppet Saruman...", 
      "...to destroy the people of Rohan."
   ], 
   [
      "...to destroy the people of Rohan.", 
      "Isengard has been unleashed."
   ], 
   [
      "Isengard has been unleashed.", 
      "...the last free kingdom of Men."
   ], 
   [
      "...the last free kingdom of Men.", 
      "His war on this country will come swiftly."
   ], 
   [
      "His war on this country will come swiftly.", 
      "He senses the Ring is close."
   ], 
   [
      "He senses the Ring is close.", 
      "The strength of the Ring-bearer is failing."
   ], 
   [
      "The strength of the Ring-bearer is failing.", 
      "...the quest will claim his life. You know this."
   ], 
   [
      "...the quest will claim his life. You know this.", 
      "FADE TO BLACK."
   ], 
   [
      "EXT. FOREST OF ITHILIEN - DAY  ANGLE ON: The GONDORIAN RANGERS continue prodding FRODO and SAM along.       ANGLE ON: FARAMIR, leading the band of RANGERS.       WIDE ANGLE ON: The WATERFALL in ITHILIEN, which conceals the hideout of the RANGERS, HENNETH ANNÛN.  INT. HENNETH ANNÛN - DAY  ANGLE ON: The MEN pass FRODO and SAM to one another within the hideout to imprison them.     INTERCUT: GALADRIEL’S EYES, watching across the distance.     INTERCUT: THE EYE OF SAURON on BARAD-DÛR.      PULL BACK TO REVEAL: The TOWER deep within MORDOR. NAZGÛL fly around the TOWER on FELL-BEASTS, guarding it from invaders.  INTERCUT: CLOSE ON: GALADRIEL’S EYES, with their deep pools of wisdom.", 
      "The young captain of Gondor has but to extend his hands, take the Ring for his own and the world will fall."
   ], 
   [
      "The young captain of Gondor has but to extend his hands, take the Ring for his own and the world will fall.", 
      "It is close now..."
   ], 
   [
      "It is close now...", 
      "...so close to achieving its goal."
   ], 
   [
      "...so close to achieving its goal.", 
      "GALADRIEL   Do we leave Middle-earth to its fate?  Do we let them stand alone?"
   ]
]
 }