{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "Gríma... Gríma...", 
      "My son... Gríma..."
   ], 
   [
      "I release you from the spell.", 
      "I will draw you, Saruman, as poison is drawn from a wound."
   ], 
   [
      "Be gone.", 
      "I know your face.   Éowyn. Éowyn."
   ], 
   [
      "I know your face.   Éowyn. Éowyn.", 
      "Gandalf?"
   ], 
   [
      "Breathe the free air again, my friend.", 
      "Dark have been my dreams of late."
   ], 
   [
      "I've only ever served you, my lord.", 
      "Your leechcraft would have had me crawling on all fours like a beast!"
   ], 
   [
      "Get out of my way!", 
      "Where is Théodred? Where is my son?"
   ], 
   [
      "Bealocwealm hafað fréone frecan forth onsended giedd sculon singan gléomenn sorgiende  on Meduselde þæt he ma no wære  his dryhtne dyrest and mæga deorost.  Bealo...", 
      "Ever has it grown on the tombs of my forebearers."
   ], 
   [
      "Ever has it grown on the tombs of my forebearers.", 
      "Now it shall cover the grave of my son.  Alas that these evil days should be mine. The young perish and the old linger. That I should live to see the last days of my house."
   ], 
   [
      "Théodred’s death was not of your making.", 
      "No parent should have to bury their  child."
   ], 
   [
      "Draw him away from your women and children. You must fight.", 
      "They will be 300 leagues from here by now. Éomer cannot help us."
   ], 
   [
      "They will be 300 leagues from here by now. Éomer cannot help us.", 
      "I know what it is that you want of me, but I will not bring further death to my people. I will not risk open war."
   ], 
   [
      "Open war is upon you, whether you would risk it or not.", 
      "When last I looked, Théoden, not Aragorn, was king of Rohan."
   ], 
   [
      "INT. THÉODEN’S ROOM, MEDUSELD - DAY  ANGLE ON: THÉODEN prepares himself...GAMLING stands ready  behind him.     GAMLING bows and walks to the door, silently, shoulders slumped...     GAMLING turns to him...     GAMLING bows to him and exits.      INT. MEDUSELD THRONE ROOM - DAY  ROHIRRIM gather things from the Great Hall and carry it out.   ANGLE ON: ÉOWYN opens a chest and pulls out a sheathed sword... she unsheathes it and holds it before her, running her hand down the flat side of the blade, smiling...deliberately, she practices her swing.  POV: Someone approaches from behind...she swings it behind her!  ANGLE ON: ARAGORN meets her swing with his DAGGER. ÉOWYN’S face does not soften at his gaze.     With a swift move, ÉOWYN swings her sword, throwing ARAGORN’S  arm and knife to one side, rendering him vulnerable and  gaining the upper hand...  He lowers his weapon...she does likewise and steps away.", 
      "I am ready, Gamling. Bring my horse."
   ], 
   [
      "I am ready, Gamling. Bring my horse.", 
      "This is not a defeat."
   ], 
   [
      "This is not a defeat.", 
      "We will return."
   ], 
   [
      "We will return.", 
      "We will return."
   ], 
   [
      "It’s all right. Nobody panic. That was deliberate. It was deliberate.", 
      "Then she was left alone, to tend her  king in growing fear. Doomed to wait  upon an old man who should have loved  her as a father."
   ], 
   [
      "A scout!", 
      "What is it? What do you see?"
   ], 
   [
      "Warg! We are under attack!", 
      "All riders to the head of the column!"
   ], 
   [
      "I can fight!", 
      "No!"
   ], 
   [
      "No!", 
      "You must do this...for me."
   ], 
   [
      "You must do this...for me.", 
      "Follow me!"
   ], 
   [
      "You lie.", 
      "Get the wounded on horses. The wolves of Isengard will return. Leave the dead."
   ], 
   [
      "Get the wounded on horses. The wolves of Isengard will return. Leave the dead.", 
      "Come."
   ], 
   [
      "So few. So few of you have returned.", 
      "Our people are safe."
   ], 
   [
      "Our people are safe.", 
      "We have paid for it with many lives."
   ], 
   [
      "EXT. HELM’S DEEP BATTLEMENTS - DAY  WIDE ON: THÉODEN stands, overlooking the land outside of HELM’S DEEP. He addresses the SOLDIERS and MEN accompanying him.       THÉODEN turns to leave the BATTLEMENTS. The MEN follow.         EXT. HELM’S DEEP - DAY  ANGLE ON: THÉODEN leads his MEN down from the BATTLEMENTS and past the DEEPING STREAM, which flows through it via a grate in the wall.       TRACK IN ON THE GRATE IN THE WALL.          INT. ORTHANC ANTE-CHAMBER - DAY  CLOSE ON: SARUMAN pours gunpowder into a LARGE STONE POT.", 
      "Draw all our forces behind the wall.  Bar the gate. And set a watch on the surround."
   ], 
   [
      "What of those who cannot fight, my lord? The women and children?", 
      "Get them into the caves."
   ], 
   [
      "Get them into the caves.", 
      "Saruman's arm will have grown long  indeed if he thinks he can reach us  here."
   ], 
   [
      "INT. HELM’S DEEP HALL - DAY  ANGLE ON: THÉODEN sits on his throne with GAMLING at his side. The door sounds and they turn to it.  ANGLE ON: ARAGORN throws open the doors an stands before them.  LATER...  ANGLE ON: THÉODEN, taking in ARAGORN’S story.              THÉODEN turns to ARAGORN, incredulous.            CLOSE ON: THÉODEN attempts to fathom ARAGORN’S bombshell. He shows real fear.  CLOSE ON: ARAGORN grimly completes the bad news.     ANGLE ON: THÉODEN turns away slowly, considering. Finally, he walks resolutely from the hall.", 
      "A great host, you say?"
   ], 
   [
      "All Isengard is emptied", 
      "How many?"
   ], 
   [
      "Ten thousand strong at least.", 
      "Ten thousand?"
   ], 
   [
      "EXT. HELM’S DEEP BATTLEMENTS - DAY  ANGLE ON: THÉODEN and GAMLING walk down the stairs followed by ARAGORN, LEGOLAS, and GIMLI.        He dismisses GAMLING. He, ARAGORN, LEGOLAS, and GIMLI continue on to stand just outside the main gate.  WIDE ON: THÉODEN stands outside the gate on the stone pathway leading into HELM’S DEEP. He addresses his plan.        GIMLI stands bored against the gate.     THÉODEN turns to GIMLI, almost surprised to hear from him.       THÉODEN stands tall before GIMLI.      THÉODEN walks back into the KEEP.  CLOSE ON: ARAGORN and LEGOLAS walk past GIMLI, who appears to have been put off.", 
      "I want every man and strong lad able to bear arms to be ready for battle by nightfall."
   ], 
   [
      "I want every man and strong lad able to bear arms to be ready for battle by nightfall.", 
      "We will cover the causeway and the gate from above. No army has ever breached the Deeping Wall or set foot inside the Hornburg!"
   ], 
   [
      "This is no rabble of mindless Orcs.", 
      "I have fought many wars, Master Dwarf.  I know how to defend my own Keep."
   ], 
   [
      "EXT. HELM’S DEEP BATTLEMENTS - DAY  WIDE ON: THÉODEN leads ARAGORN, LEGOLAS, and GIMLI across the battlements of HELM’S DEEP, overlooking the expansive plains.          ANGLE ON: ARAGORN follows THÉODEN closely.        ANGLE ON: THÉODEN turns quickly to ARAGORN and draws him close.       ANGLE ON: ARAGORN looks away ashamed.       THÉODEN walks away. ARAGORN pleads with THÉODEN.      THÉODEN turns back ARAGORN, drawing close again.", 
      "They will break upon this fortress like water on rock. Saruman’s hordes will pillage and burn. We’ve seen it before. Crops can be resown; homes rebuilt. Within these walls, we will outlast them."
   ], 
   [
      "They do not come to destroy Rohan’s crops or villages. They come to destroy its people ... down to the last child.", 
      "What would you have me do? Look at my Men. Their courage hangs by a thread."
   ], 
   [
      "Send out riders, my lord. You must call for aid.", 
      "ARAGORN Gondor will answer."
   ], 
   [
      "ARAGORN Gondor will answer.", 
      "Gondor?! Where was Gondor when the Westfold fell? Where was Gondor when  our enemies closed in around us?! Where was Gon--?"
   ], 
   [
      "Gondor?! Where was Gondor when the Westfold fell? Where was Gondor when  our enemies closed in around us?! Where was Gon--?", 
      "No, my Lord Aragorn...we are alone."
   ], 
   [
      "No, my Lord Aragorn...we are alone.", 
      "Get the women and children into the caves."
   ], 
   [
      "We need more time to lay provisions--", 
      "The Ents have not troubled about the wars of Men and wizards for a very long time."
   ], 
   [
      "My lord?", 
      "Who am I, Gamling?"
   ], 
   [
      "You are our king, sire.", 
      "Your men, my lord, will follow you to whatever end."
   ], 
   [
      "Your men, my lord, will follow you to whatever end.", 
      "To whatever end..."
   ], 
   [
      "To whatever end...", 
      "Where is the horse and the rider? Where is the horn that was blowing?"
   ], 
   [
      "Where is the horse and the rider? Where is the horn that was blowing?", 
      "They have passed like rain on the  mountains."
   ], 
   [
      "They have passed like rain on the  mountains.", 
      "Like wind in the meadow."
   ], 
   [
      "Like wind in the meadow.", 
      "The days have gone down in the west..."
   ], 
   [
      "The days have gone down in the west...", 
      "...into Shadow."
   ], 
   [
      "...into Shadow.", 
      "How did it come to this?"
   ], 
   [
      "Open the gate!", 
      "How is this possible?"
   ], 
   [
      "Na fennas!", 
      "Is this it? Is this all you can conjure, Saruman?"
   ], 
   [
      "Dago hon! Dago hon!", 
      "Brace the Gate!"
   ], 
   [
      "There won't be a Shire, Pippin.", 
      "Aragorn! Fall back to the Keep! Get your Men out of there!"
   ], 
   [
      "BEHIND HIM, AN URUK EMERGES AND BRINGS HIS SWORD DOWN ON HALDIR’S HEAD...HALDIR freezes with a shocked look on his face...  SLOW MOTION ANGLE ON: ARAGORN, on the ground, sees HALDIR FALLING...HALDIR falls to his knees, his world spinning around him...ARAGORN fights his way up the steps...HALDIR looks about him...the dead bodies of his kinsmen lie all around him...he falls to the ground just as ARAGORN catches him...his head falls into ARAGORN’S arm...eyes lifeless and unseeing...  ANGLE ON: ARAGORN gives HALDIR a silent farewell...seeing a group of approaching URUK-HAI, like a madman, ARAGORN leaps aboard the nearest ladder and rides it into the sea of URUK-HAI below.  EXT. HELM’S DEEP GATE - NIGHT  The GATE smashes under the onslaught of the BATTERING RAM. A SOLDIER is impaled on the RAM’S JAGGED END.  ANGLES ON: The SOLDIERS and URUKS exchange arrow fire.  ANGLE ON: THÉODEN draws his sword.      They depart for battle.  ANGLE ON: ARAGORN fights against the URUK-HAI on the ground and makes his way up a steep outside stairway into the KEEP.  INT. HELM’S DEEP GATE - NIGHT  THÉODEN and his SOLDIERS work desperately to hold the gate against impossible odds.  An URUK starts to get the better of GAMLING, but THÉODEN  rescues him. Seizing this advantage, another URUK stabs THÉODEN in the shoulder with his lance. Wounded but undeterred, THÉODEN returns the blow, but more lethally.   He falls into GAMLING’S arms. GAMLING quickly pulls him out of the area.", 
      "To the gate. Draw your swords!"
   ], 
   [
      "Make way for the king!", 
      "Hold them!"
   ], 
   [
      "How long do you need?", 
      "As long as you can give me."
   ], 
   [
      "THÉODEN Shore up the door!", 
      "Gimli! Aragorn! Get out of there!"
   ], 
   [
      "ARAGORN!", 
      "Pull back! Pull back!"
   ], 
   [
      "Take cover!", 
      "The fortress is taken. It is over."
   ], 
   [
      "Tell the women and children to make for the mountain pass. And barricade  the entrance.", 
      "So much death. What can Men do against such reckless hate?"
   ], 
   [
      "Ride out and meet them.", 
      "For death and glory."
   ], 
   [
      "The sun is rising.", 
      "Yes. Yes. The horn of Helm Hammerhand shall sound in the deep one last time!"
   ], 
   [
      "Yes!", 
      "Let this be the hour when we draw swords together."
   ], 
   [
      "Let this be the hour when we draw swords together.", 
      "Fell deeds awake...now for wrath...now for ruin and a red dawn!"
   ], 
   [
      "Rohirrim!", 
      "Éomer."
   ], 
   [
      "How could the world go back to the way it was when so much bad had happened?", 
      "Victory! We have victory!"
   ]
]
 }