{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "Merry.", 
      "Hello, Pip."
   ], 
   [
      "You’re hurt.", 
      "I’m fine. It was just an act."
   ], 
   [
      "I’m fine. It was just an act.", 
      "See? I fooled you too."
   ], 
   [
      "See? I fooled you too.", 
      "Don’t worry about me, Pippin."
   ], 
   [
      "Merry! Merry!", 
      "I think we might have made a mistake leaving the Shire, Pippin."
   ], 
   [
      "What’s making that noise?", 
      "It’s the trees."
   ], 
   [
      "What?", 
      "Do you remember the Old Forest, on the borders of Buckland? Folk used to say there was something in the water that made the trees grow tall...and come alive."
   ], 
   [
      "Squeal. No one’s gonna save you now.", 
      "CUT TO:"
   ], 
   [
      "The belt!", 
      "Run!"
   ], 
   [
      "Come here!", 
      "Trees. Climb a tree."
   ], 
   [
      "Tree? I am no tree! I am an Ent.", 
      "A tree-herder. A shepherd of the forest."
   ], 
   [
      "Side? I am on nobody’s side because nobody’s on my side, little Orc. Nobody cares for the woods anymore.", 
      "Hobbits? Never heard of a Hobbit before. Sounds like Orc mischief to me!"
   ], 
   [
      "The White Wizard?", 
      "Saruman."
   ], 
   [
      "Is it much further?", 
      "Bru-ra-hroom. Don’t be hasty. You might call it far, perhaps. My home lies deep in the forest near the roots of the mountain. I told Gandalf I would keep you safe. And safe is where I’ll keep you. I believe you will enjoy this next one too. It’s one of my own compositions. Right."
   ], 
   [
      "Good Sméagol always helps.", 
      "Treebeard?  Where’s he gone?"
   ], 
   [
      "Treebeard?  Where’s he gone?", 
      "I had the loveliest dream last  night. There was this large barrel,  full of pipe-weed. And we smoked  all of it. And then...you were sick."
   ], 
   [
      "I’d give anything for a whiff of Old Toby.", 
      "There it is again. Something’s not  right here. Not right at all."
   ], 
   [
      "There it is again. Something’s not  right here. Not right at all.", 
      "You just said something ... Treeish."
   ], 
   [
      "You just said something ... Treeish.", 
      "You’re taller."
   ], 
   [
      "Who?", 
      "Than what?"
   ], 
   [
      "Than what?", 
      "Than me!"
   ], 
   [
      "I’ve always been taller than you.", 
      "Pippin, everyone knows I’m the  tall one. You’re the short one."
   ], 
   [
      "Merry! No, Treebeard said that you  shouldn’t have any.", 
      "I want some!"
   ], 
   [
      "Give me it back. Merry!", 
      "It’s got my leg!"
   ], 
   [
      "Bru-ra-hroom. There have been no Entings  for a terrible long count of years.", 
      "Why is that?"
   ], 
   [
      "Oh, I’m sorry. How did they die?", 
      "Can’t say that I have. You, Pip?"
   ], 
   [
      "There is always smoke rising from Isengard these days.", 
      "Isengard?"
   ], 
   [
      "What is it?", 
      "CUT TO:"
   ], 
   [
      "But now, something is about to happen that has not happened for an age ... Entmoot.", 
      "What’s that?"
   ], 
   [
      "'Tis a gathering.", 
      "A gathering of what?"
   ], 
   [
      "EXT. FANGORN FOREST, ENTMOOT - NIGHT  HIGH WIDE AERIAL OVER the treetops to the location of the ENTMOOT. The ENTS move and groan.  ANGLE ON: PIPPIN rests against a root...MERRY paces impatiently.     PIPPIN stands and walks over to him.      TREEBEARD turns to them and shakes his head.     Slowly, TREEBEARD turns to the HOBBITS.      TREEBEARD turns back to the ENTMOOT.  ANGLE ON: MERRY looks on in frustration.      ANGLE ON: TREEBEARD slowly turns to MERRY again.        TREEBEARD seems to ignore him and turns back to the ENTMOOT.", 
      "It’s been going for hours."
   ], 
   [
      "We only just finished saying...good morning.", 
      "Don’t be hasty."
   ], 
   [
      "Don’t be hasty.", 
      "We’re running out of time!"
   ], 
   [
      "Well, that’s good news.", 
      "And what about Saruman? Have you come  to a decision about him?"
   ], 
   [
      "Now don’t be hasty, Master Meriadoc.", 
      "Hasty? Our friends are out there. They need our help. They cannot fight this war on their own."
   ], 
   [
      "The Ents cannot hold back this storm.  We must weather such things as we have always done.", 
      "How can that be your decision?!"
   ], 
   [
      "How can that be your decision?!", 
      "But you're part of this world!"
   ], 
   [
      "But you're part of this world!", 
      "Aren’t you?!"
   ], 
   [
      "Aren’t you?!", 
      "You are young and brave, Master Merry. But your part in this tale is over. Go back to your home."
   ], 
   [
      "Maybe Treebeard’s right. We don’t belong here, Merry. It's too big for  us. What can we do in the end? We've  got the Shire. Maybe we should go  home.", 
      "The fires of Isengard will spread And the woods of Tuckborough and Buckland will burn. And..."
   ], 
   [
      "The fires of Isengard will spread And the woods of Tuckborough and Buckland will burn. And...", 
      "...and all that was once green and good in this world will be gone."
   ], 
   [
      "...and all that was once green and good in this world will be gone.", 
      "There won't be a Shire, Pippin."
   ], 
   [
      "South it is then. Hold on, little Shirelings.", 
      "Are you mad? We’ll be caught."
   ], 
   [
      "Look! The trees! They’re moving!", 
      "Where are they going?"
   ], 
   [
      "My business is with Isengard tonight... with rock and stone.", 
      "Yes!"
   ], 
   [
      "To the king!", 
      "Pippin! Hold on!"
   ], 
   [
      "Oh, yes, it’s a quality establishment. I hear the staff are very good.", 
      "Nothing. The world’s back to normal, that’s all."
   ], 
   [
      "No, it isn’t. I’m starving.", 
      "Good luck trying to find something decent to eat around here. Probably dead rats and moldy bread."
   ], 
   [
      "Good luck trying to find something decent to eat around here. Probably dead rats and moldy bread.", 
      "Saruman’s storeroom!"
   ], 
   [
      "I don’t believe it.", 
      "It can’t be."
   ], 
   [
      "It can’t be.", 
      "It is!"
   ], 
   [
      "Longbottom Leaf.", 
      "The finest pipe-weed in South Farthing."
   ], 
   [
      "Wait. Do you think we should share it  with Treebeard?", 
      "Share it?  No. No. Dead plant and all that. Don’t  think he’d understand."
   ], 
   [
      "Share it?  No. No. Dead plant and all that. Don’t  think he’d understand.", 
      "Could be a distant relative."
   ], 
   [
      "I get it. Don’t be hasty.", 
      "Exactly.  Bah-hrum."
   ]
]
 }