{ "lines" :  
[
   [
      "Are you sure you can afford it?", 
      "Definitely!"
   ], 
   [
      "Aaron serves dinner to Daphne and DAPHNE’S PARENTS.", 
      "More Italian tofu and chianti pasta?"
   ], 
   [
      "***", 
      "**"
   ], 
   [
      "Well, that is exciting.", 
      "Thanks, Mrs. Binks.  It is thrilling."
   ], 
   [
      "***", 
      "Intern, not a secretary."
   ], 
   [
      "Intern?  Like Monica Lewinsky?  You gonna be taking out any dry cleaning?  I’m just kidding.", 
      "If you want to get into the music biz you start as an intern."
   ], 
   [
      "You don’t have to be so dismissive of it, dad.", 
      "You should see the sculptures she’s doing.  She’s got some great projects up her sleeve."
   ], 
   [
      "I’m just worried that a creative and an intern living together -- who’s the support beam?  Judging by this neighborhood you’re barely holding on as is.", 
      "First of all, this place is not cheap.  Downtown’s coming back."
   ], 
   [
      "From what?  Armageddon?", 
      "I don’t make much but I make enough for the two of us."
   ], 
   [
      "What happens when you lose your job because the music industry is downsizing because no one buys records anymore?", 
      "I guess I’ll just have to resort to my previous work -- male escort."
   ], 
   [
      "Aaron’s awkwardly sitting in silence with Daphne’s dad in the living room.", 
      "How’s the corporate law these days?"
   ], 
   [
      "It’s a job.  Aaron, I just wanted to say something to you.  I can see how much you care for my daughter.", 
      "I do, sir.  Very much.  Honestly, and I know, I’m young, but I hope to one day marry her."
   ], 
   [
      "Don’t call me sir.", 
      "I called you sir?"
   ], 
   [
      "Yeah.", 
      "I didn’t even notice."
   ], 
   [
      "Well, you did.", 
      "I’m... sorry?"
   ], 
   [
      "I just wanted to tell you that I think you two are making a terrible mistake moving in together.", 
      "What?  Why?"
   ], 
   [
      "You two are not ready at all.", 
      "Yeah we are."
   ], 
   [
      "No you aren’t.", 
      "I believe we are."
   ], 
   [
      "I believe you aren’t.", 
      "I love her."
   ], 
   [
      "No you don’t.", 
      "Yes I do."
   ], 
   [
      "No you don’t.", 
      "I do.  I do love her too."
   ], 
   [
      "You just don’t.", 
      "****"
   ], 
   [
      "You don’t and they aren’t.  You’re not right for her.  She’s a flighty girl.  She needs someone more grounded.", 
      "She’s an amazing sculptor.  It just takes a while to break into the art world."
   ], 
   [
      "I’m not going to debate my daughter’s future with you.  She’s a cute girl who needs to land a rich husband before she pops out a few grand kids and ends up teaching art in an elementary school.", 
      "I think she’s talented."
   ], 
   [
      "The world has too much talent and not enough customers.  Here’s the deal: quit playing house like a little girl.  You’re in the music biz.  Go out, party like a rock star, experiment with drugs, go apeshit crazy so you don’t end up doing it later in life.  Move in with a couple best male friends and live it up.  Now’s the time.", 
      "I already live with my best friend.  Daphne’s my best friend."
   ], 
   [
      "What if my dad’s right?  What if I have no talent?", 
      "First of all, he said you had talent.  He just said there’s not enough customers.  Which there are, by the way.  Forget I mentioned it."
   ], 
   [
      "Maybe this is all just shit shit shit and shit.  I just want to break it all and start over again.", 
      "Are you kidding?  This is so super pretty."
   ], 
   [
      "REVEAL they’re discussing a sculpture of a bloody, screaming woman holding a bloody, screaming baby.  It’s more terrifying than pretty.  She definitely has talent, a dark weird talent.", 
      "Did you use glaze?"
   ], 
   [
      "Yeah.  He’s right.  My career’s going nowhere.  I suck.", 
      "Let’s make a game plan.  Rent a gallery downtown.  Advertise the show in LA Weekly.  Maybe do some guerrilla marketing stuff.  We’ll just get this done."
   ], 
   [
      "The point isn’t the show, Aaron.  It’s not that easy.  Trying to do something creative is just different than what you do.  It’s not a linear process.  No offense.", 
      "You’re not being a bitch."
   ], 
   [
      "I was being a bitch.  You can be mad at me.", 
      "I’m not mad at you."
   ], 
   [
      "I love that you’re nice.  You’re the first nice guy I’ve ever dated and I love that about you.  But when I’m being a bitch and you don’t say I’m being a bitch you’re keeping a part of yourself closed off from me.  Feel free to be honest and tell me when you’re annoyed at me.", 
      "***"
   ], 
   [
      "Daphne smiles at this.", 
      "And as for getting your career off the ground, just make a list of what needs doing.  That’s how I get stuff done."
   ], 
   [
      "You here for a meeting?", 
      "I’m here to start working.  I’m the new intern."
   ], 
   [
      "Aaron pulls back in, big smile on his face.", 
      "Me again.  Couldn’t find parking."
   ], 
   [
      "May I help you?", 
      "**"
   ], 
   [
      "Andrea Laken...", 
      "Whatcha drinking, Andrea?"
   ], 
   [
      "Caramel latte... who are you?", 
      "Well, Andrea, I’m Aaron Greenberg, your future intern."
   ], 
   [
      "So, Mr. Greenberg, who’s your favorite composer?", 
      "I love Amadeus.  So passionate."
   ], 
   [
      "He sees the receptionist.", 
      "Sup, Andrea."
   ], 
   [
      "Where are you going?", 
      "Roma wants his latte.  I know.  You’d think he could get it himself.  Oh, and here’s a caramel latte for you.  Got an extra one.  Whatcha gonna do?"
   ], 
   [
      "What is this?  Who are you?", 
      "Sergio, what is up?"
   ], 
   [
      "Aaron holds out his hand.  Sergio looks at it for an uncomfortably long amount of time.", 
      "I’m Aaron Greenberg, your new A&R guy."
   ], 
   [
      "I’m Aaron Greenberg, your new A&R guy.", 
      "***"
   ], 
   [
      "Columbia Records Vancouver?", 
      "Yeah, we got a small outfit over there.  Nothing like this."
   ], 
   [
      "I don’t remember hiring you.", 
      "Well, you’re a busy guy --"
   ], 
   [
      "Take Aaron.  I always like to chat with my new guys before they start up here.  Who’s your idol?  Like, who do you hope to be in thirty years.", 
      "David Geffen.  He’s the king.  I hope to be him in every way, except, not, you know..."
   ], 
   [
      "What is that?  Lifestyle like how?", 
      "Like I’m not gay."
   ], 
   [
      "I am.", 
      "That’s crazy.  I’m actually gay as well."
   ], 
   [
      "You just said you weren’t.", 
      "I know, I just didn’t know how you’d respond or whatever.  It’s so nice to be working for a fellow gay guy.  Are you out because I’ve read almost everything about you --"
   ], 
   [
      "Don’t you worry about that.  How long have you known you were gay?", 
      "I realized when I was ten or thirteen.  I would play sports with the guys and I realized I didn’t just want to play sports with them.  I wanted to kiss them on the  mouth."
   ], 
   [
      "Oh, yeah.  I remember that.  So are you in a relationship now?", 
      "Not anyone specifically.  I’ll make out with four strangers in a night."
   ], 
   [
      "Not anyone specifically.  I’ll make out with four strangers in a night.", 
      "Like last night I was at this gay bar and I had sex with this guy who looked exactly like Ryan Gosling, probably was him if you know what I mean, and, well, I’ll probably never see him again.  How about you?  What bars do you frequent?"
   ], 
   [
      "I’ve been with the same man for two decades.", 
      "*****"
   ], 
   [
      "Does it look like I give a fuck?", 
      "Honestly no."
   ], 
   [
      "-- Aaron appears in the doorway holding a tray of cookies.", 
      "Anyone up for a homemade cookie?"
   ], 
   [
      "Anyone up for a homemade cookie?", 
      "**"
   ], 
   [
      "Get the fuck out of here.  But leave the cookies.", 
      "OK."
   ], 
   [
      "Aaron walks in.  Daphne watches Grey’s Anatomy with several girlfriends who wave at Aaron.", 
      "You started Grey’s without me!?"
   ], 
   [
      "Aaron and the girls all watch Grey’s together.", 
      "I just don’t think McDreamy is as cool as people think.  He’s hot but he’s not like a great guy."
   ], 
   [
      "Yeah, he is.  He just doesn’t know what he wants.", 
      "See, I disagree with that.  He’s really selfish; it’s just disguised as not knowing what he wants.  I’m sorry, I am just not on the McDreamy train.  Now, Dr. O’Malley.  Hello!"
   ], 
   [
      "Check this out.  It says that the number one sex secret for men is licking his butt.  Isn’t that hilarious?", 
      "Totally."
   ], 
   [
      "You wouldn’t ever want me to do that?", 
      "No.  Of course not."
   ], 
   [
      "They laugh some more.  Awkward pause.  Then Aaron kisses Daphne.", 
      "Good night."
   ], 
   [
      "He’s wanted in Sardinia for attempted manslaughter.  Or at least that’s what I read on gawker.", 
      "**"
   ], 
   [
      "Sergio sits across from Aaron who’s pitching his heart out.", 
      "******"
   ], 
   [
      "**", 
      "Yeah."
   ], 
   [
      "Fully loaded?", 
      "What?  Sure... why?"
   ], 
   [
      "You think I want a fucking car salesman dealing with a rock star?", 
      "Yeah, I think you do."
   ], 
   [
      "My girl has your plane tickets.  I want him here safe and sound two days before the show.  Get him on the plane, get him in the car and get him to his suite at the Four Seasons.  Do not take a detour.  If you so much as stop by the side of the road for a fucking burger I will personally see that your career in the music biz is over.", 
      "He’s a vegetarian."
   ], 
   [
      "It takes people years to get to a place like this.  You’re aware of that, right?", 
      "I’ve been waiting my whole life for this kind of opportunity."
   ], 
   [
      "You have any questions about Mr. Snow?  You sure you can handle him?", 
      "Yes.  It’s my belief that everyone in their heart of hearts is kind."
   ], 
   [
      "What a wonderful notion.  Well, let’s just say that around Aldous Snow’s kind heart is an eternal plane of dark evil shit.", 
      "Understood."
   ], 
   [
      "Aaron runs in.  Daphne is reading a magazine.", 
      "Guess who’s going to hang out with Aldous Snow, baby?"
   ], 
   [
      "What accent is that?", 
      "English."
   ], 
   [
      "Aaron is about to get into the limo.", 
      "Actually, sure."
   ], 
   [
      "Aaron’s in the backseat.  The limo driver’s driving.  There’s at least an acre of space between Aaron and the limo driver.  Aaron’s in heaven.", 
      "So you must pick up lots of famous people?"
   ], 
   [
      "Beat.", 
      "Are these Diet Cokes free?"
   ], 
   [
      "Aaron takes a Diet Coke.  He then takes a glass out of the cabinet and tries to pour it into the glass so as to use all the limo accoutrements.  They hit a pothole and he spills the Diet Coke everywhere.  He looks at the driver who doesn’t seem to have noticed.  He starts to pour again and the driver STOPS SHORT.  He spills the rest of the Coke all over himself.  He gingerly places the cup back into the cupholder.", 
      "You mind if I put the divider up?"
   ], 
   [
      "There is no divider.", 
      "Sweet."
   ], 
   [
      "Aaron sits down in first class.  He can’t believe how nice it is.  A FLIGHT ATTENDANT WALKS BY.", 
      "I’m actually on the clock, Veronica, but... what the hell.  You only live once."
   ], 
   [
      "Aaron stands outside, getting his courage to hit the buzzer.   *He finally HITS it.  A dude OPENS the door.  *", 
      "Sup? I’m Aaron Greenberg with Pinnacle --"
   ], 
   [
      "Aaron walks into the Aldous’s apartment.  Aldous’s hanging out with the a bunch of super cool, English Guys.", 
      "Sup? I’m Aaron Greenberg with Pinnacle --"
   ], 
   [
      "Right.  You’re meant to accompany me on my trip to LA.  Make sure I don’t go all bonkers.", 
      "It’s super lame, I know."
   ], 
   [
      "The guys all laugh.  Then out of the laughter, we here Aaron say...", 
      "Been there."
   ], 
   [
      "You have?  What happened?", 
      "I just used to really do the junk like all the time.  Like everyday."
   ], 
   [
      "I just used to really do the junk like all the time.  Like everyday.", 
      "I used to smoke it.  And eat it.  I used to eat junk with a spoon."
   ], 
   [
      "Specifically.", 
      "One time I was on the road, teen tour, and me and my junk buddies -- we were like super into junk at the time.  Like you know that movie Trainspotting?"
   ], 
   [
      "They all nod.", 
      "We were like that.  Well we ran out of junk so we stole a car, like a Porsche style car, and we went down to Mehico to buy more junk and the border guy said “you guys got heroin in your car!”  And I swear at that moment I became a man."
   ], 
   [
      "How’d you respond?  When the border guard said that?", 
      "“No I don’t have heroin in my car!”  But we did.  We had a lot of junk in the car.  Every one of us did."
   ], 
   [
      "That is something.", 
      "It was something.  It was."
   ], 
   [
      "Lena hugs Aldous and kisses him on the lips.  She then hugs *Aaron and Aaron awkwardly and accidentally kisses Lena on the  *lips.  No one seems to notice.  Aaron leans into the car.*", 
      "Heathrow, British Airways terminal."
   ], 
   [
      "Who are you?", 
      "Aaron Greenberg from Pinnacle --"
   ], 
   [
      "Where are you going?  Aren’t you going to sit back here with me?  I’ll be lonely without you.", 
      "Oh, yeah.  Of course."
   ], 
   [
      "Captain Knob’s a good one.  But that Abby’s got him all turned around.", 
      "Totally.  It’s like..."
   ], 
   [
      "I’m glad they sent me someone who’s experienced.  With the controlled substances.", 
      "Too often non drug addicted people just don’t understand, like at all."
   ], 
   [
      "I’ve been a little busy.  Putting the finishing touches on my new album.", 
      "You recording your new album?"
   ], 
   [
      "Not yet at the recording stage.  Still conceptualizationing.  But like in my brain, it’s like done, you know?  How long have you been working at Pinnacle?", 
      "**"
   ], 
   [
      "*", 
      "Yeah."
   ], 
   [
      "So, how long you’ve been with her?", 
      "Three years."
   ], 
   [
      "You live with her?", 
      "*"
   ], 
   [
      "Has it been easy?  Hard?", 
      "***"
   ], 
   [
      "*", 
      "Well there are certainly challenges."
   ], 
   [
      "Do you get along with her parents?", 
      "Her dad can be a challenge, but I think he respects me and what I’m about."
   ], 
   [
      "If I listened to what my dad said, I’d be all messed up in my head.", 
      "Are you in touch with him these days?  I mean, you don’t have to say --"
   ], 
   [
      "What’s your type?  Like your perfect woman?", 
      "My girlfriend."
   ], 
   [
      "Besides her, like if it couldn’t be her.  Like if she died or left you or something.", 
      "Like a doctor.  I really think doctors are super cool."
   ], 
   [
      "Looks?", 
      "Well I guess blond and petite except for around here."
   ], 
   [
      "Around her tits?  Or including her tits?", 
      "Including them.  But this is a really theoretical proposition --"
   ], 
   [
      "Parents married or divorced?", 
      "Divorced.  You sure are inquisitive.  It’s like you’re collecting evidence!"
   ], 
   [
      "That’s a shame.  Who’s fault?", 
      "Everyone’s!  So, why perform now?"
   ], 
   [
      "Funny, right?  My life, it’s humorous.  I like you.  Do you like me?", 
      "*"
   ], 
   [
      "You won’t ever betray me?", 
      "Dude, I am like the most trustworthy guy ever."
   ], 
   [
      "Aaron’s on his cell phone.  SPLIT SCREEN with Sergio who runs  **on a treadmill incredibly fast without sweating or even really breathing hard.*", 
      "We’re in line at Heathrow and are about to get on the flight.  He actually seems pretty together and cool."
   ], 
   [
      "Aldous and Aaron are standing in line.  Aaron is talking and smiling while Aldous is starting to look a bit uneasy.", 
      "I can’t believe I was only in London for like four hours.  I so want to come back for like a real amount of time.  It seems like a really neat city."
   ], 
   [
      "Shove this up your bum.", 
      "What?  Why’re you whispering, buddy?  You got a secret?"
   ], 
   [
      "Stop acting all mental and let me shove this heroin up your ass already.  I thought you used to run heroin all the time.", 
      "I did, it’s just been like eight years so I’m not exactly..."
   ], 
   [
      "Is it up there?", 
      "Yes."
   ], 
   [
      "No part of it is sticking out of your anal cavity?", 
      "No.  Definitely not.  Do these things burst?"
   ], 
   [
      "You’re welcome.  Well all cleaned up now.  No vomiting anymore.", 
      "What’s up?  It must be crazy doing security.  You must have a lot of stories."
   ], 
   [
      "I guess I have a few.", 
      "I mean, are you like always suspicious of every single person you see?"
   ], 
   [
      "Not really.  Most people are good blokes.", 
      "Cause I’d be all the time thinking like that “guy over there has a bomb” or “that women over there has a bunch of drugs in her purse and a bomb.”  Cause I think that anyway and I’m not even in your line of work.  Anyway, good to meet you."
   ], 
   [
      "Aaron and Aldous sit in the first class club.  Aldous is leafing through NME magazine.  Aaron’s trying not to hyperventilate.", 
      "Morally I probably shouldn’t be doing this."
   ], 
   [
      "Morally you should.", 
      "You’re supposed to be clean.  I’m an enabler.  I’m enabling right now."
   ], 
   [
      "A year before you quit you pick a quit date.  If I quit before my quit date my whole AA plan goes out the window.", 
      "I thought when you quit you just quit."
   ], 
   [
      "If I don’t do heroin this week I’ll jump the gun on my quit date, which I picked over a year aqo and have been mentally preparing for ever since, then my inability to quit once and for all will be on your conscience.  Do you want that on your conscience?", 
      "No.  This thing is going to burst.  I feel it’s already burst."
   ], 
   [
      "If it had burst you’d know.  Believe me.", 
      "What’s that supposed to mean?"
   ], 
   [
      "Drink it down.", 
      "No."
   ], 
   [
      "Drink it down.  It’ll help loosen the sphincter.  Ironically a loose sphincter aids anal control.", 
      "Oh, cool, that’s really interesting."
   ], 
   [
      "Aldous grabs the drink and brings it up to Aaron’s lips.  Aaron drinks it down.", 
      "I’m just going to see if our flight’s on time."
   ], 
   [
      "Aaron’s at the desk, talking to the female Club Attendant.", 
      "I just wanted to confirm that flight 51 to LA is on time."
   ], 
   [
      "Aldous tosses a bundle of cash on the table.", 
      "I don’t think we should do that necessarily.  We’re supposed to head to LA.  You know, for your big performance at the Greek.  That’s why we’re here."
   ], 
   [
      "Hello, again, Mr. Greenberg.  Did you enjoy your stay in London?", 
      "Yes."
   ], 
   [
      "Baby you shouldn’t have!  You’re only away for one night!", 
      "Didn’t want anyone stealing you away."
   ], 
   [
      "Aaron decides whether to lie.", 
      "Great.  Really great."
   ], 
   [
      "What’s Aldous like?", 
      "Super cool.  Like couldn’t be a better guy."
   ], 
   [
      "Really?  Cause from afar he seems like he’d be totally crazy.", 
      "No.  Not crazy at all.  Really mellow and cool actually."
   ], 
   [
      "No.  Not crazy at all.  Really mellow and cool actually.", 
      "Funnily enough, turns out we’re going to New York instead of LA first so I’m probably not going to be home for another night."
   ], 
   [
      "That sucks.  Why the change?", 
      "Totally planned.  Turns out he needs to do some press stuff in New York first."
   ], 
   [
      "You really have no stories?  He didn’t say or do anything funny?", 
      "Nope.  Pretty straight laced, good guy."
   ], 
   [
      "You’re using your lying voice.", 
      "I’d be lying if I said anything interesting happened."
   ], 
   [
      "I don’t want to find out he’s been making you do crazy stuff like smuggling a bong on the plane and you’ve been too scared to tell me.", 
      "That’s hilarious.  I love you and your hilarity."
   ], 
   [
      "Aldous pulls out an adrenaline needle.", 
      "Like from Pulp Fiction?"
   ], 
   [
      "No.  Like from life.  Got it?", 
      "Yeah, sure."
   ], 
   [
      "The Fasten Seat Belt Light flips off.", 
      "I’ve gotta go to the bathroom."
   ], 
   [
      "You are not taking a shit.", 
      "I have to go like right now."
   ], 
   [
      "The seatbelt sign BINGS off.", 
      "***"
   ], 
   [
      "Guess who just had a little bit of sex with the flight attendant?", 
      "Oh.  Awes."
   ], 
   [
      "What’s going on in there, friend?", 
      "Nothing."
   ], 
   [
      "You better not be taking a shit.  That’s my property.", 
      "I’m aware.  I’m not.  Just doing number one."
   ], 
   [
      "Aaron opens the door.", 
      "Everything’s fine."
   ], 
   [
      "Prove it to me.", 
      "I can’t prove it to you without expelling it."
   ], 
   [
      "So...", 
      "So I’m not going to do that right now.  Perhaps when we land and you need it."
   ], 
   [
      "It was wrong of me to make you stash it up your bum.  That was not right.", 
      "At the very least you should have warned me before we were in the security line."
   ], 
   [
      "I understand why you expelled it.  It’s scary having that much dope so close to one’s intestinal track.", 
      "Thank you for understanding."
   ], 
   [
      "Aldous starts digging around in the toilet.", 
      "I wouldn’t do that.  Seriously, let’s just go back to our seats.  I’m sure we can figure this out once we get to New York.  They have H in New York, right?  Please, Aldous --"
   ], 
   [
      "Get in there!", 
      "I’m afraid!  I heard that this woman was sitting on the toilet and hit the flusher and it sucked out her intestines!  I do not want that to happen to me."
   ], 
   [
      "Aldous HITS the flusher and Aaron’s hand gets sucked and stuck partially in the toilet.", 
      "AHHHH!!!"
   ], 
   [
      "AHHHH!!!", 
      "It’s stuck!  My hand’s stuck!  Why’d you do that?!?!"
   ], 
   [
      "Take a breath!  You’re healthy!  I’m healthy!  We’re both alive and excited to be alive!  Now what do you feel?", 
      "I don’t know."
   ], 
   [
      "I don’t know.", 
      "I feel some metal.  And something slimy.  And...and... I feel a balloon!  I feel the balloon!"
   ], 
   [
      "This is fantastic!  Are you fingers around it?", 
      "Almost... yes!"
   ], 
   [
      "Almost... yes!", 
      "I can’t, it’s stuck!"
   ], 
   [
      "Aldous grabs Aaron’s arm and YANKS IT out of the toilet.", 
      "AHHHHH!"
   ], 
   [
      "Against all odds, you did it!  I’m proud of you.", 
      "Thanks.  Thank you."
   ], 
   [
      "Aldous hugs Aaron.", 
      "Here’s your property."
   ], 
   [
      "It’s a photo Aldous took of him having sex with the flight attendant.", 
      "You just did that?"
   ], 
   [
      "Aaron and Aldous get in the car.", 
      "Manny’s Guitar shop, at --"
   ], 
   [
      "Actually, Four Seasons, midtown.", 
      "We shouldn’t stay over in New York."
   ], 
   [
      "Aaron’s on his cell while washing the drug balloon.", 
      "Two first class one ways from New York to LA.  Whatever airline leaves first.  I don’t care."
   ], 
   [
      "His phone beeps.  Aaron looks at it.  Shit.  SPLIT SCREEN with Sergio who’s having brunch in a beautiful outdoor cafe with ten FASHIONABLE, WEALTHY-SEEMING GUYS.", 
      "One sec.  I got a call on the other line."
   ], 
   [
      "Where are you?  The car service is at LAX and there’s no you.", 
      "Our plane got grounded."
   ], 
   [
      "No, it didn’t.", 
      "If it didn’t then how am I still sitting in Heathrow?"
   ], 
   [
      "Then why does the computer say that it landed in LA and why did my driver see an entire plane load of people from your flight getting their bags?", 
      "**"
   ], 
   [
      "What’s the flight number?", 
      "Flight 543 --"
   ], 
   [
      "What was that?", 
      "Heathrow police."
   ], 
   [
      "I’m not happy about this.", 
      "And neither am I."
   ], 
   [
      "That’ll be 4123.53 per ticket.", 
      "Alrighty then.  It’s a Mastercard."
   ], 
   [
      "Aaron, look, a lot of people would have walked away then.  I think a stronger person would stay through this.  And that person is you.", 
      "I’m fine, Aldous.  This is really par for the course for me.  I had to do a very similar thing when I assisted Mylie Cyrus at the Kids Choice Awards.  She’s not allowed soda and I got her some.  Not up my butt, but same difference really."
   ], 
   [
      "Daphne is very lucky.  Does Daphne know how lucky she is?", 
      "I don’t know."
   ], 
   [
      "I think she does.  Look, after putting you through what I just put you through, I don’t think I could ever do anything that bad again.  I don’t like myself when I’m like that.  But the drugs take hold and well, you know the story.", 
      "Totally.  Story as old as time.  Why don’t you just quit today and give the story a happy ending?  Carpe Deum, know what I mean."
   ], 
   [
      "And well you might ask.  And well you might ask.  I feel the fates brought us together.  I see myself when I was your age.", 
      "Really?  Thank you."
   ], 
   [
      "Aldous heads into the room.  Aaron looks out at the view.  It’s a pretty amazing view.  He smiles again.  This is rock star living no matter if you had to have a balloon of heroin up your ass to achieve it.  He sees the balloon on the table.  He touches it.  He holds it in his hand and squeezes it.  He squeezes it again.  He starts absentmindedly squeezing it like a stress ball while looking out at the view.", 
      "New York City."
   ], 
   [
      "Suddenly POP.  Powder heroin everywhere.", 
      "Oh, boy."
   ], 
   [
      "Aaron stands, panicked.  He looks up and sees a napkin inside.  He runs inside and runs back out with the napkin.  A flock of pigeons descend and start eating the heroin.", 
      "No!  Shoo!  No!  Don’t eat that!  You do not want to eat that!"
   ], 
   [
      "Aaron and Aldous are in a car service in a particularly seedy section of New York.  A group of homeless men are talking around a garbage can.", 
      "I am willing to pay you for the H, but I am not a drug buying guy.  Besides, we should really get to Manny’s and then get to LA --"
   ], 
   [
      "Money don’t mean nothing to me.  Just things.  And drugs.", 
      "If you want it, why don’t you buy it?"
   ], 
   [
      "Because I’m famous.  I could get in trouble for this shit.  Now go out there and make pappa proud.", 
      "You shouldn’t be doing this stuff."
   ], 
   [
      "Too many to count.", 
      "I was lying before.  I’ve never bought or sold heroin.  I’ve never even seen it until now."
   ], 
   [
      "I was lying before.  I’ve never bought or sold heroin.  I’ve never even seen it until now.", 
      "Really."
   ], 
   [
      "You think I give a shit what kind of heroin buying experience you have?  Oh, I only want a lad who majored in drug purchasing at Oxford buying my drugs.", 
      "I’m not trying to eff off --"
   ], 
   [
      "I guess that’s why Daphne’s dad hates you.  And right he should.", 
      "Firstly, he doesn’t hate me --"
   ], 
   [
      "But I know your type.  You are a vampire, sucking the life out of others so that you can live.", 
      "I’m not a vampire.  I’m a good guy.   It’s all my fault, it really is, everything that’s happened, but buying illegal drugs is --"
   ], 
   [
      "Aaron walks towards the trash can.  He turns to see the limo drive away, Aldous giving him a thumbs up.  Aaron joins the group of guys around the garbage can.", 
      "*"
   ], 
   [
      "The Homeless Guy walks away.", 
      "Alright, that’s cool."
   ], 
   [
      "You looking for a package?", 
      "Maybe.  Who’s asking?"
   ], 
   [
      "What the fuck, man?  Do you want to buy some heroin or not?", 
      "Yes."
   ], 
   [
      "Toss your thousand in the garbage can.  Go down that alley.  A man will meet you down there.", 
      "Toss my money down there?  I’ve got a better idea, why don’t I just give you my ATM code?  My social security number?"
   ], 
   [
      "Toss my money down there?  I’ve got a better idea, why don’t I just give you my ATM code?  My social security number?", 
      "Since there’s so much trust flowing back and forth, I’ll give you a go with my girlfriend.  You know, while we’re at it."
   ], 
   [
      "The Scumbag wanders away.  Aaron looks around and then tosses the cash in the garbage can.  He looks at the alley.", 
      "Mother effer."
   ], 
   [
      "Hey, baby.  What’s going on?", 
      "I just wanted to tell you, sweetie, how much I love you.  Like love love you."
   ], 
   [
      "Me too.", 
      "No, like, I love love you."
   ], 
   [
      "I love love you too.  Are you crying?  Cause you crying is going to make me cry.", 
      "What if I never saw you again?  I don’t know what I’d do with myself."
   ], 
   [
      "It’s so good to hear you open up and be emotional.  So often I feel like the needy one in our relationship.", 
      "You’re not needy -- you’re perfect.  Where are you anyway?"
   ], 
   [
      "You’re not needy -- you’re perfect.  Where are you anyway?", 
      "I love the Banana Republic.  I love you forever."
   ], 
   [
      "He gets to the end of the alley.  Suddenly the same Scumbag comes out of the shadows.  He’s dressed slightly differently.", 
      "Gotta go."
   ], 
   [
      "You Aaron?", 
      "We just met, ese."
   ], 
   [
      "You don’t know me, bitch.  Do you know me?", 
      "No.  Not at all.  Except from five minutes ago, ese."
   ], 
   [
      "He holds his hand out.  Aaron shakes it.", 
      "Aaron."
   ], 
   [
      "*", 
      "*"
   ], 
   [
      "What you pay?", 
      "I got a two bedroom, one bath, 2500 a month."
   ], 
   [
      "I pay twice that for a studio that looks out at a ventilator shaft.  Good location though.  I gotta move to LA.  I have this screenplay idea about the drug war but it’s from the like POV of the drug guy on the street, you know?  But the drug guy has these like X-men powers and shit.  I’d tell you more but you might steal the idea and then I’d have to fucking kill you.", 
      "Totally.  So we doing this or what?  Cause time unlike money doesn’t grow on trees."
   ], 
   [
      "Gritty opens his mouth and points to the package which is in his mouth.", 
      "What?  Just hand it to me like a man, ese."
   ], 
   [
      "There are cops everywhere.  Open your mouth up to receive the package.", 
      "I’m not doing that."
   ], 
   [
      "I was harsh, but that’s because life is challenging and this is one of those challenges.", 
      "It’s fine.  I got it done.  That’s what I do.  I get things done and this is one of those things."
   ], 
   [
      "Or rather it’s for your great love, Daphne.", 
      "Is this real diamond?  Cause if it is this is not necessary at all.  This is probably the most expensive thing I own."
   ], 
   [
      "Aldous leaves.  Aaron looks at the diamonds.", 
      "Wow."
   ], 
   [
      "Give me five minutes, mate.  Just five.  Five alive.", 
      "Of course."
   ], 
   [
      "The Reaper hasn’t got me yet.  This is my best American friend, Aaron Greenberg.", 
      "Good to meet you."
   ], 
   [
      "Aaron pulls Aldous out of the shop.  The limo pulls up.  The Limo Driver gets out and Aldous jumps in.  Phil comes out.", 
      "I just want you to know that Aldous feels terrible about what he’s done."
   ], 
   [
      "Course we are, man.", 
      "We’re just figuring out the damage.  Bill."
   ], 
   [
      "That guy’s a dick, he’s always been a dick.", 
      "I’m superbummed you got caught up in this whole thing."
   ], 
   [
      "Phil PUNCHES Aaron in the face.", 
      "Why do that, man?"
   ], 
   [
      "Great seeing you, Aldous.  And nice meeting you, Aaron.", 
      "The pleasure was all mine."
   ], 
   [
      "I don’t think I could even do anything that bad again.", 
      "Hey, you know what, you’ve gotta go through your artistic process."
   ], 
   [
      "When the worst possible thing has already happened, it could not possibly get worse and therefore it’ll just be an uphill trajectory from here on out.", 
      "Whatever, it’s fine, man.  Really."
   ], 
   [
      "Do you ever curse?  Because now is a moment where you are well within your rights to curse.", 
      "Sure I do."
   ], 
   [
      "Say the word fuck.", 
      "Like in what context?"
   ], 
   [
      "Like, shut the fuck up.", 
      "Shut the fuck up."
   ], 
   [
      "And calm the fuck down you crazy motherfucking fucker.", 
      "Why?  Why bother saying that really, you know?  Like why?"
   ], 
   [
      "Cause I want you to.  Say it.  Say it, puppet, say it.", 
      "I’m not your motherfucker puppet.  OK?  Fuck fuck?  Fuck fuck fucking motherfucker?"
   ], 
   [
      "**", 
      "That’s my lady.  And those are my parents."
   ], 
   [
      "You in touch with them still?", 
      "Yeah.  We’re really close actually."
   ], 
   [
      "Must be nice to have that.", 
      "It’s not bad.  You seem to have a great relationship with your mom."
   ], 
   [
      "I do.  My pop’s another story.", 
      "You never speak to him?  Like ever?"
   ], 
   [
      "Nah.  I hate that man.  He wrote an unauthorized biography about his own son.  Who does that?  I’ve come to terms with the fact that I’m never gonna see that bastard again.", 
      "Cool.  Do you even know where he lives?"
   ], 
   [
      "Beat.   Aaron considers and then jumps in.", 
      "I don’t want to get involved, everyone’s different, but the day before my boobie died I went to see her instead of going to this secret Death Cab for Cutie concert I had sweet tickets to."
   ], 
   [
      "I don’t want to get involved, everyone’s different, but the day before my boobie died I went to see her instead of going to this secret Death Cab for Cutie concert I had sweet tickets to.", 
      "*****"
   ], 
   [
      "*****", 
      "It’s Jew for Grandma."
   ], 
   [
      "That’s a beautiful story, mate.  You have such a kind, old soul.", 
      "I’ve been told that.  All I’m saying is it’s never too late to make amends."
   ], 
   [
      "Aldous RIPS THEM in half.", 
      "Hey, man.  You can use mine."
   ], 
   [
      "Aaron and Aldous are in a limo.  Aaron’s pissed.", 
      "What the fuck were you thinking?"
   ], 
   [
      "I like that.  It’s amusing, you cursing.  It’s like watching a nun do anal.", 
      "Why would you do this?"
   ], 
   [
      "My father is dying.  Cancer.  Pancreatic.  He’s had it for a year.  The doctors give him three to six months.", 
      "I’m sorry, man.  That’s awful.  But we can’t stay here."
   ], 
   [
      "What if he died tomorrow and I didn’t see him because of some concert?  It’s like if you had never gotten to see your boobie that one last time?", 
      "That was just a like a once in a million years coincidence.  He’s not going to die tomorrow."
   ], 
   [
      "You don’t know that.", 
      "And if he does, his energy is still going to rejoin the big overall energy field of everything so it doesn’t matter if you see him."
   ], 
   [
      "What should I say to him when I see him?  I am a whirligig of emotions.", 
      "I don’t know, tell him the way you really feel.  Be honest and open.  And brief.   Incredibly brief."
   ], 
   [
      "Except when it comes to the female persuasion.  Then you’re a proper carnivore.  So if you’re not going to gamble or go to a steakhouse, what do you gents feel like doing this evening?  You feel like a having proper night out?", 
      "No."
   ], 
   [
      "Jonathan, Aldous and Aaron have front row seats at a magic show.  The three of them are drinking giant fruity drinks while they watch.  The Magician throws a handkerchief in the air and it turns into birds.", 
      "Holy moly!  That did not happen!"
   ], 
   [
      "I have a gun.", 
      "Oh.  Cool."
   ], 
   [
      "I actually had Jet but Jet has seniority so I went with Katherine because I’ve always liked Katherine the Great.", 
      "Because she had sex with horses?"
   ], 
   [
      "What’s your name?", 
      "*"
   ], 
   [
      "Why aren’t you at the Greek doing sound checks?", 
      "We just got to the Four Seasons in Los Angeles.  Just settling in."
   ], 
   [
      "Sergio hangs up.", 
      "Fuck."
   ], 
   [
      "Four Seasons.", 
      "Hi, this is Aaron Greenberg with Aldous Snow.  He stays under the name Queen Victoria.  I know this is weird because we’re not there, but could you please check us in?"
   ], 
   [
      "***", 
      "*"
   ], 
   [
      "Hi, baby.  When do you get in?", 
      "We’re actually in Vegas.  More press stuff."
   ], 
   [
      "ANGLE BACK ON AARON:", 
      "We went to a magic show and now we’re at like a nightclub."
   ], 
   [
      "A group of naked strippers walk by Aaron, really close.", 
      "Like a cool nightclub.  It’s called --"
   ], 
   [
      "Aaron looks up to see the sign above the bar.  It’s called “The Wet Pussy Lounge.”", 
      "-- The Lounge.  Palms Casino.  I don’t know why it’s not on the website.  Maybe because it’s next door.  Is everything OK?"
   ], 
   [
      "**", 
      "Well, I’m sure it looks beautiful."
   ], 
   [
      "It does and that’s the problem.", 
      "Oh.  OK."
   ], 
   [
      "I’m downstairs.  Where are you?", 
      "Aldous just went to sleep.  He’s feeling sick."
   ], 
   [
      "Then why does it sound like you’re in the meatpacking district?", 
      "Hardcore techno’s the only thing he can sleep to.  He’d rather rest up.  Thinks it’d be better than rehearsing."
   ], 
   [
      "Come down here.  I want to see your beautiful face.", 
      "He wanted me to keep him company."
   ], 
   [
      "Oy, Aaron!  We’re getting AIDS rubbed all over our pants!  No offense, Katherine!", 
      "*"
   ], 
   [
      "Aldous hands the phone back to a stunned Aaron.", 
      "Hello?"
   ], 
   [
      "Hello?  Hello?  Hello?  Aaron?", 
      "I’m here.  I’m here.  Sorry.  Just a weird connection.  Battery’s on its way out."
   ], 
   [
      "Aaron walks outside with the phone.  A second later a girl  comes out.  She’s petite, blonde and busty -- exactly Aaron’s ideal.", 
      "I’m sure your piece is much better than you think it is."
   ], 
   [
      "But if I think it’s bad then in my reality it is simply bad and isn’t that the only thing that counts?", 
      "I don’t know -- Uh, my battery’s dying,"
   ], 
   [
      "Krissy makes eyes at Aaron.", 
      "And me you."
   ], 
   [
      "Aaron hangs up.", 
      "No, sorry.  Don’t smoke."
   ], 
   [
      "I shouldn’t.  What’re you doing out here if you don’t smoke?", 
      "Waiting for my friend and his father to stop getting lapdances.  My friend’s father is dying apparently and this is what they want to do together I guess."
   ], 
   [
      "You not into the lapdance thing?", 
      "No offense, but no."
   ], 
   [
      "I’m not into it either.  I’m not a stripper.  But thanks.", 
      "Sure thing."
   ], 
   [
      "Aaron snorts a tiny amount of coke.", 
      "Well that was super fun."
   ], 
   [
      "They are both pretty drunk and coked up.", 
      "It’s just like my girlfriend and I are like totally right for each other but sometimes I wonder if we are in fact right for each other because even though we never fight she can make things complicated that don’t seem that complicated to me and she always says that I’m her first nice boyfriend, like I’m missing testicles or something but she’s also so great and completes my life even if I am scared of being honest with her about those things I just told you.  So, what do you do for a living?"
   ], 
   [
      "Krissy puts her hand on his.  Aaron stares at it.", 
      "I’ll be right back."
   ], 
   [
      "That was something else.  She’s a dirty, dirty bird.  Want a hit?", 
      "What is that?"
   ], 
   [
      "Why aren’t you with your lady?", 
      "I have a girlfriend who I’m going to marry."
   ], 
   [
      "If you have a girlfriend you’re going to marry then this is the only time you’ll be able to do this in good conscience.  Once you’re married you can’t have sex with a random girl in a Vegas hotel suite.  But now you can.", 
      "But I shouldn’t.  And besides I don’t want to either at all.  She’s a hot doctor.  I didn’t think they existed!"
   ], 
   [
      "You’ve got to get it out of your system.  Otherwise it’s going to emerge like a noxious shit bubble years from now when you have a little baby daughter.  Do you want to break your baby daughter’s heart?", 
      "No.  I don’t."
   ], 
   [
      "Woh.  What is that?", 
      "Something called the Jeffrey."
   ], 
   [
      "Man you are a hot.  You look like Dennis Quaid.", 
      "*"
   ], 
   [
      "Krissy tears off Aaron’s pants.", 
      "Woh!  I’m not sure about this --"
   ], 
   [
      "Krissy removes her shirt and puts Aaron’s hands on her boobs.", 
      "Wow... these are really... hard."
   ], 
   [
      "She goes down on Aaron.  We can’t tell what she’s doing.", 
      "What is that?  What are you doing?  I’m not sure but I think I love what is currently happening to me.  Why can’t I stop narrating what is happening to me while it’s happening --"
   ], 
   [
      "Aaron BUSTS into the room.", 
      "You tricked me into having sex with a hooker!"
   ], 
   [
      "Not a trick!  A gift!", 
      "Well let me just say that I did not complete the sex!  So there!  I am high and I am not enjoying this sensation!  My heart is going like crazy!"
   ], 
   [
      "You’re just nervous that you screwed that girl.  Normal stress coming out.", 
      "I didn’t cheat on her!  I didn’t even put it in!  It just kind of circled the area!  My heart literally won’t stop pounding!"
   ], 
   [
      "Aldous takes out his camera phone and takes a photo of Aaron.  Aaron spazzily takes a drag off the joint.", 
      "I’m totally having a heart attack!"
   ], 
   [
      "Well then I wouldn’t suck on that.", 
      "Why?  It’s just a joint."
   ], 
   [
      "No, it’s a Jeffrey.", 
      "Wait... what’s in this thing?"
   ], 
   [
      "A layer of pot.  Then a layer of opium.  Then some crack.  And a little bit o meth.  And the rolling paper’s been dipped in acid.  Oh, and there also might be some angel dust.  Not sure.", 
      "Why the fuck is it called Jeffrey?"
   ], 
   [
      "Cause who could be scared of Jeffrey?  Jeffrey’s just a nice bloke from down the road.", 
      "I am having a heart attack."
   ], 
   [
      "Aldous PUNCHES his dad.  Aldous and his Dad get into a vicious fist fight.", 
      "Woh!  Woh!  Stop it!  That man is sick."
   ], 
   [
      "Aaron gets in the middle.  Jonathan PUNCHES Aaron in the head.  Aaron crazily starts scratching Jonathan’s face up.", 
      "Ah!  Ah!  Ah!"
   ], 
   [
      "Aldous starts laughing.  Jonathan starts laughing.", 
      "I think my heart just stopped."
   ], 
   [
      "Aaron looks at it and starts to calm down.  Aldous SNORTS IT.", 
      "Ah!  Why would you do that?"
   ], 
   [
      "To distract you.  And impress you.", 
      "My heart’s definitely stopped."
   ], 
   [
      "Aaron shakily stands.  They walk into the suite to see Aldous’s dad passed out on the floor without pants.  Or underpants.", 
      "Should we wake him up so you can say goodbye?"
   ], 
   [
      "Aaron and Aldous are in the backseat of the car in early morning silence.  After a long beat...", 
      "Your dad doesn’t have pancreatic cancer, does he?"
   ], 
   [
      "It’s in remission.", 
      "No it isn’t.  I don’t care."
   ], 
   [
      "You’re right.  I lied.  Like the way you lied about doing drugs.", 
      "It’s actually gotten a lot stronger recently.  The THC levels are like way higher than when our parents smoked it... you’re right.  It’s not drugs."
   ], 
   [
      "I don’t understand you.  Why’d you stop having sex with that girl?  She was proper smoking.", 
      "Because of my girlfriend."
   ], 
   [
      "I just don’t get that.", 
      "What’s there to get?"
   ], 
   [
      "Why are you in a relationship?  What is the advantage of it?", 
      "I don’t like choosing stuff, like where I have to go to dinner.  Or my clothes.  I like that my outfits get laid out for me.  I wake up every morning and my shirt is picked out for me, my jeans are picked out for me, it’s nice."
   ], 
   [
      "You’re fascinating.  What do you do?  Like at night?", 
      "I don’t know.  I watch TV.  Like Grey’s Anatomy."
   ], 
   [
      "Is that with that guy, McDreamy?", 
      "Yeah."
   ], 
   [
      "I know him.  I fucked him.", 
      "No way."
   ], 
   [
      "*", 
      "Last year my family and Daphne’s family had dinner and went to see Capote.  How about you?  What’d you do for your birthday?"
   ], 
   [
      "Me and about ninety-five people went to Richard Branson’s private island and had an ecstasy party and then went out in a hot air balloon.", 
      "I’m not going to lie.  Your life seems awesome."
   ], 
   [
      "But it’s missing love, Aaron.  Don’t you see?  I want love the way you have love.  Without love, I’m gonna become that bastard we just spent twelve hours with.  I want a lady to pick out my clothes.  And not just an assistant who I pay.", 
      "Is there a specific someone?"
   ], 
   [
      "We have a kid together, you know.  I haven’t seen the tyke in years.  Beautiful child.", 
      "That’s amazing, man.  That’s the reason we’re here on Earth."
   ], 
   [
      "It is, isn’t it?  I even pay his child support but I don’t mind cause I love him so much.  And her too.", 
      "Why’d it end?"
   ], 
   [
      "I don’t know.  I just don’t.  I want her back.  She lives in LA and I want to see her and get her back.  But I don’t know what to do.  Like when I first see her, what do I do?", 
      "Just be honest and tell her how you feel.  A good relationship, if that’s what you want, is all about honesty.  The one thing is and I don’t want to get into this if it doesn’t matter, but isn’t she... engaged... to Paul Allen?"
   ], 
   [
      "I’m just joshing with you, man.  I’m jealous.", 
      "Oh, you."
   ], 
   [
      "*", 
      "I’m fine.  I’m just going to get some shut eye."
   ], 
   [
      "CHYRON: LOS ANGELES, CALIFORNIA.  TWELVE HOURS UNTIL THE GREEK.", 
      "So if you need anything please call.  Otherwise I’ll be seeing you tomorrow late afternoon pre-concert."
   ], 
   [
      "This is how we leave it?  With you being so cold, just icing me out.", 
      "Not being icy, just protective of my life."
   ], 
   [
      "Not being icy, just protective of my life.", 
      "You have my contact information.  If you need me you know how to reach me."
   ], 
   [
      "Speak.", 
      "Aaron Greenberg.  Aldous Snow has been delivered to his hotel."
   ], 
   [
      "You’re really going to hold my hand all the way through dinner?", 
      "I didn’t even notice."
   ], 
   [
      "So this is where you live?", 
      "What are you doing here?  You’re supposed to be at the Greek."
   ], 
   [
      "I need you with me.", 
      "If you need me I can totally go to wherever you are."
   ], 
   [
      "But I also hate it.  It looks the way my insides feel, all fucked up and tossed around.  It’s like nausea in three dimensions.", 
      "I don’t know about --"
   ], 
   [
      "**", 
      "You want me to drive you to some LA hot spots?  I can take you to the Standard, the Chateau --"
   ], 
   [
      "The presidential suite at the Buenos Aires Ritz is the nicest hotel room I’ve ever been to.", 
      "Yeah, we were staying in a hostel."
   ], 
   [
      "I am astonished and fascinated at your longevity as a couple.", 
      "It’s only been three years."
   ], 
   [
      "What do you do when you’re in a relationship for that long.  Like, how do you keep it lively?", 
      "It’s easy because we love each other."
   ], 
   [
      "On what?/Sometimes.", 
      "On what?"
   ], 
   [
      "Like if you could have done one sexual activity before you died what would have been?", 
      "What, like a threesome?"
   ], 
   [
      "Sure like that.", 
      "I guess a threesome."
   ], 
   [
      "Threesome.  Do you have any fantasies like that?", 
      "I was just joking."
   ], 
   [
      "Well that is something that is possible right now.  It’s not like wanting to fly or shoot lasers out of your eyes.  A threesome is something that we can accomplish right here right now.", 
      "That would be hilarious, us having a threesome."
   ], 
   [
      "C’mon, let’s do a threesome.  Wouldn’t that be fun?", 
      "I was speaking completely theoretically.  I’m not actually sure whether we should really be having a threesome in reality."
   ], 
   [
      "You just said it’s something that you’d like to try.", 
      "Well, I mean, it is."
   ], 
   [
      "I mean, unless you’re scared.", 
      "I’m not scared.  I was just worried that you might be scared.  I didn’t want to press you into anything."
   ], 
   [
      "You aren’t.", 
      "If you’re not scared."
   ], 
   [
      "I’m not scared.", 
      "Then neither am I."
   ], 
   [
      "Aldous, Aaron and Daphne are awkwardly sitting on the bed.", 
      "So... how do we start this?  Because if we can’t, we don’t need to --"
   ], 
   [
      "PAN FROM Aldous having crazy amazing sex with Daphne to Aaron sitting on the bed looking not really all that happy.", 
      "So... I’m... gonna get some water."
   ], 
   [
      "I am going to ejaculate!", 
      "This is bullshit."
   ], 
   [
      "Aaron rushes back into the bathroom.  Aldous is somehow having sex with Daphne’s face.  Or at least that’s what we have to assume.  All the drive drops out of Aaron.", 
      "Hey, guys.  Where do you want me to put your water?"
   ], 
   [
      "Aldous pulls out and ejaculates.  We don’t see it.  We just see Aaron’s face change.", 
      "What the fuck?"
   ], 
   [
      "What’s the problem?", 
      "You got it on me, man!"
   ], 
   [
      "I am starving.  I understand there’s a delicious diner around the corner.  You interested, mate?", 
      "Nahhh, I’m good, mate.  I think I’d rather stay here then watch you eat pancakes after you’ve had sex with every part of my girlfriend and then jizzed on my leg now GET THE FUCK OUT OF HERE RIGHT NOW!"
   ], 
   [
      "Hey, Aaron, let’s talk about this!", 
      "I don’t want to talk about this while he’s here!  And once he’s not here this is nothing we can talk about!  This cannot be solved through discussion!  This is you cheating, right in front of me!"
   ], 
   [
      "I thought you were cool with the whole threesome thing.", 
      "That wasn’t a threesome!  That was a twosome with me watching!"
   ], 
   [
      "You could have jumped in.  We weren’t being exclusionary.  That’s against the rules.", 
      "This isn’t about rules or not rules!  This is about you fucking her right in front of me!  And why are you in this conversation?  Why are you even here?"
   ], 
   [
      "I’m sorry, Aaron, I didn’t mean for this happen.", 
      "You were the one who said you’d be into a threesome!"
   ], 
   [
      "After you said it!  If you didn’t want to, why weren’t you honest about that?  I would’ve said no if you didn’t want to do it.", 
      "I shouldn’t have to say anything to get you to not have sex with another man!"
   ], 
   [
      "Sexual mores are just a thing of the past century.  We are all living in a false construct.", 
      "GET OUT!"
   ], 
   [
      "Aldous leaves again.", 
      "How could this happen?  Our life was just going along at a great, awesome clip.  Why?"
   ], 
   [
      "Daphne and Aaron both start to tear up.", 
      "I want you to hug me even though you were having sex with a different guy like two minutes ago.  What is wrong with me?"
   ], 
   [
      "Daphne and Aaron hug.", 
      "Why am I letting you do this?  Get away from me, you... you... whore."
   ], 
   [
      "I forgot my satchel.", 
      "You’re jealous of my piddly life so you destroy it."
   ], 
   [
      "Woh.  Alright, mate.  Let’s just hand them over.", 
      "Congrats.  Destruction complete."
   ], 
   [
      "You’ve been throwing them.", 
      "Yeah, but that one was in you.  Now I’ve got whatever blood diseases you’ve got."
   ], 
   [
      "Don’t you get it!  I’m done!  The only person that ever loved me hates me!  I’m done making music!  I’m done!  I might as well go kill myself!", 
      "Fine!  Go ahead, you big baby!  Kill yourself!  You just fucked my girlfriend and then she dumped me!  I don’t give a shit what you do!  And make sure to swallow all the pills!  If you swallow only half you just get sleepy!  Better yet, shoot yourself, but make sure to do it in the head!  That way you’ll have the best shot at actually succeeding in killing yourself!"
   ], 
   [
      "I’m sorry if I’ve been a disappointment.  I hope to one day make it up to you.", 
      "Get out!"
   ], 
   [
      "Aaron takes a beat.", 
      "Fuck him."
   ], 
   [
      "Aaron throws out the note.  He looks at a clock on the wall.  It’s 7:00PM.", 
      "No, fuck him."
   ], 
   [
      "It’s 8:00PM and now for your traffic update.", 
      "Fuck him."
   ], 
   [
      "Aaron’s at Denny’s.  He orders a coffee.  He looks at his watch.  It’s 8:30PM.", 
      "Fuck him."
   ], 
   [
      "The waitress comes over.", 
      "Are the corn pancakes good?"
   ], 
   [
      "MOMENTS LATER Aaron waits for his food.  He checks his watch.  It’s now 8:35.", 
      "Fuck him."
   ], 
   [
      "The Waitress returns with the corn pancakes, eggs and bacon.", 
      "*"
   ], 
   [
      "Aaron looks at his watch.  It’s now 8:36.", 
      "Fuck him."
   ], 
   [
      "MOMENTS LATER: Aaron’s reading LA Weekly.  He looks at his watch.  It’s now 8:37.", 
      "Fuck him."
   ], 
   [
      "His cell rings.  Aaron jumps.  He looks and sees that it says “Daphne.”  He hits it to voicemail.  He reads the paper and sees an ad for Aldous Snow at the Greek.  He looks at his watch again.  It’s still 8:37.", 
      "Fuck him."
   ], 
   [
      "Aaron is driving really fast.", 
      "Fuck him fuck him fuck him fuck him fuck him fuck him --"
   ], 
   [
      "MOMENT WHERE Aaron is pulled to the side of the road, very laboriously putting in “Hollywood Sign” in his point of interest in his GPS device.", 
      "Fuck him fuck him fuck him... Hollywood Tire... Hollywood Dog Track... Hollywood Sheepskin... what the fuck?  Why doesn’t it just have the Hollywood sign?"
   ], 
   [
      "The people on the tour bus laugh.", 
      "Excuse me, where’s the Hollywood sign?"
   ], 
   [
      "I’m sorry, you’ll have to pay for the tour to learn that information --", 
      "I said where’s the fucking Hollywood sign?  I will ram my car into your bus if you don’t tell me right the fuck now!"
   ], 
   [
      "Aaron pulls up in his car.  The clock on his car reads 8:57PM.", 
      "Fuck him fuck him fuck him fuck him fuck him fuck him!"
   ], 
   [
      "Aaron jumps out of his car.", 
      "Fuck him fuck him fuck him fuck him fuck him fuck him fuck him --"
   ], 
   [
      "Aaron scrambles down the desert hill.  He reaches a barbed wire fence and tries to climb over it, getting caught in the barbed wire.  He jumps down from the fence.", 
      "Fuck him fuck him fuck him fuck him --"
   ], 
   [
      "Aaron is now down at the Hollywood sign.  He sees Aldous standing on top of the “H.”", 
      "Hey asshole, don’t jump!"
   ], 
   [
      "Why not?  I’ve got nothing.  I’m a drug addicted nothing.  My friends are all addicts or yes men.  I can’t even write music anymore.  I’m not even sure if I even ever could.  Most of my songs are just ripoffs of the Beatles and the Clash.  I’m the nugget of shit that hangs off the asshair of humanity.", 
      "No you aren’t.  You can have sex with whoever you want whenever you want."
   ], 
   [
      "All I live for is getting high.  If I don’t die from this I’ll die from an overdose.  At least if I jump I’m making the choice, not the drink and the drugs.", 
      "Jumping’s for pussies.  Jumping is what you do out of fear.  You really going to be a pussy?  You really going to throw away the one thing God has given us, life, for nothing?"
   ], 
   [
      "I didn’t know you were religious.", 
      "I didn’t know it either until right now but I think I am and I think what you’re doing is downright immoral.  In my one week with you I’ve seen more of the world then I have in my entire twenty three years.  Don’t throw it all away man.  Life is precious.  Don’t just toss it away like a used needle.  Instead, take that needle and shoot up life instead."
   ], 
   [
      "Why’re you doing this?  Do you love me?", 
      "*"
   ], 
   [
      "Tell me you love me.", 
      "I love you in the way one is required to love all humanity."
   ], 
   [
      "Beat.  Aldous moves to the edge of the “H.”", 
      "I love you... and you specifically not just the general concept of humanity.  I love you, Aldous Snow.  I love you."
   ], 
   [
      "Aldous, taking an intentional Christ like pose, JUMPS off the “H” and hits the dusty desert below with a resounding and sickening thud.  He rolls down the hill.", 
      "Fuck you!"
   ], 
   [
      "-- into a Hills house backyard, splashing right into a hot tub.  Aaron jumps down and sees Aldous floating in the hot tub.", 
      "Fuck you, man!  Fuck you!"
   ], 
   [
      "Aaron jumps into the hot tub and flips Aldous over.", 
      "Aldous?  Aldy?  Aldous?  Mr. Snow?"
   ], 
   [
      "He pokes the body.  No movement.  He starts performing CPR on Aldous, gingerly breathing into Aldous’s mouth and pumping his chest.  Soon his CPR gets more and more vigorous.", 
      "Fuck!  You!  Fuck!  You!  You!  Are!  A!  Dick!  I!  Hope!  This!  Doesn’t!  Work!  Why!  Do!  I!  Have!  Mor!  Als!"
   ], 
   [
      "I’m alive.  I’m alive!  I can’t believe I’m alive!  You saved me, Aaron.  I can’t believe you came and saved me.", 
      "I only came because I didn’t want your death on conscience.  I thought that maybe I’d go to jail if I didn’t show up."
   ], 
   [
      "I have completely changed as a result of the love you’ve given me by saving me.", 
      "As soon as you see a girl with big tits or a pound of hashish it’ll start all over again."
   ], 
   [
      "I look at you, Aaron, and I see pure love.   You are the most beautiful person I have ever met.", 
      "I’m an enabler who is probably responsible for the fact that you have learned nothing and will be smoking crack within the next fifteen minutes."
   ], 
   [
      "I am going to prove you wrong.  That’s how I feel about you.  Because we are going to be best friends forever.", 
      "I won’t because you fucked my girlfriend and screwed me out of my job."
   ], 
   [
      "We can still make it.", 
      "It’s over, man.  The show was supposed to start almost three hours ago."
   ], 
   [
      "Aaron’s frantically driving Aldous.", 
      "Are you sure we shouldn’t go to the emergency room?"
   ], 
   [
      "Aldous opens up his manpurse and downs a bunch of pain pills.", 
      "That’s the quickest trip to hypocrisy maybe in history."
   ], 
   [
      "There is literally no way I can save your job right now without fourteen Vicodin.  My bone is sticking out here.  Touch it.  That’s bone.", 
      "Please stop referencing your bone."
   ], 
   [
      "Aaron and a limping Aldous head backstage.  The crowd is booing and partying.  Sergio heads towards them.", 
      "He jumped off the Hollywood sign and broke his arm.  Also I’m not gay.  Fire me now.  Just be done with it."
   ], 
   [
      "*", 
      "I’m not an intern.  I’m from Columbia Vancouver --"
   ], 
   [
      "***", 
      "***"
   ], 
   [
      "Sergio stares him down.", 
      "I will happily take it."
   ], 
   [
      "It’s awesome.  The crowd goes crazy.  Aldous begins jumping up and down and then PASSES OUT on the stage.  In a moment of odd enthusiasm, Aaron grabs the microphone and motions for the band to start playing.  Aaron continues the song.", 
      "My love explodes all over the Earth!  My loves explodes across the universe!"
   ], 
   [
      "The crowd BOOS.", 
      "Well fuck you all too!"
   ], 
   [
      "What the hell time is it?", 
      "Five a.m.  Is Daphne here?"
   ], 
   [
      "I don’t think she wants to see you.", 
      "Respectfully, sir, I don’t care what you think."
   ], 
   [
      "Aaron heads into the Great Room.", 
      "Daphne!  Daphne!"
   ], 
   [
      "Aaron?  What’re you doing here?", 
      "I’m sorry I called you a whore."
   ], 
   [
      "I deserved it.", 
      "No one deserves to be called a whore.  Not even an actual whore.  I want to get back together."
   ], 
   [
      "I do too.  Desperately.", 
      "But only if you promise never to have sex with another man in front of me."
   ], 
   [
      "I won’t.", 
      "And one other thing, I do understand what it takes to be a creative type.  And when you say I don't it's condescending and bitchy and I don’t like it at all and rather than whining about whether your sculptures will or won’t sell or whether people will or won’t like them you should just get a fucking gallery and show them already."
   ], 
   [
      "-- and kisses him.", 
      "While I was watching him there was nothing he was doing that I couldn’t physically do -- except for that one thing on the floor.  I just wouldn’t have the courage to ask you."
   ], 
   [
      "You don’t have to do every thing Aldous did.  But maybe one of the twelve things.", 
      "Great.  So let’s go do this --"
   ], 
   [
      "I can’t do it now.  I have some kind of infection down there.  I hate that fucking guy.  It stings so bad.", 
      "I’m so sorry, baby."
   ], 
   [
      "Awww.", 
      "So when should we do this?"
   ], 
   [
      "I can have sex again in three weeks.", 
      "Three weeks is a long time from now.  It’ll give me time to prepare mentally."
   ], 
   [
      "A nervous looking Aaron looks at something.", 
      "You sure you’re OK with this?"
   ], 
   [
      "REVEAL Daphne is tied up.", 
      "And you promise you won’t be thinking of Aldous while we’re doing it?"
   ], 
   [
      "I’m just incredibly grounded these days.  Eight months clean.", 
      "That’s really great.  I’m impressed.  And it’s so great to see that you’ve reconnected with your son."
   ], 
   [
      "At least he’s not on crack.", 
      "This is better than crack?"
   ]
]
 }