{ "lines" :  
[
   [
      "Aaron walks in.  SERGIO ROMA, the charismatic terrifying president of Pinnacle, is on the phone.  He never yells.  Yelling is beneath him.", 
      "I am not the who gets fucked.  I am the one who does the fucking.  You see what I’m saying?  Ciao."
   ], 
   [
      "He hangs up.", 
      "What is this?  Who are you?"
   ], 
   [
      "***", 
      "Columbia Records Vancouver?"
   ], 
   [
      "Yeah, we got a small outfit over there.  Nothing like this.", 
      "I don’t remember hiring you."
   ], 
   [
      "Well, you’re a busy guy --", 
      "I remember everything."
   ], 
   [
      "He HITS a button.", 
      "Andrea, baby!"
   ], 
   [
      "Andrea POKES HER HEAD IN.", 
      "Did I hire this guy from Columbia Records Vancouver?"
   ], 
   [
      "Yeah.  But it was a while ago.", 
      "Alright, baby.  Go now, go."
   ], 
   [
      "She leaves.", 
      "Take Aaron.  I always like to chat with my new guys before they start up here.  Who’s your idol?  Like, who do you hope to be in thirty years."
   ], 
   [
      "David Geffen.  He’s the king.  I hope to be him in every way, except, not, you know...", 
      "Not what?"
   ], 
   [
      "Not what?", 
      "What is that?  Lifestyle like how?"
   ], 
   [
      "Like I’m not gay.", 
      "I am."
   ], 
   [
      "That’s crazy.  I’m actually gay as well.", 
      "You just said you weren’t."
   ], 
   [
      "I know, I just didn’t know how you’d respond or whatever.  It’s so nice to be working for a fellow gay guy.  Are you out because I’ve read almost everything about you --", 
      "Don’t you worry about that.  How long have you known you were gay?"
   ], 
   [
      "I realized when I was ten or thirteen.  I would play sports with the guys and I realized I didn’t just want to play sports with them.  I wanted to kiss them on the  mouth.", 
      "Oh, yeah.  I remember that.  So are you in a relationship now?"
   ], 
   [
      "Like last night I was at this gay bar and I had sex with this guy who looked exactly like Ryan Gosling, probably was him if you know what I mean, and, well, I’ll probably never see him again.  How about you?  What bars do you frequent?", 
      "I’ve been with the same man for two decades."
   ], 
   [
      "*****", 
      "Does it look like I give a fuck?"
   ], 
   [
      "**", 
      "Get the fuck out of here.  But leave the cookies."
   ], 
   [
      "Aaron LEAVES the cookies.  Sergio takes a bite of cookie.", 
      "That’s a good fucking cookie."
   ], 
   [
      "It’s Aldous Snow on line two.", 
      "Aldous Snow?  If this is one of those pranks shows I will destroy you."
   ], 
   [
      "Sergio takes a deep breath and grabs the phone.  SPLIT SCREEN.  Aldous is shirtless in bed.  He looks like death warmed over.  However, he has put on a super fake super happy positive voice.", 
      "*"
   ], 
   [
      "Top notch.", 
      "Sorry to hear about Jackie Q.  I know Paul Allen.  If it’s any consolation, he’s a real weirdo."
   ], 
   [
      "Oh, please.  I wish her all the best.  She has a kind, old soul.", 
      "I don’t want to push you, baby.  But I think it might be time for you get back out there, put that sexiness of yours back on stage."
   ], 
   [
      "I’m ready to perform.", 
      "Seriously?"
   ], 
   [
      "I want to perform.  At the Greek Theater.  In Los Angeles.  Be a dear and throw that together for me, will you?", 
      "Course, baby.  It was done yesterday."
   ], 
   [
      "Sergio meets with Pinnacle’s Lawyer.", 
      "A show at the Greek will net us a couple mil.  But down the line, this kickstarts a tour and suddenly we’re swimming in cash.  His last tour, Snow Ball 2004, grossed a hundred thirty eight mil."
   ], 
   [
      "A show at the Greek will net us a couple mil.  But down the line, this kickstarts a tour and suddenly we’re swimming in cash.  His last tour, Snow Ball 2004, grossed a hundred thirty eight mil.", 
      "Aldous’s first tour in three years -- the merchandising alone is worth hundreds of millions."
   ], 
   [
      "The question is whether he’ll show.  He hasn’t performed in three years.  He didn’t show at his last eight performances.  We end up holding the bag if he bails.", 
      "Fucking snotnosed teenagers are stealing all our shit online.  Any fuck nut can record some shit poor album on his iMac.  We’re racking up debt like a crack whore in Vegas.  We need Snow shaking his ass on the Greek stage if you want to have a job next year.  I don’t give a fuck if this place implodes.  I got villas in Rio, Tahiti, Madrid, Goa and who knows where else.  I don’t ever remember all of them.  But you want to have cash for your kids fancy pussy private school?  Then we need to make this happen."
   ], 
   [
      "The insurance company will bond him if you send a rep to accompany him to LA.  How’d he sound on the phone?", 
      "Good actually.  Different even."
   ], 
   [
      "I have a family, Sergio.  This guy could literally murder me.", 
      "**"
   ], 
   [
      "******", 
      "**"
   ], 
   [
      "Yeah.", 
      "Fully loaded?"
   ], 
   [
      "What?  Sure... why?", 
      "You think I want a fucking car salesman dealing with a rock star?"
   ], 
   [
      "Beat.  Sergio smiles at Aaron’s balls.", 
      "My girl has your plane tickets.  I want him here safe and sound two days before the show.  Get him on the plane, get him in the car and get him to his suite at the Four Seasons.  Do not take a detour.  If you so much as stop by the side of the road for a fucking burger I will personally see that your career in the music biz is over."
   ], 
   [
      "He’s a vegetarian.", 
      "It takes people years to get to a place like this.  You’re aware of that, right?"
   ], 
   [
      "I’ve been waiting my whole life for this kind of opportunity.", 
      "You have any questions about Mr. Snow?  You sure you can handle him?"
   ], 
   [
      "Yes.  It’s my belief that everyone in their heart of hearts is kind.", 
      "What a wonderful notion.  Well, let’s just say that around Aldous Snow’s kind heart is an eternal plane of dark evil shit."
   ], 
   [
      "We’re in line at Heathrow and are about to get on the flight.  He actually seems pretty together and cool.", 
      "Turn your back at your own peril.  Call me the millisecond you land."
   ], 
   [
      "One sec.  I got a call on the other line.", 
      "Where are you?  The car service is at LAX and there’s no you."
   ], 
   [
      "Our plane got grounded.", 
      "No, it didn’t."
   ], 
   [
      "If it didn’t then how am I still sitting in Heathrow?", 
      "Then why does the computer say that it landed in LA and why did my driver see an entire plane load of people from your flight getting their bags?"
   ], 
   [
      "**", 
      "What’s the flight number?"
   ], 
   [
      "Aaron mumbles the rest.  We hear a NYC siren go by in the BG.", 
      "What was that?"
   ], 
   [
      "Heathrow police.", 
      "I’m not happy about this."
   ], 
   [
      "And neither am I.", 
      "Don’t do that."
   ], 
   [
      "Aldous and his dad start laughing hard at Aaron.  Aaron gets a call.  It’s Sergio.  SPLIT SCREEN with Sergio in his convertible Bentley.  He’s stopped at a cross walk.  Some pedestrians walk by and accidentally brush against his car.", 
      "Why aren’t you at the Greek doing sound checks?"
   ], 
   [
      "We just got to the Four Seasons in Los Angeles.  Just settling in.", 
      "I’ll meet you there in twenty minutes."
   ], 
   [
      "They both breathe.  Aaron’s phone beeps.  He looks at it.  Four Seasons.  Aaron silently flips over to the other side.  TRIPLE SCREEN between Aaron, Sergio in the lobby of the Four Seasons, and Daphne breathing.", 
      "I’m downstairs.  Where are you?"
   ], 
   [
      "Aldous just went to sleep.  He’s feeling sick.", 
      "Then why does it sound like you’re in the meatpacking district?"
   ], 
   [
      "Hardcore techno’s the only thing he can sleep to.  He’d rather rest up.  Thinks it’d be better than rehearsing.", 
      "Come down here.  I want to see your beautiful face."
   ], 
   [
      "He wanted me to keep him company.", 
      "Aw, how cute.  Wake the baby up and put him on the phone.  Right now."
   ], 
   [
      "Aldous grabs the phone and hits the unmute button.", 
      "Hey, Aldous.  It’s Sergio.  I understand you’re not feeling well --"
   ], 
   [
      "Hello?", 
      "You made me drive to the Four Seasons for no fucking reason.  Don’t do that again."
   ], 
   [
      "Sergio is doing pilates like a master.  He answers the phone.", 
      "Speak."
   ], 
   [
      "She starts to cry and hangs up.  The phone rings again.  He lets it go to answering machine.", 
      "Where the fuck are you guys?  He was supposed to be here --"
   ], 
   [
      "He jumped off the Hollywood sign and broke his arm.  Also I’m not gay.  Fire me now.  Just be done with it.", 
      "*"
   ], 
   [
      "The crowd cheers.", 
      "*"
   ], 
   [
      "I’m not an intern.  I’m from Columbia Vancouver --", 
      "***"
   ]
]
 }