{ "lines" :  
[
   [
      "We hear the VOICE of Aldous Snow , English rock star, drugged out of his mind, in his empty apartment.  Floor to *ceiling windows look out on beautiful views of the Thames and  *the London cityscape.  We PAN PAST a leather couch, a pile of  *trash, an Andy Warhol on the floor, various drug paraphernalia.", 
      "You enjoying this?"
   ], 
   [
      "REVEAL Aldous on the floor kissing a PROSTITUTE-LIKE WOMAN.", 
      "How about this?"
   ], 
   [
      "I like that alright... what the bloody shit?", 
      "How about this?"
   ], 
   [
      "The Prostitute KICKS Aldous.  Aldous laughs as she leaves.", 
      "You are welcome, milady!"
   ], 
   [
      "You best not be coming back here.  I don’t care how famous you are.", 
      "We should have killed all you Irish when we had the chance."
   ], 
   [
      "The Irish Guy GRABS Aldous.  Aldous licks the Irish guy’s face.  The Irish Guy drops him, disgusted.", 
      "*"
   ], 
   [
      "YOU FUCKED ME OVER YOU PIECE OF SHIT!!!", 
      "I’M NOT THE ONE WHO FUCKED YOU OVER!!!  YOU’RE THE ONE WHO FUCKED ME OVER!!!"
   ], 
   [
      "FUCK YOU YOU FUCK FUCK FUCK!!!", 
      "THEN GET OUT OF HERE ALREADY YOU FUCKING BLOODY HELL BITCH!"
   ], 
   [
      "His door flies open.  It’s the middle of the day in the center of London.  It’s very, very busy.  She’s walking across the lawn.", 
      "DON’T GO!!!  I LOVE YOU!!!  DON’T GO!!!  PLEASE!!!!"
   ], 
   [
      "They start taking photos with their camera phones.  Aldous flips them off.", 
      "Fuck off you cunts!"
   ], 
   [
      "*", 
      "Top notch."
   ], 
   [
      "Sorry to hear about Jackie Q.  I know Paul Allen.  If it’s any consolation, he’s a real weirdo.", 
      "Oh, please.  I wish her all the best.  She has a kind, old soul."
   ], 
   [
      "I don’t want to push you, baby.  But I think it might be time for you get back out there, put that sexiness of yours back on stage.", 
      "I’m ready to perform."
   ], 
   [
      "Seriously?", 
      "I want to perform.  At the Greek Theater.  In Los Angeles.  Be a dear and throw that together for me, will you?"
   ], 
   [
      "Sergio PUMPS his fist.  On Aldous’s side, A TRAMPY GIRL comes  *up from under the covers.", 
      "Does it seem like I’m done down there?"
   ], 
   [
      "*Sergio and several other EXECUTIVES are watching a youtube clip of Aldous on Sergio’s computer.  He’s on a stage in some  *outdoor festival.", 
      "You all want to see something fantastic?"
   ], 
   [
      "Sup? I’m Aaron Greenberg with Pinnacle --", 
      "Right.  You’re meant to accompany me on my trip to LA.  Make sure I don’t go all bonkers."
   ], 
   [
      "You better be good to my boy.  Keep him out of trouble.", 
      "This is my mother, Lena.  Looking gorgeous as always."
   ], 
   [
      "Yours of course with several extra lumps.  Aldy’s always liked his tea with several extra lumps.", 
      "I like it sweet like my mum."
   ], 
   [
      "You spoil me, dear.", 
      "Not as much as you spoil me.  No other woman on Earth has ever loved me as much as you do."
   ], 
   [
      "They kiss on the lips again.  Lena heads out.", 
      "So then what happened?"
   ], 
   [
      "So I’m like so fucked, you know, I can hardly see straight and then this bird I’m with is like all “put me down, put me down” and I don’t even know I’m carrying her I’m that high so I drop her on her ass.", 
      "Then what happened?"
   ], 
   [
      "Been there.", 
      "You have?  What happened?"
   ], 
   [
      "I used to smoke it.  And eat it.  I used to eat junk with a spoon.", 
      "Specifically."
   ], 
   [
      "We were like that.  Well we ran out of junk so we stole a car, like a Porsche style car, and we went down to Mehico to buy more junk and the border guy said “you guys got heroin in your car!”  And I swear at that moment I became a man.", 
      "How’d you respond?  When the border guard said that?"
   ], 
   [
      "“No I don’t have heroin in my car!”  But we did.  We had a lot of junk in the car.  Every one of us did.", 
      "That is something."
   ], 
   [
      "You have a safe trip, you hear?", 
      "I love you, mum.  We’re always afraid to say what we really mean.  I mean, this could very well be the last time I ever see you.  I love you and I’m not afraid to tell you that."
   ], 
   [
      "There, there.", 
      "There’s just too much love in this world.  It’s overwhelming."
   ], 
   [
      "Heathrow, British Airways terminal.", 
      "Not yet.  We gotta stop by Captain Knob’s first.  If I’m gonna perform, I need my bandmates."
   ], 
   [
      "Aldous waves to her.", 
      "All cleaned up now, Abby.  I promise."
   ], 
   [
      "Captain Knob sits on the couch feeding a baby with a bottle while TWO BOYS wrestle behind him.  Abby puts tea sandwiches down before them.", 
      "You gotta come, man.  Don’t make me beg."
   ], 
   [
      "The Limo Driver gets into the front seat.  Aaron starts to sit in the front with the Limo Driver.", 
      "Where are you going?  Aren’t you going to sit back here with me?  I’ll be lonely without you."
   ], 
   [
      "Aaron and Aldous sit in the back seat.", 
      "Captain Knob’s a good one.  But that Abby’s got him all turned around."
   ], 
   [
      "Aaron mimes a pussy-whipping.  Aldous looks at Aaron, sizing him up for the first time.", 
      "I’m glad they sent me someone who’s experienced.  With the controlled substances."
   ], 
   [
      "Too often non drug addicted people just don’t understand, like at all.", 
      "I’ve been a little busy.  Putting the finishing touches on my new album."
   ], 
   [
      "You recording your new album?", 
      "Not yet at the recording stage.  Still conceptualizationing.  But like in my brain, it’s like done, you know?  How long have you been working at Pinnacle?"
   ], 
   [
      "**", 
      "*"
   ], 
   [
      "Yeah.", 
      "So, how long you’ve been with her?"
   ], 
   [
      "Three years.", 
      "You live with her?"
   ], 
   [
      "*", 
      "Has it been easy?  Hard?"
   ], 
   [
      "***", 
      "*"
   ], 
   [
      "Well there are certainly challenges.", 
      "Do you get along with her parents?"
   ], 
   [
      "Her dad can be a challenge, but I think he respects me and what I’m about.", 
      "If I listened to what my dad said, I’d be all messed up in my head."
   ], 
   [
      "Are you in touch with him these days?  I mean, you don’t have to say --", 
      "What’s your type?  Like your perfect woman?"
   ], 
   [
      "My girlfriend.", 
      "Besides her, like if it couldn’t be her.  Like if she died or left you or something."
   ], 
   [
      "Like a doctor.  I really think doctors are super cool.", 
      "Looks?"
   ], 
   [
      "Well I guess blond and petite except for around here.", 
      "Around her tits?  Or including her tits?"
   ], 
   [
      "Including them.  But this is a really theoretical proposition --", 
      "Parents married or divorced?"
   ], 
   [
      "Divorced.  You sure are inquisitive.  It’s like you’re collecting evidence!", 
      "That’s a shame.  Who’s fault?"
   ], 
   [
      "Everyone’s!  So, why perform now?", 
      "This bird I love who lives in LA, she just got engaged, so I’m gonna try to get her back and if she don’t take me back I’m gonna kill myself."
   ], 
   [
      "Aaron laughs, thinking Aldous is joking.", 
      "Funny, right?  My life, it’s humorous.  I like you.  Do you like me?"
   ], 
   [
      "*", 
      "You won’t ever betray me?"
   ], 
   [
      "Dude, I am like the most trustworthy guy ever.", 
      "I’m not the rock star.  You are."
   ], 
   [
      "I can’t believe I was only in London for like four hours.  I so want to come back for like a real amount of time.  It seems like a really neat city.", 
      "Shove this up your bum."
   ], 
   [
      "Aldous is shoving a balloon of heroin into Aaron’s hand.  As Aaron and Aldous have this exchange the line moves them closer and closer to the scary looking British security services.  NOTE: This whole fight is done in angry whispers.", 
      "I said shove this up your bum now."
   ], 
   [
      "I said shove this up your bum now.", 
      "It’s heroin, what do you think it is?"
   ], 
   [
      "Aldous grabs Aaron’s pants and starts to try to shove the heroin down his pants.  Aaron tries to get away.  The Security looks over to see what the commotion is about.", 
      "Stop acting all mental and let me shove this heroin up your ass already.  I thought you used to run heroin all the time."
   ], 
   [
      "I did, it’s just been like eight years so I’m not exactly...", 
      "Shove it up your ass or I throw a bloody fit and we’re both sent to Guantanamo to be assraped by bin Laden."
   ], 
   [
      "They’re almost at the head of the line... Aaron sees his life flashing before his eyes.  He grabs the balloon and shoves it down the back of his pants.", 
      "Not so hasty."
   ], 
   [
      "Aldous pulls a tube of KY Jelly out of his manpurse and spritzes it on the balloon in Aaron’s hand.  Aaron shoves the balloon down his pants, grimaces and shoves it up his ass.  He removes his hand.", 
      "Is it up there?"
   ], 
   [
      "Yes.", 
      "No part of it is sticking out of your anal cavity?"
   ], 
   [
      "No.  Definitely not.  Do these things burst?", 
      "On occasion."
   ], 
   [
      "Next in line please.  Wait, aren’t you Aldous Snow?", 
      "Guilty as charged."
   ], 
   [
      "There better be no smack up your bum.", 
      "Clean as a whistle."
   ], 
   [
      "REVEAL the manpurse is filled with needles.", 
      "Diabetes.  Doctor’s note inside."
   ], 
   [
      "Sorry to hear it.  You’re all clear.  I saw you perform a couple years back.  You threw up on me.", 
      "You’re welcome.  Well all cleaned up now.  No vomiting anymore."
   ], 
   [
      "Morally I probably shouldn’t be doing this.", 
      "Morally you should."
   ], 
   [
      "You’re supposed to be clean.  I’m an enabler.  I’m enabling right now.", 
      "My quit date isn’t until next week."
   ], 
   [
      "My quit date isn’t until next week.", 
      "A year before you quit you pick a quit date.  If I quit before my quit date my whole AA plan goes out the window."
   ], 
   [
      "I thought when you quit you just quit.", 
      "If I don’t do heroin this week I’ll jump the gun on my quit date, which I picked over a year aqo and have been mentally preparing for ever since, then my inability to quit once and for all will be on your conscience.  Do you want that on your conscience?"
   ], 
   [
      "No.  This thing is going to burst.  I feel it’s already burst.", 
      "If it had burst you’d know.  Believe me."
   ], 
   [
      "What’s that supposed to mean?", 
      "You’d feel like a warmth, followed by like a stinging pain, like a real sharp stinging fiery pain, followed by organ failure and death."
   ], 
   [
      "Champagne?  Sparkling water?", 
      "I’m a former alcoholic, so no thank you.  However my young friend would love a champagne.  It’ll help him relax."
   ], 
   [
      "The Flight Attendant heads off.", 
      "Drink it down."
   ], 
   [
      "No.", 
      "Drink it down.  It’ll help loosen the sphincter.  Ironically a loose sphincter aids anal control."
   ], 
   [
      "Oh, cool, that’s really interesting.", 
      "Drink it the fuck down."
   ], 
   [
      "Aldous comes up behind Aaron.", 
      "Oy oy.  Has that flight to New York left yet?"
   ], 
   [
      "Not yet.", 
      "Can we switch to that then?"
   ], 
   [
      "Of course.  It’ll be a 4500 pounds.", 
      "Here you go, love."
   ], 
   [
      "I don’t think we should do that necessarily.  We’re supposed to head to LA.  You know, for your big performance at the Greek.  That’s why we’re here.", 
      "Before a show, I always get my axe at Manny’s Guitar in New York City.  Did it for my first show when I was fifteen.  I ain’t stopping now.  Right, love?"
   ], 
   [
      "Yes.", 
      "Hi there, love.  Well aren’t you looking beautiful today?  I should fly all the time."
   ], 
   [
      "Aaron stares at the Fasten Seat Belt sign.  It’s still illuminated.  Aldous opens his manpurse.", 
      "If for any crazy reason, I have a health emergency, solution’s in here."
   ], 
   [
      "REVEAL that the manpurse is filled with needles and every single kind of painkiller.  As Aldous says each thing, he pulls the appropriate pill or bandage out of the purse.", 
      "I got a headache, I got a bad headache, I got a really bad headache, I got a bullet in m’leg or knife in m’arm, and, of course, if my heart’s stopped."
   ], 
   [
      "Like from Pulp Fiction?", 
      "No.  Like from life.  Got it?"
   ], 
   [
      "I’ve gotta go to the bathroom.", 
      "You are not taking a shit."
   ], 
   [
      "I have to go like right now.", 
      "You take a shit you owe me a thousand quid."
   ], 
   [
      "***", 
      "**"
   ], 
   [
      "Aldous sees Aaron’s seat is empty.   Aldous jumps up and heads to the bathroom and starts knocking on the door.", 
      "Guess who just had a little bit of sex with the flight attendant?"
   ], 
   [
      "Oh.  Awes.", 
      "What’s going on in there, friend?"
   ], 
   [
      "Nothing.", 
      "You better not be taking a shit.  That’s my property."
   ], 
   [
      "I’m aware.  I’m not.  Just doing number one.", 
      "Because if you’re currently shitting, you are stealing from me.  Let me in or I swear I’ll punch my shoulder straight through the door.  I’m hyperventilating!  Let me in!"
   ], 
   [
      "Aaron and Aldous are now in the bathroom.", 
      "Where’s the heroin?"
   ], 
   [
      "Where’s the heroin?", 
      "Prove it to me."
   ], 
   [
      "I can’t prove it to you without expelling it.", 
      "So..."
   ], 
   [
      "So I’m not going to do that right now.  Perhaps when we land and you need it.", 
      "It was wrong of me to make you stash it up your bum.  That was not right."
   ], 
   [
      "At the very least you should have warned me before we were in the security line.", 
      "I understand why you expelled it.  It’s scary having that much dope so close to one’s intestinal track."
   ], 
   [
      "Thank you for understanding.", 
      "You fucking evacuated it you cunt!  If we don’t find it you owe me a thousand quid!"
   ], 
   [
      "Aldous brings his hand into frame.  It’s covered in the blue liquid of the toilet", 
      "You calm down immediately and help me retrieve my property!"
   ], 
   [
      "Aaron starts digging around in the toilet along with Aldous.", 
      "Get in there!"
   ], 
   [
      "It’s stuck!  My hand’s stuck!  Why’d you do that?!?!", 
      "Take a breath!  You’re healthy!  I’m healthy!  We’re both alive and excited to be alive!  Now what do you feel?"
   ], 
   [
      "I feel some metal.  And something slimy.  And...and... I feel a balloon!  I feel the balloon!", 
      "This is fantastic!  Are you fingers around it?"
   ], 
   [
      "AHHHHH!", 
      "You’ve got it!"
   ], 
   [
      "Aaron looks in his hand.  There indeed is the balloon.", 
      "Against all odds, you did it!  I’m proud of you."
   ], 
   [
      "Aaron tries to hand Aldous back the drugs.", 
      "Put it back up there.  You know what happens if I’m caught with it?  You know, right?  I’ll give you some privacy."
   ], 
   [
      "Aaron sits back down next to Aldous.  Aldous leans over and shows Aaron a photo on his cell.", 
      "Check this out.  That’s our flight attendant, ten minutes ago."
   ], 
   [
      "You just did that?", 
      "Them meal carts are sharp."
   ], 
   [
      "Aaron takes the phone and starts scrolling through it.  It’s filled with photos of Aldous with different women.", 
      "If my mobile could talk... it would mainly talk about fucking."
   ], 
   [
      "Manny’s Guitar shop, at --", 
      "Actually, Four Seasons, midtown."
   ], 
   [
      "We shouldn’t stay over in New York.", 
      "I know that.  You’re like a nagging wife.  Nag nag nag."
   ], 
   [
      "Aldous is sitting on the balcony.  Pigeons walk along the railing.  Aaron walks out onto the balcony and puts the now cleaned up balloon in front of Aldous.", 
      "Aaron, look, a lot of people would have walked away then.  I think a stronger person would stay through this.  And that person is you."
   ], 
   [
      "I’m fine, Aldous.  This is really par for the course for me.  I had to do a very similar thing when I assisted Mylie Cyrus at the Kids Choice Awards.  She’s not allowed soda and I got her some.  Not up my butt, but same difference really.", 
      "Daphne is very lucky.  Does Daphne know how lucky she is?"
   ], 
   [
      "I don’t know.", 
      "I think she does.  Look, after putting you through what I just put you through, I don’t think I could ever do anything that bad again.  I don’t like myself when I’m like that.  But the drugs take hold and well, you know the story."
   ], 
   [
      "Totally.  Story as old as time.  Why don’t you just quit today and give the story a happy ending?  Carpe Deum, know what I mean.", 
      "And well you might ask.  And well you might ask.  I feel the fates brought us together.  I see myself when I was your age."
   ], 
   [
      "Really?  Thank you.", 
      "But hopped up on smack.  And fucking Giselle Bunchen.  Enjoy the view and order anything you want from room service."
   ], 
   [
      "The pigeons won’t budge.  Aldous walks out.", 
      "So, where do you want to go tonight?"
   ], 
   [
      "I am willing to pay you for the H, but I am not a drug buying guy.  Besides, we should really get to Manny’s and then get to LA --", 
      "Money don’t mean nothing to me.  Just things.  And drugs."
   ], 
   [
      "If you want it, why don’t you buy it?", 
      "Because I’m famous.  I could get in trouble for this shit.  Now go out there and make pappa proud."
   ], 
   [
      "You shouldn’t be doing this stuff.", 
      "By not getting it for me, you’re just making it inconvenient, slowing down the inevitable.  And there’s no need to whisper."
   ], 
   [
      "Really.", 
      "You think I give a shit what kind of heroin buying experience you have?  Oh, I only want a lad who majored in drug purchasing at Oxford buying my drugs."
   ], 
   [
      "I’m not trying to eff off --", 
      "I guess that’s why Daphne’s dad hates you.  And right he should."
   ], 
   [
      "Firstly, he doesn’t hate me --", 
      "But I know your type.  You are a vampire, sucking the life out of others so that you can live."
   ], 
   [
      "I’m not a vampire.  I’m a good guy.   It’s all my fault, it really is, everything that’s happened, but buying illegal drugs is --", 
      "-- small potatoes.  You think David Geffen would walk away from this?"
   ], 
   [
      "-- small potatoes.  You think David Geffen would walk away from this?", 
      "How many pounds of heroin has Geffen transported up his ass in his lifetime to get his yacht?  More than an ounce."
   ], 
   [
      "Aaron puts the drugs on the table.", 
      "You are a dear.  A total dear."
   ], 
   [
      "Aldous hugs Aaron.", 
      "I was harsh, but that’s because life is challenging and this is one of those challenges."
   ], 
   [
      "It’s fine.  I got it done.  That’s what I do.  I get things done and this is one of those things.", 
      "I got you a present."
   ], 
   [
      "Aldous hands Aaron diamond earrings.", 
      "Or rather it’s for your great love, Daphne."
   ], 
   [
      "Is this real diamond?  Cause if it is this is not necessary at all.  This is probably the most expensive thing I own.", 
      "I’ve been a shit.  It is completely necessary.  It is the most necessary thing I have done in my entire life.  I’ll be back in a moment and then let’s go to Manny’s to get me an axe."
   ], 
   [
      "Jackie pushes her hands down towards her crotch and winks *towards camera.  Then an Aldous from happier times appears on  *screen next to her. *", 
      "You gotta ring around your rosy/Let me get into your posy/Finger it around/Get all up in town!"
   ], 
   [
      "They kiss and then FALL OUT OF FRAME.  ANGLE ON THE DOOR AS Aaron enters the bedroom.  Aldous’s passed out on the bed in a drug induced stupor.  It’s a creepy, sad moment.", 
      "Give me five minutes, mate.  Just five.  Five alive."
   ], 
   [
      "Aldous Snow.  It’s good to see you stateside.  I thought you’d died.", 
      "The Reaper hasn’t got me yet.  This is my best American friend, Aaron Greenberg."
   ], 
   [
      "What’re you looking for?", 
      "What do you think?"
   ], 
   [
      "You hear about Jackie Q?", 
      "I heard a bit about that, sure."
   ], 
   [
      "Aldous starts strumming Let It Be.  As he plays, a crowd gathers around him.  Aaron starts to smile.  This is actually pretty cool.", 
      "When I find myself in times of trouble, mother Mary comes to me,speaking words of wisdom, let it be./"
   ], 
   [
      "The crowd starts crying as well.  Even Aaron is tearing up.", 
      "Let it be, let it be, let it be, let it be.  Whisper words of wisdom, let it be./Let it be, let it be, let it be, there will be answer, let it be, let it be."
   ], 
   [
      "Phil and Aaron go to grab him.", 
      "Let is be!  Let it be!  Let it be!"
   ], 
   [
      "With wild abandon, Aldous goes crazy.  Aaron jumps on Aldous’s back to try to stop him.", 
      "Ahhhh!  Unhand me!  Let me be!  Let me be!"
   ], 
   [
      "Aldous ROLLS the window down.", 
      "I’m really sorry, Phil.  My head is like wohhh.  Are we all good?"
   ], 
   [
      "Immediately, Phil and Aaron are on their best yes man behavior.", 
      "Course we are, man."
   ], 
   [
      "Phil PUNCHES Aaron again.  Aaron takes a swing at Phil.  Phil easily grabs Aaron’s hand and makes him punch himself in the head with it.  Aldous sticks his head out of the limo.  Phil and Aaron immediately act like they’re just talking.", 
      "When you’re done settling up, you want to grab some nosh over at the Russian Tea Room?"
   ], 
   [
      "The limo takes off.  In the BG, we see Phil FLIPPING THEM OFF.  Aaron flips him off behind Aldous’s head so Aldous can’t see.  Before Aaron says anything Aldous cuts him off.", 
      "I don’t think I could even do anything that bad again."
   ], 
   [
      "Hey, you know what, you’ve gotta go through your artistic process.", 
      "When the worst possible thing has already happened, it could not possibly get worse and therefore it’ll just be an uphill trajectory from here on out."
   ], 
   [
      "Whatever, it’s fine, man.  Really.", 
      "Do you ever curse?  Because now is a moment where you are well within your rights to curse."
   ], 
   [
      "Sure I do.", 
      "Say the word fuck."
   ], 
   [
      "Like in what context?", 
      "Like, shut the fuck up."
   ], 
   [
      "Shut the fuck up.", 
      "And calm the fuck down you crazy motherfucking fucker."
   ], 
   [
      "Why?  Why bother saying that really, you know?  Like why?", 
      "Cause I want you to.  Say it.  Say it, puppet, say it."
   ], 
   [
      "I’m not your motherfucker puppet.  OK?  Fuck fuck?  Fuck fuck fucking motherfucker?", 
      "**"
   ], 
   [
      "Aldous and Aaron are in flight.  Aldous grabs his phone and looks at the photos.", 
      "**"
   ], 
   [
      "That’s my lady.  And those are my parents.", 
      "You in touch with them still?"
   ], 
   [
      "Yeah.  We’re really close actually.", 
      "Must be nice to have that."
   ], 
   [
      "It’s not bad.  You seem to have a great relationship with your mom.", 
      "I do.  My pop’s another story."
   ], 
   [
      "You never speak to him?  Like ever?", 
      "Nah.  I hate that man.  He wrote an unauthorized biography about his own son.  Who does that?  I’ve come to terms with the fact that I’m never gonna see that bastard again."
   ], 
   [
      "Cool.  Do you even know where he lives?", 
      "Last I head he’s a card shark in Vegas."
   ], 
   [
      "It’s Jew for Grandma.", 
      "That’s a beautiful story, mate.  You have such a kind, old soul."
   ], 
   [
      "How may I help you?", 
      "These headphones are busted."
   ], 
   [
      "She leaves and returns a second later with another set.", 
      "These are busted too."
   ], 
   [
      "Hey, man.  You can use mine.", 
      "I can’t use yours!  I can’t use anyone’s!  CAUSE THERE’S A BOMB ON THIS PLANE!  I CAN FEEL IT IN M’ BONES!"
   ], 
   [
      "What the fuck were you thinking?", 
      "I like that.  It’s amusing, you cursing.  It’s like watching a nun do anal."
   ], 
   [
      "Why would you do this?", 
      "My father is dying.  Cancer.  Pancreatic.  He’s had it for a year.  The doctors give him three to six months."
   ], 
   [
      "I’m sorry, man.  That’s awful.  But we can’t stay here.", 
      "What if he died tomorrow and I didn’t see him because of some concert?  It’s like if you had never gotten to see your boobie that one last time?"
   ], 
   [
      "That was just a like a once in a million years coincidence.  He’s not going to die tomorrow.", 
      "You don’t know that."
   ], 
   [
      "And if he does, his energy is still going to rejoin the big overall energy field of everything so it doesn’t matter if you see him.", 
      "I was just making that all up."
   ], 
   [
      "Aldous and Aaron are walking into the casino.", 
      "What should I say to him when I see him?  I am a whirligig of emotions."
   ], 
   [
      "Aldy?", 
      "Hey, father."
   ], 
   [
      "You want to hit Morton’s, grab some steaks?  You’re buying!  Cause you’re the famous rocker, not me!", 
      "Still a vegetarian, dad."
   ], 
   [
      "Holy moly!  That did not happen!", 
      "Where did those birds some from?"
   ], 
   [
      "It’s magic.", 
      "Oh, I knew he was going to say that!"
   ], 
   [
      "Hi, I’m Millenium./I’m Jet.  What’s your name?/I’m Katherine.", 
      "Katherine?  Why don’t you have a more adventurous name?"
   ], 
   [
      "It’s been a long time since we’ve done something like this.  Remember Bangkok?", 
      "How could I forget?"
   ], 
   [
      "I just want to say it wasn’t correct of me to write an unauthorized about you.  That’s not good parenting.", 
      "I was a bastard to you, I realize that now."
   ], 
   [
      "How could you not be?  I was never around when you were a kid.", 
      "Mum wasn’t the easiest person to live with and what with me in and out of juvey --"
   ], 
   [
      "Still no excuse.  You were just a boy.", 
      "Water under the bridge.  Life is too short.  We all make mistakes.  The biggest mistake is not forgiving."
   ], 
   [
      "Aaron flips back to Daphne who’s still breathing.  Aaron does some breathing as he heads over to Aldous and his dad.  He hits the phone on mute.", 
      "Oy, Aaron!  We’re getting AIDS rubbed all over our pants!  No offense, Katherine!"
   ], 
   [
      "Hey, Aldous.  It’s Sergio.  I understand you’re not feeling well --", 
      "I’m getting lapdances in Vegas with my pop.  We’ll be in LA in the AM.  I love this kid by the way.  He’s fantastic.  Ciao."
   ], 
   [
      "Aaron hands Krissy his drink.  Aldous and Jonathan stumble out of the strip club with their strippers.", 
      "There you are, Aaron!  We thought we’d bring the party back to fake Italy."
   ], 
   [
      "The four of them are bent over doing coke.", 
      "You want any?"
   ], 
   [
      "You want any?", 
      "It’s really just like having a cup of coffee."
   ], 
   [
      "Aaron closes the door and looks in the mirror.  Aldous walks in, holding a large terrifying looking joint.", 
      "That was something else.  She’s a dirty, dirty bird.  Want a hit?"
   ], 
   [
      "What is that?", 
      "I call it the Jeffrey.  It’s a bit o this, a bit o that."
   ], 
   [
      "Aaron takes it and starts puffing on it.", 
      "Why aren’t you with your lady?"
   ], 
   [
      "I have a girlfriend who I’m going to marry.", 
      "If you have a girlfriend you’re going to marry then this is the only time you’ll be able to do this in good conscience.  Once you’re married you can’t have sex with a random girl in a Vegas hotel suite.  But now you can."
   ], 
   [
      "But I shouldn’t.  And besides I don’t want to either at all.  She’s a hot doctor.  I didn’t think they existed!", 
      "You’ve got to get it out of your system.  Otherwise it’s going to emerge like a noxious shit bubble years from now when you have a little baby daughter.  Do you want to break your baby daughter’s heart?"
   ], 
   [
      "No.  I don’t.", 
      "Then go out there and fuck that girl.  It’s the morally correct thing to do."
   ], 
   [
      "Aldous starts to pee in the toilet.", 
      "Man I had to pee the entire time we were having sex.  Isn’t that the worst?  As I came I was literally thinking about Victoria Falls."
   ], 
   [
      "You tricked me into having sex with a hooker!", 
      "Not a trick!  A gift!"
   ], 
   [
      "Why is jewboy talking so much?", 
      "You’re just nervous that you screwed that girl.  Normal stress coming out."
   ], 
   [
      "I didn’t cheat on her!  I didn’t even put it in!  It just kind of circled the area!  My heart literally won’t stop pounding!", 
      "That is the most amazing expression ever."
   ], 
   [
      "Why?  It’s just a joint.", 
      "No, it’s a Jeffrey."
   ], 
   [
      "Wait... what’s in this thing?", 
      "A layer of pot.  Then a layer of opium.  Then some crack.  And a little bit o meth.  And the rolling paper’s been dipped in acid.  Oh, and there also might be some angel dust.  Not sure."
   ], 
   [
      "I am having a heart attack.", 
      "No you’re not."
   ], 
   [
      "He could be.  The Jeffrey gives people in much better shape heart attacks.  I knew this footballer who had a heart attack who had just like one puff of the Jeffrey and unlike, Jewfro, he had zero percent body fat.", 
      "Don’t freak him out more."
   ], 
   [
      "Don’t freak him out more.", 
      "**"
   ], 
   [
      "I had to get my side of the story across.", 
      "You ain’t got no side."
   ], 
   [
      "You were a bastard as a kid and you’re a bastard now!", 
      "Maybe I wouldn’t have been a bastard if you hadn’t left me and mum at home to fuck underage Thai hookers!"
   ], 
   [
      "Maybe I wouldn’t have been a bastard if you hadn’t left me and mum at home to fuck underage Thai hookers!", 
      "You made me this way!  You made me incapable of connecting with people except by having sex with them!"
   ], 
   [
      "I think my heart just stopped.", 
      "Just calm down, alright?  Now look at me.  Think about the beauty in this world.  Like check out this ant."
   ], 
   [
      "Ah!  Why would you do that?", 
      "To distract you.  And impress you."
   ], 
   [
      "Your dad doesn’t have pancreatic cancer, does he?", 
      "It’s in remission."
   ], 
   [
      "No it isn’t.  I don’t care.", 
      "You’re right.  I lied.  Like the way you lied about doing drugs."
   ], 
   [
      "It’s actually gotten a lot stronger recently.  The THC levels are like way higher than when our parents smoked it... you’re right.  It’s not drugs.", 
      "I don’t understand you.  Why’d you stop having sex with that girl?  She was proper smoking."
   ], 
   [
      "Because of my girlfriend.", 
      "I just don’t get that."
   ], 
   [
      "What’s there to get?", 
      "Why are you in a relationship?  What is the advantage of it?"
   ], 
   [
      "I don’t like choosing stuff, like where I have to go to dinner.  Or my clothes.  I like that my outfits get laid out for me.  I wake up every morning and my shirt is picked out for me, my jeans are picked out for me, it’s nice.", 
      "You’re fascinating.  What do you do?  Like at night?"
   ], 
   [
      "I don’t know.  I watch TV.  Like Grey’s Anatomy.", 
      "Is that with that guy, McDreamy?"
   ], 
   [
      "Yeah.", 
      "I know him.  I fucked him."
   ], 
   [
      "No way.", 
      "*"
   ], 
   [
      "Last year my family and Daphne’s family had dinner and went to see Capote.  How about you?  What’d you do for your birthday?", 
      "Me and about ninety-five people went to Richard Branson’s private island and had an ecstasy party and then went out in a hot air balloon."
   ], 
   [
      "I’m not going to lie.  Your life seems awesome.", 
      "But it’s missing love, Aaron.  Don’t you see?  I want love the way you have love.  Without love, I’m gonna become that bastard we just spent twelve hours with.  I want a lady to pick out my clothes.  And not just an assistant who I pay."
   ], 
   [
      "Is there a specific someone?", 
      "I’m in love with Jackie Q.  I know it now.  She’s so gorgeous and sexy and has these perfect tits.  Really, something.  Like an angel’s tits.  And she always kept me guessing.  I was with her at this party in Monaco and she leans over and whispers to me “I’m wet.”  She just said that to me, you know, like she was telling me the weather, with McCartney and Judi Dench and the Dalai Lama just standing like two feet away.  I swear I fell in love right then, right there.  Then later that week, we’re at a nightclub in Goa and she went and made out with Emma Bunton right in front of me.  Under different circumstances I would have been happy to be seeing this, this would have been my idea of nirvana.  But not this time.  This time I was mad.  And as I watched them make out and strip and begin the process of engaging in oral sex I got angrier and angrier till I realized this was love, I was in love."
   ], 
   [
      "Beat.", 
      "We have a kid together, you know.  I haven’t seen the tyke in years.  Beautiful child."
   ], 
   [
      "That’s amazing, man.  That’s the reason we’re here on Earth.", 
      "It is, isn’t it?  I even pay his child support but I don’t mind cause I love him so much.  And her too."
   ], 
   [
      "Why’d it end?", 
      "I don’t know.  I just don’t.  I want her back.  She lives in LA and I want to see her and get her back.  But I don’t know what to do.  Like when I first see her, what do I do?"
   ], 
   [
      "Just be honest and tell her how you feel.  A good relationship, if that’s what you want, is all about honesty.  The one thing is and I don’t want to get into this if it doesn’t matter, but isn’t she... engaged... to Paul Allen?", 
      "You’re right, if I’m honest I’ll get her.  And once I’ve gotten her I can finally put an end to this interminable, miserable single life.  Presently I can go wherever I want with whoever I want and do whatever I want to whomever I want.  It’s not as good as eating dinner at 6:30 with the same person and having nothing new to talk about ever.  It’s like when I was on Branson’s private island in an ecstasy orgy with these two Indian models I was like “I wish I was locked in a small apartment in Los Angeles with the same person forever.”"
   ], 
   [
      "Aaron’s unsure whether to be offended or laugh it off.", 
      "I’m just joshing with you, man.  I’m jealous."
   ], 
   [
      "A DRIVER of one of the cars HOPS OUT and PUNCHES Aaron in the  **face.  Aldous casually hits the divider button in the limo.", 
      "It seems my compatriot has fallen out of the vehicle."
   ], 
   [
      "Aaron sits as far from Aldous as possible, completely and totally terrified.", 
      "*"
   ], 
   [
      "So if you need anything please call.  Otherwise I’ll be seeing you tomorrow late afternoon pre-concert.", 
      "This is how we leave it?  With you being so cold, just icing me out."
   ], 
   [
      "Aldous, in a limo, pulls up outside the mansion.", 
      "Thanks, mate."
   ], 
   [
      "Well fuck me.", 
      "Alright."
   ], 
   [
      "**", 
      "As are you my dear, as are you."
   ], 
   [
      "C’mere, Naples, and say hello to your friend, Aldous.", 
      "And father."
   ], 
   [
      "Nook!", 
      "What a beautiful child."
   ], 
   [
      "Aldous picks up Naples and holds him upside down.  Aldous is oddly good with Naples.", 
      "Are you a monster?  Are you a little monster?"
   ], 
   [
      "I’m not a monster.", 
      "What was that?  I think you just said you’re a monster!"
   ], 
   [
      "I’m not a monster!", 
      "No.  Cause I’m the monster!"
   ], 
   [
      "I love you, you crazy, crazy man!", 
      "And I love you!"
   ], 
   [
      "Last one in the pool is a rotten egg!", 
      "Well I don’t want to be a rotten egg!"
   ], 
   [
      "Naples jumps into the pool.  Aldous strips and jumps in after him.  Jackie watches from the side and laughs.", 
      "I guess your mum’s the rotten egg."
   ], 
   [
      "You are!  You are!", 
      "I’m not a rotten egg.  I’m the monster!"
   ], 
   [
      "Aldous takes Naples and throws him farther into the pool.  Naples is giggling.  Jackie is giggling.  Aldous looks around.  Life is perfect.", 
      "We should get married."
   ], 
   [
      "What?", 
      "**"
   ], 
   [
      "Yay!", 
      "Let’s just go get married.  We already have bundled our genes into this perfect little moppet.  Let’s stop lying to ourselves and tie the knot already."
   ], 
   [
      "Paul’s docking later this afternoon so you should probably dry off and go.", 
      "Screw Paul Allen.  Unengage him.  Screw our little boxes that we’ve put our lives in."
   ], 
   [
      "*", 
      "***"
   ], 
   [
      "Suzette!", 
      "But you just told me you loved me."
   ], 
   [
      "That was then, this is now.", 
      "That was like twenty minutes ago."
   ], 
   [
      "Now look what you’ve done.  You’ve gotten Naples all pissed.  Suzette!", 
      "Don’t take him away, lady!  Don’t take my son away!"
   ], 
   [
      "*", 
      "That’s gonna change right now!  I love him!  A son should be raised by his father!"
   ], 
   [
      "Well in that case he should be raised by Hugh Grant.", 
      "What?  No.  Me.  He’s half me."
   ], 
   [
      "I shoulda told you six years ago but if I had you woulda stopped sending me child support payments.  That’s not right which is why I’m going to pay you back.  In fact I’ll write the check right now.", 
      "I don’t care if he’s not my son!  I still love him! I LOVE YOU, KID!"
   ], 
   [
      "CHYRON: FOUR HOURS UNTIL THE GREEK.", 
      "I have no one!  NO ONE!!!"
   ], 
   [
      "The doorbell rings.  Aaron goes to the door and opens it, revealing Aldous.", 
      "So this is where you live?"
   ], 
   [
      "What are you doing here?  You’re supposed to be at the Greek.", 
      "I need you with me."
   ], 
   [
      "My gosh, Aldous Snow!", 
      "Are you Daphne?  You are even more lovely in person."
   ], 
   [
      "Aaron, Daphne and Aldous are sitting in the living room.  They’re drinking wine.  Aldous stares at the sculpture from the beginning that Aaron described as “pretty.”", 
      "I love this piece."
   ], 
   [
      "Thanks.", 
      "But I also hate it.  It looks the way my insides feel, all fucked up and tossed around.  It’s like nausea in three dimensions."
   ], 
   [
      "You want me to drive you to some LA hot spots?  I can take you to the Standard, the Chateau --", 
      "*"
   ], 
   [
      "Aaron downs his glass of wine.", 
      "Where’s this?"
   ], 
   [
      "Buenos Aires.  That was our first transatlantic trip together.", 
      "The presidential suite at the Buenos Aires Ritz is the nicest hotel room I’ve ever been to."
   ], 
   [
      "Yeah, we were staying in a hostel.", 
      "**"
   ], 
   [
      "Aldous plays and sings John Mayer’s “Daughters” on a guitar while Daphne and Aaron watch, holding hands.", 
      "I am astonished and fascinated at your longevity as a couple."
   ], 
   [
      "I getcha, man.  It’s my longest relationship by far.  Sometimes, it’s like, wow.", 
      "What do you do when you’re in a relationship for that long.  Like, how do you keep it lively?"
   ], 
   [
      "It’s easy because we love each other.", 
      "Aren’t you worried that you’re missing out?"
   ], 
   [
      "On what?", 
      "Like if you could have done one sexual activity before you died what would have been?"
   ], 
   [
      "What, like a threesome?", 
      "Sure like that."
   ], 
   [
      "I guess a threesome.", 
      "Threesome.  Do you have any fantasies like that?"
   ], 
   [
      "I’d love to try a threesome.  You know, before I die.", 
      "Well that is something that is possible right now.  It’s not like wanting to fly or shoot lasers out of your eyes.  A threesome is something that we can accomplish right here right now."
   ], 
   [
      "That would be hilarious, us having a threesome.", 
      "If you’d like, but I certainly don’t want to apply any pressure.  I have had my share of threesomes."
   ], 
   [
      "So why not try it?  If we don’t like it we don’t have to do it again.", 
      "I got this mate who I had a threesome with and he didn’t like it and then he never had one again."
   ], 
   [
      "Then neither am I.", 
      "Perfect!  Let me get my whip."
   ], 
   [
      "Aldous starts very casually taking his clothes off.", 
      "Well, what’re you waiting for?"
   ], 
   [
      "Aaron fills up a glass with water.  Then a second glass with water.  He then looks at himself holding two glasses of water.  He is literally serving water to his girlfriend and the man who is fucking her.", 
      "I am going to ejaculate!"
   ], 
   [
      "This is bullshit.", 
      "I am ejaculating!  Ahhhhhh!"
   ], 
   [
      "Aaron awkwardly tries to get into the action.", 
      "Oh boy!  Oh boy!  Oh boy!  I am going to ejaculate again!"
   ], 
   [
      "What the fuck?", 
      "What’s the problem?"
   ], 
   [
      "Aaron is frozen in terror/disgust.", 
      "I didn’t mean to.  That was an unintentional sperming."
   ], 
   [
      "Hey, you gotta expect that kind of thing is going to happen in this sort of situation.", 
      "I am starving.  I understand there’s a delicious diner around the corner.  You interested, mate?"
   ], 
   [
      "I don’t want to talk about this while he’s here!  And once he’s not here this is nothing we can talk about!  This cannot be solved through discussion!  This is you cheating, right in front of me!", 
      "I don’t think it’s cheating when it’s a consensual threesome."
   ], 
   [
      "That wasn’t a threesome!  That was a twosome with me watching!", 
      "You could have jumped in.  We weren’t being exclusionary.  That’s against the rules."
   ], 
   [
      "I shouldn’t have to say anything to get you to not have sex with another man!", 
      "Sexual mores are just a thing of the past century.  We are all living in a false construct."
   ], 
   [
      "Daphne goes.  He notices that Aldous’s black manpurse is still in the apartment.  He picks it up and it spills opens, revealing a box of needles.  Aldous walks in.", 
      "I forgot my satchel."
   ], 
   [
      "Aaron takes a needle out of the box and TOSSES IT at Aldous.", 
      "Woh.  Alright, mate.  Let’s just hand them over."
   ], 
   [
      "Aaron throws a second needle like a dart and NAILS Aldous in the arm.", 
      "Ow!"
   ], 
   [
      "Aaron throws a third and fourth and fifth.  They land in Aldous’s leg, chest and right below his eye.", 
      "What the hell, man?"
   ], 
   [
      "Aldous pulls the needle out of his face and tosses it back, sticking Aaron in the arm.", 
      "You’ve been throwing them."
   ], 
   [
      "Aldous takes another and throws it at Aaron.  Suddenly they are in a FULL SCALE NEEDLE FIGHT, tossing needles back and forth with frighteningly fast abandon.", 
      "Draw!  Draw!"
   ], 
   [
      "They stop.  Aldous throws another needle at Aaron.  The needle fight starts again.   While throwing needles, they say the following things --", 
      "Don’t you get it!  I’m done!  The only person that ever loved me hates me!  I’m done making music!  I’m done!  I might as well go kill myself!"
   ], 
   [
      "Fine!  Go ahead, you big baby!  Kill yourself!  You just fucked my girlfriend and then she dumped me!  I don’t give a shit what you do!  And make sure to swallow all the pills!  If you swallow only half you just get sleepy!  Better yet, shoot yourself, but make sure to do it in the head!  That way you’ll have the best shot at actually succeeding in killing yourself!", 
      "I’m sorry if I’ve been a disappointment.  I hope to one day make it up to you."
   ], 
   [
      "Aaron pulls the phone cord from the wall and throws it against the wall.  A piece of the phone hits Aaron in the head.  Aaron goes into the bathroom.  On the mirror there’s a note.  He opens the envelope.  The note reads:", 
      "Dear Aaron.  This is my last will and testament.  Since I have no kids or wife or really anything I’m leaving my estate to you.  If you want to see me off, I’ll be jumping from the Hollywood sign at nine, depending on traffic.  I want my body to be cryogenically frozen, to be unfrozen when there’s a chemical cure for addiction or heroin becomes legal, whichever comes first.  Yours, Aldous.  P.S.  I’m sorry for making love to your girlfriend.  That was done out of self-anger.  P.P.S.  I do not know if this last will and testament will hold up in a court of law.  I apologize if it doesn’t.  In fact, the more I think about it the more unlikely it seems that it will.  Sorry, mate."
   ], 
   [
      "Aaron crawls down to the sign.", 
      "Why not?  I’ve got nothing.  I’m a drug addicted nothing.  My friends are all addicts or yes men.  I can’t even write music anymore.  I’m not even sure if I even ever could.  Most of my songs are just ripoffs of the Beatles and the Clash.  I’m the nugget of shit that hangs off the asshair of humanity."
   ], 
   [
      "No you aren’t.  You can have sex with whoever you want whenever you want.", 
      "Sex isn’t love.  Sex has gotten boring."
   ], 
   [
      "Sex isn’t love.  Sex has gotten boring.", 
      "All I live for is getting high.  If I don’t die from this I’ll die from an overdose.  At least if I jump I’m making the choice, not the drink and the drugs."
   ], 
   [
      "Jumping’s for pussies.  Jumping is what you do out of fear.  You really going to be a pussy?  You really going to throw away the one thing God has given us, life, for nothing?", 
      "I didn’t know you were religious."
   ], 
   [
      "I didn’t know it either until right now but I think I am and I think what you’re doing is downright immoral.  In my one week with you I’ve seen more of the world then I have in my entire twenty three years.  Don’t throw it all away man.  Life is precious.  Don’t just toss it away like a used needle.  Instead, take that needle and shoot up life instead.", 
      "Why’re you doing this?  Do you love me?"
   ], 
   [
      "*", 
      "Tell me you love me."
   ], 
   [
      "I love you in the way one is required to love all humanity.", 
      "Tell me that you love me and me specifically, not just the general concept of humanity."
   ], 
   [
      "I love you... and you specifically not just the general concept of humanity.  I love you, Aldous Snow.  I love you.", 
      "I love you too, Aaron Greenberg.  I love you too."
   ], 
   [
      "Aldous comes to and sucks in a breath.  As Aldous and Aaron talk, the hot tub slowly turns red with Aldous’s blood.", 
      "I’m alive.  I’m alive!  I can’t believe I’m alive!  You saved me, Aaron.  I can’t believe you came and saved me."
   ], 
   [
      "I only came because I didn’t want your death on conscience.  I thought that maybe I’d go to jail if I didn’t show up.", 
      "I have completely changed as a result of the love you’ve given me by saving me."
   ], 
   [
      "As soon as you see a girl with big tits or a pound of hashish it’ll start all over again.", 
      "I look at you, Aaron, and I see pure love.   You are the most beautiful person I have ever met."
   ], 
   [
      "I’m an enabler who is probably responsible for the fact that you have learned nothing and will be smoking crack within the next fifteen minutes.", 
      "I am going to prove you wrong.  That’s how I feel about you.  Because we are going to be best friends forever."
   ], 
   [
      "I won’t because you fucked my girlfriend and screwed me out of my job.", 
      "We can still make it."
   ], 
   [
      "It’s over, man.  The show was supposed to start almost three hours ago.", 
      "I’m always at least four hours late.  My fans all know this.  Once, in Manchester, I went on at 2:10AM.  Performed for six hours.  We can still make it."
   ], 
   [
      "Are you sure we shouldn’t go to the emergency room?", 
      "It’s just pain.  Pain is fleeting.  Love is forever.  You have given me love so in turn I shall give you sobriety.  From now on nothing’s more important to me than my sobriety."
   ], 
   [
      "That’s the quickest trip to hypocrisy maybe in history.", 
      "There is literally no way I can save your job right now without fourteen Vicodin.  My bone is sticking out here.  Touch it.  That’s bone."
   ], 
   [
      "Aldous touches his bone.", 
      "It’s so weird.  You can’t feel your bone if you touch it.  It’s like touching a drumstick or something."
   ], 
   [
      "Aldous is already on stage.", 
      "Allo, Los Angeles!  Are you ready to rock out?"
   ], 
   [
      "ANGLE ON THE STAGE:", 
      "This song is dedicated to my good buddy Aaron Greenberg -- get on out here."
   ], 
   [
      "Aaron doesn’t want to.", 
      "Get on out here, Aaron Greenberg!  Get on out here, Aaron Greenberg!"
   ], 
   [
      "Sergio nods to Aaron.  Aaron walks out onto stage.  The crowd  *cheers.  Aaron smiles.", 
      "This man, while he didn’t save me from jumping off the Hollywood sign, at least showed up.  Even after I made love to his girlfriend.  Now that’s true friendship."
   ], 
   [
      "The crowd doesn’t know how to respond to this.", 
      "I also wish to make an announcement.  I’m quitting drugs and the alcohol."
   ], 
   [
      "The audience starts booing.", 
      "If anyone ever sees me drinking a beer or smoking a joint or doing any other kind of controlled substance you have my legal permission to beat the living shit out of me."
   ], 
   [
      "The crowd cheers like crazy.", 
      "And a one!  A two!  A one two three!"
   ], 
   [
      "Aldous tries to strum the guitar and HOWLS IN PAIN.", 
      "That fucking hurts!  Holy shit that hurts!  Ahhh!"
   ], 
   [
      "Aldous unwraps his bandage to reveal his bone.", 
      "Check out my bone!  Check it out!  Ahhh!  The pain!!!!!"
   ], 
   [
      "The band stops playing.", 
      "What’re you doing!?  Keep playing!"
   ], 
   [
      "They start playing again.  Aldous begins singing and howling in pain all at once.", 
      "Love explosion!  It’s a love explosion!  My love explodes into your heart!  It explodes all over your chest!"
   ], 
   [
      "Aaron starts proudly parading around the stage flipping them off as medics rush onstage to take care of Aldous.  Aaron rushes over to Aldous.  Aldous’s eyes flutter open.", 
      "Get your lady back, man.  You’re too much of a pussy to live in this world without her."
   ], 
   [
      "Aaron, Aldous, and Naples are hiking. As they hike, Aldous is sucking down a sucrose gel pack.", 
      "I’m just incredibly grounded these days.  Eight months clean."
   ], 
   [
      "That’s really great.  I’m impressed.  And it’s so great to see that you’ve reconnected with your son.", 
      "He’s just my mate.  His dad’s actually Hugh Grant.  Who knew?  He’s staying with me for the month.  His mother’s kind of a W-H-O-R-E."
   ], 
   [
      "He sucks down another gel pack.", 
      "The point is I’m finally living the clean life we’re all meant to live and it’s all because of you.  Thank you, Aaron, for pulling me back from the edge and showing me the way towards a healthy, safe existence."
   ], 
   [
      "PULL BACK TO REVEAL they’re at the edge of a cliff.", 
      "Meet you both at the bottom!"
   ]
]
 }