{ "lines" :  
[
   [
      "Daphne’s parents, MR. AND MRS. BINKS are outside the protective cage.  They hit the buzzer.  A large group of homeless people walk by.", 
      "Where the hell are we, Kabul?"
   ], 
   [
      "Thanks, Mrs. Binks.  It is thrilling.", 
      "***"
   ], 
   [
      "Intern, not a secretary.", 
      "Intern?  Like Monica Lewinsky?  You gonna be taking out any dry cleaning?  I’m just kidding."
   ], 
   [
      "If you want to get into the music biz you start as an intern.", 
      "*"
   ], 
   [
      "We see that Daphne’s touched by Aaron standing up for her.", 
      "I’m just worried that a creative and an intern living together -- who’s the support beam?  Judging by this neighborhood you’re barely holding on as is."
   ], 
   [
      "First of all, this place is not cheap.  Downtown’s coming back.", 
      "From what?  Armageddon?"
   ], 
   [
      "I don’t make much but I make enough for the two of us.", 
      "What happens when you lose your job because the music industry is downsizing because no one buys records anymore?"
   ], 
   [
      "How’s the corporate law these days?", 
      "It’s a job.  Aaron, I just wanted to say something to you.  I can see how much you care for my daughter."
   ], 
   [
      "I do, sir.  Very much.  Honestly, and I know, I’m young, but I hope to one day marry her.", 
      "Don’t call me sir."
   ], 
   [
      "I called you sir?", 
      "Yeah."
   ], 
   [
      "I didn’t even notice.", 
      "Well, you did."
   ], 
   [
      "I’m... sorry?", 
      "I just wanted to tell you that I think you two are making a terrible mistake moving in together."
   ], 
   [
      "What?  Why?", 
      "You two are not ready at all."
   ], 
   [
      "Yeah we are.", 
      "No you aren’t."
   ], 
   [
      "I believe we are.", 
      "I believe you aren’t."
   ], 
   [
      "I love her.", 
      "No you don’t."
   ], 
   [
      "Yes I do.", 
      "No you don’t."
   ], 
   [
      "I do.  I do love her too.", 
      "You just don’t."
   ], 
   [
      "****", 
      "You don’t and they aren’t.  You’re not right for her.  She’s a flighty girl.  She needs someone more grounded."
   ], 
   [
      "She’s an amazing sculptor.  It just takes a while to break into the art world.", 
      "I’m not going to debate my daughter’s future with you.  She’s a cute girl who needs to land a rich husband before she pops out a few grand kids and ends up teaching art in an elementary school."
   ], 
   [
      "I think she’s talented.", 
      "The world has too much talent and not enough customers.  Here’s the deal: quit playing house like a little girl.  You’re in the music biz.  Go out, party like a rock star, experiment with drugs, go apeshit crazy so you don’t end up doing it later in life.  Move in with a couple best male friends and live it up.  Now’s the time."
   ], 
   [
      "I already live with my best friend.  Daphne’s my best friend.", 
      "*"
   ], 
   [
      "Aaron pulls up to Daphne’s parents’ house.  It’s a nice house on the ocean in Laguna.  He runs up to the door.  Not wanting to wake anyone up, he knocks lightly on the door.  Then he finally hits the doorbell.  A very long door chime version of “Lollipop” plays.  Mr. Binks opens the door.", 
      "What the hell time is it?"
   ], 
   [
      "Five a.m.  Is Daphne here?", 
      "I don’t think she wants to see you."
   ]
]
 }