{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "I am wasted on cross-country. We  dwarves are natural sprinters. Very dangerous over short distances.", 
      "Rohan. Home of the Horse-lords. There’s something strange at work here. Some evil gives speed to these creatures. Sets its will against us."
   ], 
   [
      "He signed it this morning.", 
      "Keep breathing. That’s the key. Breathe."
   ], 
   [
      "What business does an Elf, a Man and a Dwarf have in the Riddermark? Speak quickly!", 
      "Give me your name, horse-master, and I shall give you mine."
   ], 
   [
      "Look for your friends. But do not trust to hope. It has forsaken these lands.   We ride north!", 
      "It’s one of their wee belts."
   ], 
   [
      "Hurry, Hobbits. The Black Gate is very  close.", 
      "Orc blood."
   ], 
   [
      "These are strange tracks.", 
      "The air is so close in here."
   ], 
   [
      "They have feelings, my friend. The Elves began it. Waking up the trees, teaching them to speak.", 
      "Aragorn, nad nâ ennas!"
   ], 
   [
      "Gandalf the Grey. That was my name.", 
      "Gandalf."
   ], 
   [
      "And I come back to you now at the turn of the tide.", 
      "Edoras? That is no short distance!"
   ], 
   [
      "Yes, and it will not be easily cured.", 
      "Then we have run all this way for  nothing? Are we to leave those poor  Hobbits here in this horrid, dark,  dank tree-infested--?"
   ], 
   [
      "Then we have run all this way for  nothing? Are we to leave those poor  Hobbits here in this horrid, dark,  dank tree-infested--?", 
      "I mean, charming...quite charming forest."
   ], 
   [
      "You still speak in riddles.", 
      "Strong?!  Oh, that’s good."
   ], 
   [
      "Merry and Pippin are quite safe. In  fact, they are far safer than you are  about to be.", 
      "This new Gandalf’s more grumpy than  the old one."
   ], 
   [
      "Your words are poison.", 
      "You’d find more cheer in a graveyard."
   ], 
   [
      "...too long have you sat in the shadows.", 
      "I would stay still if I were you."
   ], 
   [
      "Helm’s Deep. They flee to the mountains when they should stand and fight.", 
      "Who will defend them if not their king?   He’s only doing what he thinks is best for his people. Helm’s Deep has saved them in the past."
   ], 
   [
      "It’s the beards.", 
      "And this, in turn, has given rise to the belief that there are no Dwarf women, and that Dwarves just spring out of holes in the ground..."
   ], 
   [
      "And this, in turn, has given rise to the belief that there are no Dwarf women, and that Dwarves just spring out of holes in the ground...", 
      "...which is of course ridiculous."
   ], 
   [
      "...which is of course ridiculous.", 
      "It’s all right. Nobody panic. That was deliberate. It was deliberate."
   ], 
   [
      "Gimli.", 
      "No, I couldn’t. I really couldn’t."
   ], 
   [
      "All riders to the head of the column!", 
      "Come on!"
   ], 
   [
      "Come on!", 
      "You must lead the people to Helm’s Deep, and make haste."
   ], 
   [
      "Follow me!", 
      "Make for the lower ground!"
   ], 
   [
      "GIMLI  That’s it! Go on!", 
      "Bring your pretty face to my axe!"
   ], 
   [
      "Bring your pretty face to my axe!", 
      "Stinking creature."
   ], 
   [
      "Stinking creature.", 
      "Aragorn!"
   ], 
   [
      "Aragorn?", 
      "Tell me what happened and I will ease your passing."
   ], 
   [
      "We have paid for it with many lives.", 
      "My lady."
   ], 
   [
      "Lord Aragorn ... where is he?", 
      "He fell."
   ], 
   [
      "Mae carnen, Brego, mellon nîn.", 
      "You are the luckiest, the canniest and the most reckless man I ever knew!"
   ], 
   [
      "We will cover the causeway and the gate from above. No army has ever breached the Deeping Wall or set foot inside the Hornburg!", 
      "This is no rabble of mindless Orcs."
   ], 
   [
      "Farmer, farriers, stable boys. These are no soldiers.", 
      "Or too few."
   ], 
   [
      "Then I shall die as one them!", 
      "Let him go, lad. Let him be."
   ], 
   [
      "Ú-moe edhored, Legolas.", 
      "We had time, I’d get this adjusted."
   ], 
   [
      "We are proud to fight alongside Men once more.", 
      "Well lad, whatever luck you live by, let’s hope it lasts the night."
   ], 
   [
      "Your friends are with you, Aragorn.", 
      "Let’s hope they last the night."
   ], 
   [
      "Show them no mercy ... for you shall receive none!", 
      "What’s happening out there?"
   ], 
   [
      "Leithio i philinn!", 
      "Did they hit anything?"
   ], 
   [
      "Fire!", 
      "Send them to me! Come on!"
   ], 
   [
      "Swords! Swords!", 
      "Legolas! Two already!"
   ], 
   [
      "I’m on seventeen!", 
      "I’ll have no pointy-ear outscoring me!"
   ], 
   [
      "EXT. HELM’S DEEP BATTLEMENTS - NIGHT  HIGH OVERHEAD ANGLE ON: The URUK-HAI rush throw the destroyed section of the DEEPING WALL.  ANGLE ON: ARAGORN slowly comes to his feet...GIMLI, still atop the wall, sees ARAGORN’S peril.     GIMLI jumps off the wall and lands in the sea of URUK-HAI. He fights them off, but is soon overpowered.     ARAGORN commands the ELVES behind him.        ANGLES ON: The VOLLEY OF ARROWS fells many URUK-HAI, but many more follow in their wake.  ANGLE ON: ARAGORN holds his sword at the ready.        The ELVES charge the approaching URUK-HAI. When contact is  made, ground is neither lost nor gained. ARAGORN and the ELVES valiantly battle the URUK-HAI with much success.  ANGLE ON: ARAGORN reaches below the surface of the water and pulls GIMLI to the surface. He coughs and sputters. ARAGORN  drags him to temporary safety.  WIDE ON: The ELVES and URUK-HAI continue their battle at the gap in the DEEPING WALL.", 
      "Aragorn!"
   ], 
   [
      "To the Keep!", 
      "Na barad!"
   ], 
   [
      "Gimli!", 
      "Come on. We can take them."
   ], 
   [
      "It’s a long way.", 
      "Toss me."
   ], 
   [
      "What?", 
      "Oh...don’t tell the Elf."
   ], 
   [
      "Oh...don’t tell the Elf.", 
      "Not a word."
   ], 
   [
      "For death and glory.", 
      "The sun is rising."
   ], 
   [
      "Yes. Yes. The horn of Helm Hammerhand shall sound in the deep one last time!", 
      "Yes!"
   ], 
   [
      "Final count...42.", 
      "Forty-two? That’s not bad for a  pointy-eared Elvish princeling. I  myself am sitting pretty on 43."
   ], 
   [
      "Forty-three.", 
      "He was already dead."
   ], 
   [
      "He was twitching.", 
      "He was twitching because he’s got my axe buried in his nervous system."
   ]
]
 }