{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "EXT. PLAINS OF ROHAN - DAY  CRANE DOWN TO: A BAND OF URUK-HAI runs across ROHAN. MERRY and PIPPIN, ride on the backs of two URUK-HAI, their hands bound around the URUK-HAIS’ necks.   ANGLE ON: PIPPIN tries to call to MERRY, who is unconscious  with a gash on his brow.     MERRY does not respond.   ANGLE ON: SUDDENLY, the leading URUK-HAI, MAÚHUR, signals a  stop. He sniffs the air.  ANGLE ON: Several Orcs from the North emerge from behind some rocks. They are led by a short, crook-legged Orc, very broad with long arms that hang almost to the ground called GRISHNÁKH.      ANGLE ON: UGLÚK looks at MAÚHUR amused.     ANGLE ON: GRISHNÁKH’S face falls.       UGLÚK turns away from the Northern Orcs.  ANGLE ON: GRISHNÁKH mocks him as he walks away, but they make  no move on the URUK-HAI.  ANGLE ON: PIPPIN tries again to rouse MERRY.     ANGLE ON: MERRY’S head lolls around, unresponsive. PIPPIN looks over to an Orc drinking his draught.", 
      "Merry! Merry!"
   ], 
   [
      "Saruman will have his prize. We will  deliver them.", 
      "Merry! Merry? Wake up."
   ], 
   [
      "Merry! Merry? Wake up.", 
      "My friend is sick."
   ], 
   [
      "My friend is sick.", 
      "He needs water. Please!"
   ], 
   [
      "Sick, is he? Give him some medicine,  boys!", 
      "Stop it!"
   ], 
   [
      "Can’t take his draught!", 
      "Leave him alone!"
   ], 
   [
      "UGLÚK  Then keep your mouth shut.", 
      "Merry."
   ], 
   [
      "Hello, Pip.", 
      "You’re hurt."
   ], 
   [
      "They've picked up our trail.", 
      "Aragorn!"
   ], 
   [
      "We’re not going no further till we’ve had a breather.", 
      "Merry! Merry!"
   ], 
   [
      "EXT. FANGORN FOREST - NIGHT  ANGLES ON: A group of ORCS chops down the trees inside the  Forest for firewood.   ON THE SOUNDTRACK: Low groans and rumbles issue from the  forest.  EXT. BORDERS OF FANGORN - NIGHT  ANGLE ON: PIPPIN turns to MERRY with fear.     MERRY looks toward the forest. He smiles.                   ON THE SOUNDTRACK: Another groan issues from the Forest.      ANGLE ON: An URUK-HAI stares at a piece of bread, and then throws it to the ground.       ANGLE ON: AN ORC looks up in agreement.", 
      "What’s making that noise?"
   ], 
   [
      "It’s the trees.", 
      "What?"
   ], 
   [
      "Do you remember the Old Forest, on the borders of Buckland? Folk used to say there was something in the water that made the trees grow tall...and come alive.", 
      "Trees that could whisper, talk to each other, even move."
   ], 
   [
      "They have something. An Elvish weapon.  The master wants it for the war.", 
      "As soon as they find out we don’t,  we’re dead."
   ], 
   [
      "...into Fangorn Forest.", 
      "Did we lose him? I think we lost him."
   ], 
   [
      "Trees. Climb a tree.", 
      "Merry!"
   ], 
   [
      "A tree-herder. A shepherd of the forest.", 
      "Don’t talk to it, Merry. Don’t  encourage it!"
   ], 
   [
      "TREEBEARD, some call me.", 
      "And whose side are you on?"
   ], 
   [
      "Maybe you are and maybe you aren’t. The White Wizard will know.", 
      "The White Wizard?"
   ], 
   [
      "I had the loveliest dream last  night. There was this large barrel,  full of pipe-weed. And we smoked  all of it. And then...you were sick.", 
      "I’d give anything for a whiff of Old Toby."
   ], 
   [
      "You’re taller.", 
      "Who?"
   ], 
   [
      "Than me!", 
      "I’ve always been taller than you."
   ], 
   [
      "Pippin, everyone knows I’m the  tall one. You’re the short one.", 
      "Please, Merry. You’re what?  Three-foot-six? At the most?"
   ], 
   [
      "Please, Merry. You’re what?  Three-foot-six? At the most?", 
      "Whereas me, I’m pushing 3’7”."
   ], 
   [
      "Whereas me, I’m pushing 3’7”.", 
      "MERRY Three-foot-eight."
   ], 
   [
      "MERRY Three-foot-eight.", 
      "Merry don’t! Don’t drink it!"
   ], 
   [
      "Merry don’t! Don’t drink it!", 
      "Merry! No, Treebeard said that you  shouldn’t have any."
   ], 
   [
      "I want some!", 
      "It could well be dangerous!"
   ], 
   [
      "It could well be dangerous!", 
      "Give me it back. Merry!"
   ], 
   [
      "It’s got my leg!", 
      "Help!"
   ], 
   [
      "Come, the forest is waking up. It  isn’t safe.", 
      "Why are there so few of you when you  have lived so long? Are there Ent  children?"
   ], 
   [
      "Why is that?", 
      "Oh, I’m sorry. How did they die?"
   ], 
   [
      "Can’t say that I have. You, Pip?", 
      "What do they look like?"
   ], 
   [
      "There will be no dawn for Men.", 
      "There is always smoke rising from Isengard these days."
   ], 
   [
      "But now he has a mind of metal and wheels. He no longer cares for growing things.", 
      "What is it?"
   ], 
   [
      "Nineteen!", 
      "TREEBEARD We have just agreed."
   ], 
   [
      "I have told your names to the Entmoot and we have agreed ... you are not Orcs.", 
      "Well, that’s good news."
   ], 
   [
      "You are young and brave, Master Merry. But your part in this tale is over. Go back to your home.", 
      "Maybe Treebeard’s right. We don’t belong here, Merry. It's too big for  us. What can we do in the end? We've  got the Shire. Maybe we should go  home."
   ], 
   [
      "I will leave you at the western borders of the forest. You can make your way north to your homeland from there.", 
      "Turn around. Turn around. Take us south!"
   ], 
   [
      "Are you mad? We’ll be caught.", 
      "No we won’t. Not this time."
   ], 
   [
      "And a little family of field mice that climb up sometimes, and they tickle me awfully. They’re always trying to get somewhere where they...", 
      "I’m sorry, Treebeard."
   ], 
   [
      "There is no curse in Elvish, Entish or the tongues of Men for this treachery.", 
      "Look! The trees! They’re moving!"
   ], 
   [
      "He was twitching because he’s got my axe buried in his nervous system.", 
      "Not too happy at all, Merry."
   ], 
   [
      "Not too happy at all, Merry.", 
      "Oh, yes, it’s a quality establishment. I hear the staff are very good."
   ], 
   [
      "Nothing. The world’s back to normal, that’s all.", 
      "No, it isn’t. I’m starving."
   ], 
   [
      "Saruman’s storeroom!", 
      "I don’t believe it."
   ], 
   [
      "It is!", 
      "Longbottom Leaf."
   ], 
   [
      "The finest pipe-weed in South Farthing.", 
      "It’s perfect. One barrel each."
   ], 
   [
      "It’s perfect. One barrel each.", 
      "Wait. Do you think we should share it  with Treebeard?"
   ], 
   [
      "Could be a distant relative.", 
      "I get it. Don’t be hasty."
   ]
]
 }