{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "CUT TO:", 
      "Théodred.  Find the king’s son!"
   ], 
   [
      "Mordor will pay for this.", 
      "These Orcs are not from Mordor."
   ], 
   [
      "My Lord Éomer, over here!", 
      "He’s alive."
   ], 
   [
      "Your son is badly wounded, my lord.", 
      "He was ambushed by Orcs."
   ], 
   [
      "He was ambushed by Orcs.", 
      "That is a lie."
   ], 
   [
      "My son... Gríma...", 
      "Orcs are running freely across our lands. Unchecked. Unchallenged. Killing at will. Orcs bearing the White Hand of Saruman."
   ], 
   [
      "Why do you lay these troubles on an already troubled mind? Can you not see? Your uncle is wearied by your malcontent, your warmongering.", 
      "Warmongering?"
   ], 
   [
      "Warmongering?", 
      "How long is it since Saruman bought you? What was the promised price, Gríma? When all the Men are dead, you will take your share of the treasure?"
   ], 
   [
      "How long is it since Saruman bought you? What was the promised price, Gríma? When all the Men are dead, you will take your share of the treasure?", 
      "Too long have you watched my sister.  Too long have you haunted her steps."
   ], 
   [
      "You are banished forthwith from the kingdom of Rohan and all its domains under pain of death.", 
      "You have no authority here. Your  orders mean nothing."
   ], 
   [
      "A red sun rises. Blood has been  spilled this night.", 
      "What business does an Elf, a Man and a Dwarf have in the Riddermark? Speak quickly!"
   ], 
   [
      "Give me your name, horse-master, and I shall give you mine.", 
      "I would cut off your head, beard and all, Master Dwarf, if it stood but a little higher from the ground."
   ], 
   [
      "You would die before your stroke fell.", 
      "Théoden no longer recognizes friend  from foe."
   ], 
   [
      "Théoden no longer recognizes friend  from foe.", 
      "Not even his own kin."
   ], 
   [
      "Not even his own kin.", 
      "Saruman has poisoned the mind of the king and claimed lordship over these lands. My company are those loyal to Rohan. And for that, we are banished.    The White Wizard is cunning. He walks here and there, they say, as an old man hooded and cloaked. And everywhere, his spies slip past our nets."
   ], 
   [
      "We are no spies. We track a party of Uruk-Hai westward across the plain. They have taken two of our friends captive.", 
      "The Uruks are destroyed. We slaughtered them during the night."
   ], 
   [
      "They would be small. Only children to your eyes.", 
      "Dead?"
   ], 
   [
      "Dead?", 
      "I am sorry."
   ], 
   [
      "I am sorry.", 
      "Hasufel! Arod!"
   ], 
   [
      "Hasufel! Arod!", 
      "May these horses bear you to better fortune than their former masters. Farewell."
   ], 
   [
      "May these horses bear you to better fortune than their former masters. Farewell.", 
      "Look for your friends. But do not trust to hope. It has forsaken these lands.   We ride north!"
   ], 
   [
      "Not alone.", 
      "Rohirrim!"
   ], 
   [
      "Éomer.", 
      "To the king!"
   ], 
   [
      "Then it is forfeit. Release them.", 
      "Stay out of the forest! Keep away from the trees!"
   ]
]
 }