{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "BLACK SCREEN.  SUPER: New Line Cinema Presents  SUPER: A Wingnut Films Production  SUPER: THE LORD OF THE RINGS  FADE IN ON:  EXT. THE MISTY MOUNTAINS - DAY  HIGH WIDE AERIAL ON: CAMERA flies over the snow-covered peaks of the Misty Mountains. As the tranquillity of the scene sinks in, voices disrupt the peacefulness.        ON THE SOUNDTRACK: A faint crash sounds over the landscape.      PAN CLOSER TO THE SIDE OF THE MOUNTAINS.       TRACK THROUGH THE SIDE OF THE MOUNTAIN TO:  INT. BRIDGE OF KHAZAD-DÛM, MORIA - DAY  WIDE ON: The BALROG slashes at GANDALF with its SWORD OF FLAME ...GANDALF blocks with GLAMDRING ... a ringing clash and the BALROG’S SWORD SHATTERS into MOLTEN FRAGMENTS!            The BALROG places one foot onto the bridge.", 
      "You cannot pass!"
   ], 
   [
      "Gandalf!", 
      "I am the servant of the Secret Fire, wielder of the Flame of Anor!"
   ], 
   [
      "I am the servant of the Secret Fire, wielder of the Flame of Anor!", 
      "Go back to the Shadow. The dark fire will not avail you, flame of Udûn!"
   ], 
   [
      "Go back to the Shadow. The dark fire will not avail you, flame of Udûn!", 
      "2."
   ], 
   [
      "Forgive me. I mistook you for Saruman.", 
      "I am Saruman. Or rather, Saruman as he  should have been."
   ], 
   [
      "You fell.", 
      "Through fire and water."
   ], 
   [
      "Through fire and water.", 
      "Until at last, I threw down my enemy and smote his ruin upon the mountainside."
   ], 
   [
      "Until at last, I threw down my enemy and smote his ruin upon the mountainside.", 
      "Stars wheeled overhead and every day was as long as a life age of the Earth."
   ], 
   [
      "Stars wheeled overhead and every day was as long as a life age of the Earth.", 
      "...until my task is done."
   ], 
   [
      "...until my task is done.", 
      "Gandalf? Yes.   That's what they used to call me."
   ], 
   [
      "Gandalf? Yes.   That's what they used to call me.", 
      "Gandalf the Grey. That was my name."
   ], 
   [
      "Gandalf.", 
      "I am Gandalf the White."
   ], 
   [
      "I am Gandalf the White.", 
      "And I come back to you now at the turn of the tide."
   ], 
   [
      "Edoras? That is no short distance!", 
      "Yes, and it will not be easily cured."
   ], 
   [
      "I mean, charming...quite charming forest.", 
      "It was more than mere chance that brought Merry and Pippin to Fangorn. A great power has been sleeping here for many long years. The coming of Merry and Pippin will be like the falling of small stones that starts an avalanche in the mountains."
   ], 
   [
      "Strong?!  Oh, that’s good.", 
      "So stop your fretting, Master Dwarf."
   ], 
   [
      "So stop your fretting, Master Dwarf.", 
      "Merry and Pippin are quite safe. In  fact, they are far safer than you are  about to be."
   ], 
   [
      "That is one of the Mearas, unless my eyes are cheated by some spell.", 
      "CUT TO:"
   ], 
   [
      "Sleep, little Shirelings. Heed no  nightly noise. Sleep till morning light.", 
      "The veiling shadow that glowers in the  east takes shape. Sauron will suffer no  rival. From the summit of Barad-dûr, his  Eye watches ceaselessly. But he is not  so mighty yet that he is above fear.  Doubt ever gnaws at him. The rumor has  reached him. The heir of Númenor still  lives."
   ], 
   [
      "The veiling shadow that glowers in the  east takes shape. Sauron will suffer no  rival. From the summit of Barad-dûr, his  Eye watches ceaselessly. But he is not  so mighty yet that he is above fear.  Doubt ever gnaws at him. The rumor has  reached him. The heir of Númenor still  lives.", 
      "Sauron fears you, Aragorn. He fears  what you may become."
   ], 
   [
      "Sauron fears you, Aragorn. He fears  what you may become.", 
      "The Ring remains hidden."
   ], 
   [
      "The Ring remains hidden.", 
      "And that we should seek to destroy it  has not yet entered their darkest dreams."
   ], 
   [
      "And that we should seek to destroy it  has not yet entered their darkest dreams.", 
      "And so the weapon of the enemy is moving  towards Mordor in the hands of a Hobbit.  Each day brings it closer to the fires  of Mount Doom. We must trust now in Frodo.  Everything depends upon speed and the  secrecy of his quest."
   ], 
   [
      "And so the weapon of the enemy is moving  towards Mordor in the hands of a Hobbit.  Each day brings it closer to the fires  of Mount Doom. We must trust now in Frodo.  Everything depends upon speed and the  secrecy of his quest.", 
      "Do not regret your decision to leave  him. Frodo must finish this task alone."
   ], 
   [
      "He’s not alone. Sam went with him.", 
      "Did he? Did he, indeed? Good."
   ], 
   [
      "Did he? Did he, indeed? Good.", 
      "CUT TO:"
   ], 
   [
      "EXT. PLAINS OF ROHAN - DAY  ANGLE ON: GANDALF, ARAGORN, LEGOLAS, and GIMLI ride across the Plains. They stop on a rise looking across to EDORAS  WIDE ON: The FOUR FIGURES look upon a walled city covering a small mountain. Atop its summit is MEDUSELD.      INT. MEDUSELD THRONE ROOM - DAY  HIGH WIDE ON: THÉODEN, grayed and ancient, sits upon his throne, head bowed for he is hardly able to hold it up. ÉOWYN kneels beside him, holding his hand comfortingly.       CLOSE ON: ÉOWYN gently strokes the KING’S HAND.     ANGLE ON: ÉOWYN looks at THÉODEN, tearfully, when he fails to respond.     ANGLE ON: THÉODEN stares forward a moment. His eyes are clouded, as if blind. Slowly he moves his eyes to look at her, but he remains expressionless.       THÉODEN continues to look at her, blankly.", 
      "Edoras and the Golden Hall of Meduseld. There dwells Théoden, King of Rohan..."
   ], 
   [
      "EXT. PLAINS OF ROHAN - DAY  ANGLE ON: The THREE HUNTERS sit atop their steeds, listening to GANDALF.      GANDALF starts off. The THREE HUNTERS follow him to EDORAS.  INT. MEDUSELD, THÉODRED’S ROOM - DAY  ANGLE ON: THÉODRED lies dead upon his bed.   ANGLE ON: ÉOWYN kneels beside him, weeping.   ANGLE ON: A shadow moves in the hall behind her. She pays it no mind. WORMTONGUE appears at the door. He looks upon her, concerned.       He sits on the bed and puts a hand on ÉOWYN’S shoulder.       ÉOWYN jumps up and throws off his hand.     She backs away from him. WORMTONGUE rises and moves over to her.", 
      "Be careful what you say. Do not look  for welcome here."
   ], 
   [
      "I cannot allow you before Théoden King so armed, Gandalf Greyhame. By order of Gríma Wormtongue.", 
      "You would not part an old man from his walking stick."
   ], 
   [
      "He’s a herald of woe.", 
      "He’s not welcome."
   ], 
   [
      "Late is the hour in which this conjurer chooses to appear. Láthspell spell I name him. Ill news is an ill guest.", 
      "Be silent."
   ], 
   [
      "Be silent.", 
      "Keep your forked tongue behind your teeth. I have not passed through fire and death to bandy crooked words with a witless worm."
   ], 
   [
      "His staff.", 
      "Théoden, son of Thengel..."
   ], 
   [
      "Théoden, son of Thengel...", 
      "...too long have you sat in the shadows."
   ], 
   [
      "I would stay still if I were you.", 
      "Hearken to me!"
   ], 
   [
      "Hearken to me!", 
      "I release you from the spell."
   ], 
   [
      "I will draw you, Saruman, as poison is drawn from a wound.", 
      "Wait."
   ], 
   [
      "If I go, Théoden dies.", 
      "You did not kill me, you will not kill him."
   ], 
   [
      "Rohan is mine.", 
      "Be gone."
   ], 
   [
      "Gandalf?", 
      "Breathe the free air again, my friend."
   ], 
   [
      "Dark have been my dreams of late.", 
      "Your fingers would remember their  old strength better if they grasped your sword."
   ], 
   [
      "Now it shall cover the grave of my son.  Alas that these evil days should be mine. The young perish and the old linger. That I should live to see the last days of my house.", 
      "Théodred’s death was not of your making."
   ], 
   [
      "No parent should have to bury their  child.", 
      "His was strong in life. His spirit will find its way to the halls of your fathers."
   ], 
   [
      "His was strong in life. His spirit will find its way to the halls of your fathers.", 
      "Westu hál. Ferðu, Théodred, Ferðu."
   ], 
   [
      "Where’s mama?", 
      "This is but a taste of the terror that Saruman will unleash. All the more potent for he is driven now by fear of Sauron. Ride out and meet him head on."
   ], 
   [
      "This is but a taste of the terror that Saruman will unleash. All the more potent for he is driven now by fear of Sauron. Ride out and meet him head on.", 
      "Draw him away from your women and children. You must fight."
   ], 
   [
      "When last I looked, Théoden, not Aragorn, was king of Rohan.", 
      "Then what is the king’s decision?"
   ], 
   [
      "Who will defend them if not their king?   He’s only doing what he thinks is best for his people. Helm’s Deep has saved them in the past.", 
      "There is no way out of that ravine. Théoden is walking into a trap. He thinks he’s leading them to safety. What they will get is a massacre."
   ], 
   [
      "There is no way out of that ravine. Théoden is walking into a trap. He thinks he’s leading them to safety. What they will get is a massacre.", 
      "Théoden has a strong will, but I fear for him. I fear for the survival of Rohan. He will need you before the end, Aragorn. The people of Rohan will need you. The defenses have to hold."
   ], 
   [
      "The Grey Pilgrim. That’s what they used to call me. Three hundred lives of Men I’ve walked this earth, and now I have no time.", 
      "With luck, my search will not be in vain. Look to my coming at first light on the fifth day. At dawn, look to the east."
   ], 
   [
      "Gandalf.", 
      "Not alone."
   ], 
   [
      "Very decent of you. Very decent, indeed, Gollum.", 
      "Sauron’s wrath will be terrible, his retribution swift."
   ], 
   [
      "Sauron’s wrath will be terrible, his retribution swift.", 
      "...somewhere in the wilderness."
   ]
]
 }