{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "You cannot pass!", 
      "Gandalf!"
   ], 
   [
      "2.", 
      "Gandalf!"
   ], 
   [
      "Gandalf!", 
      "No!"
   ], 
   [
      "No!", 
      "Gandalf!"
   ], 
   [
      "Gandalf!", 
      "Gandalf!"
   ], 
   [
      "Nothing.", 
      "Just a dream."
   ], 
   [
      "Just a dream.", 
      "4."
   ], 
   [
      "Can you see the bottom?", 
      "No! Don’t look down, Sam! Just keep  going!"
   ], 
   [
      "Catch it! Grab it, Mr. Frodo!", 
      "I think I’ve found the bottom."
   ], 
   [
      "5.", 
      "What’s in this?"
   ], 
   [
      "Nothing. Just a bit of seasoning.  I thought maybe if we was having a  roast chicken one night or something.", 
      "Roast chicken?!"
   ], 
   [
      "It’s very special, that. It’s the best  salt in all the Shire.", 
      "It is special."
   ], 
   [
      "It is special.", 
      "We can’t leave this here for someone  to follow us down."
   ], 
   [
      "I don’t think Gandalf meant for us to come this way.", 
      "He didn’t mean for a lot of things to happen, Sam ... but they did."
   ], 
   [
      "SAM  It’s the Ring, isn’t it?", 
      "It’s getting heavier."
   ], 
   [
      "This looks strangely familiar.", 
      "It’s because we’ve been here before. We’re going in circles."
   ], 
   [
      "It’s because we’ve been here before. We’re going in circles.", 
      "Yes. I can smell it."
   ], 
   [
      "Yes. I can smell it.", 
      "CUT TO:"
   ], 
   [
      "Where is it? They stole it from us. My precious. Curse them, we hates them! It’s ours, it is, and we wants it!", 
      "This is Sting. You’ve seen it before, haven’t you ... Gollum?"
   ], 
   [
      "This is Sting. You’ve seen it before, haven’t you ... Gollum?", 
      "Release him or I’ll cut your throat!"
   ], 
   [
      "We swears to do what you wants. We swears.", 
      "There’s no promise you can make that I can trust."
   ], 
   [
      "We swears to serve the master of the precious. We will swear on the...on the precious.    Gollum. Gollum.", 
      "The Ring is treacherous. It will hold you to your word."
   ], 
   [
      "I don’t believe you!", 
      "He’s trying to trick us! If we let him go he’ll throttle us in our sleep."
   ], 
   [
      "He’s trying to trick us! If we let him go he’ll throttle us in our sleep.", 
      "You know the way to Mordor?"
   ], 
   [
      "Yes.", 
      "You’ve been there before?"
   ], 
   [
      "Yes.", 
      "You will lead us to the Black Gate."
   ], 
   [
      "We are famished! Yes! Famished we are,  precious!", 
      "Here."
   ], 
   [
      "Once it takes hold of us, it never lets go.", 
      "Don’t touch me!"
   ], 
   [
      "Frodo!", 
      "Don’t follow the lights."
   ], 
   [
      "Don’t follow the lights.", 
      "Gollum!"
   ], 
   [
      "FRODO What did you say?", 
      "Who are you?"
   ], 
   [
      "Mustn’t ask us. Not its business.  Gollum. Gollum.", 
      "Gandalf told me you were one of the river-folk."
   ], 
   [
      "Cold be heart and hand and bone Cold be travelers far from home", 
      "He said your life was a sad story."
   ], 
   [
      "They do not see what lies ahead,    when sun has failed and moon is dead.", 
      "You were not so very different from a Hobbit once. Were you?"
   ], 
   [
      "What did you call me?", 
      "That was your name once, wasn’t it?  A long time ago."
   ], 
   [
      "Master says to show him the way into Mordor. So good Sméagol does, master says so.", 
      "I did."
   ], 
   [
      "I can see a way down.", 
      "Master!"
   ], 
   [
      "I know, Mr. Frodo. I doubt even these Elvish cloaks will hide us in there.", 
      "Now!"
   ], 
   [
      "He’s up to something.", 
      "Are you saying there’s another way into Mordor?"
   ], 
   [
      "Yes. There’s a path...and some stairs... and then...a tunnel.", 
      "He’s led us this far, Sam."
   ], 
   [
      "He’s led us this far, Sam.", 
      "He’s been true to his word."
   ], 
   [
      "He’s been true to his word.", 
      "Lead the way, Sméagol."
   ], 
   [
      "Hey, stinker, don’t go getting too far ahead!", 
      "Why do you do that?"
   ], 
   [
      "What?", 
      "Call him names. Run him down all the time."
   ], 
   [
      "Because. Because that's what he is, Mr. Frodo. There's naught left in him but lies and deceit. It's the Ring he wants. It's all he cares about.", 
      "I want to help him, Sam."
   ], 
   [
      "I want to help him, Sam.", 
      "Because I have to believe he can come back."
   ], 
   [
      "You can’t save him, Mr. Frodo.", 
      "What do you know about it? Nothing!"
   ], 
   [
      "What do you know about it? Nothing!", 
      "I'm sorry, Sam. I don't know why I  said that."
   ], 
   [
      "I know what I have to do Sam. The Ring was entrusted to me. It's my task. Mine! My own!", 
      "Can't you hear yourself? Don't you know who you sound like?"
   ], 
   [
      "No one at home will believe this.", 
      "We’ve lingered here too long."
   ], 
   [
      "We’ve lingered here too long.", 
      "Come on, Sam."
   ], 
   [
      "There are no travelers in this land. Only servants of the Dark Tower.", 
      "We are bound to an errand of secrecy."
   ], 
   [
      "We are bound to an errand of secrecy.", 
      "The enemy?"
   ], 
   [
      "That gangrel creature. He had an ill- favored look.", 
      "There was no other."
   ], 
   [
      "There was no other.", 
      "We set out from Rivendell with seven companions."
   ], 
   [
      "We set out from Rivendell with seven companions.", 
      "One we lost in Moria, two were my kin, a Dwarf there was also, and an Elf. And two Men, Aragorn, son of Arathorn, and Boromir of Gondor."
   ], 
   [
      "You’re a friend of Boromir?", 
      "Yes... for my part."
   ], 
   [
      "Yes... for my part.", 
      "Dead? How? When?"
   ], 
   [
      "Dead? How? When?", 
      "If something has happened to Boromir, we would have you tell us."
   ], 
   [
      "Shall I shoot?", 
      "Wait!"
   ], 
   [
      "Wait!", 
      "This creature is bound to me. And I to him."
   ], 
   [
      "This creature is bound to me. And I to him.", 
      "He is our guide.   Please ... let me go down to him."
   ], 
   [
      "He is our guide.   Please ... let me go down to him.", 
      "Master is here."
   ], 
   [
      "Master is here.", 
      "Come, Sméagol. Trust master. Come!"
   ], 
   [
      "We must go now?", 
      "Come Sméagol. Nice Sméagol. That’s it. Come on."
   ], 
   [
      "Come Sméagol. Nice Sméagol. That’s it. Come on.", 
      "Don’t hurt him! Sméagol don’t struggle! Sméagol listen to me!"
   ], 
   [
      "You can do it. Use the Ring, Mr. Frodo. Just this once. Put it on. Disappear.", 
      "I can’t. You were right, Sam. You tried to tell me but ... I’m sorry. The Ring’s taking me, Sam.   If I put it on, he’ll find me. He’ll see."
   ], 
   [
      "A chance for Faramir, captain of Gondor, to show his quality.", 
      "No!!"
   ], 
   [
      "Hurry.", 
      "CUT TO:"
   ], 
   [
      "Faramir, Orcs have taken the eastern shore. Their numbers are too great. By nightfall we will be overrun.", 
      "It’s calling to him, Sam. His Eye is almost on me."
   ], 
   [
      "They’re here.", 
      "They’ve come."
   ], 
   [
      "Where are you going?!", 
      "I can’t do this, Sam."
   ], 
   [
      "Folk in those stories had lots of chances of turning back only they didn’t. They kept going because they were holding on to something.", 
      "What are we holding on to, Sam?"
   ], 
   [
      "What road will you take once you reach  the woods?", 
      "Gollum says there’s a path near Minas  Morgul that climbs up into the  mountains."
   ], 
   [
      "Go, Frodo. Go with the goodwill of all Men.", 
      "Thank you."
   ], 
   [
      "I wonder if we’ll ever be put into songs or tales.", 
      "What?"
   ], 
   [
      "I wonder if people will ever say,“Let’s hear about Frodo and the Ring.” And they’ll say “Yes, that’s one of my favorite stories. Frodo was really courageous, wasn’t he, dad.” “Yes, my boy, the most famousest of Hobbits. And that’s saying a lot.”", 
      "Well, you’ve left out one of the chief characters: “Samwise the Brave.” I want to hear more about Sam."
   ], 
   [
      "Well, you’ve left out one of the chief characters: “Samwise the Brave.” I want to hear more about Sam.", 
      "Frodo wouldn’t have got far without Sam."
   ], 
   [
      "Frodo wouldn’t have got far without Sam.", 
      "So was I."
   ], 
   [
      "“Samwise the Brave.”", 
      "Sméagol!"
   ], 
   [
      "Where is he? Where’s he gone? Hey, Gollum! Where are you?", 
      "Sméagol?"
   ]
]
 }