{ "lines" :  
[
   [
      "You enjoying this?", 
      "You know I am, love."
   ], 
   [
      "Suddenly Aldous is peeing on the Prostitute.", 
      "I like that alright... what the bloody shit?"
   ], 
   [
      "Aldous THROWS UP on the prostitute and COLLAPSES.", 
      "You piece of shit!"
   ], 
   [
      "One moment of peace, can he not give  us that?", 
      "Where is he? Where is Gondor’s finest? Where’s my first-born?"
   ], 
   [
      "Father!", 
      "They say you vanquished the enemy  almost single-handedly."
   ], 
   [
      "They exaggerate. The victory belongs to Faramir also.", 
      "Oh, too few. You let the enemy walk in and take it on a whim."
   ], 
   [
      "Oh, too few. You let the enemy walk in and take it on a whim.", 
      "Always you cast a poor reflection on me."
   ], 
   [
      "He loves you, Father.", 
      "Do not trouble me with Faramir ... I know his uses, and they are few."
   ], 
   [
      "The One Ring ... Isildur’s Bane.", 
      "It has fallen into the hands of the  Elves. Everyone will try to claim it:  Men, Dwarves, wizards. We cannot let  that happen. This thing must come to  Gondor."
   ], 
   [
      "Gondor.", 
      "It’s dangerous, I know. Ever the Ring  will seek to corrupt the hearts of  lesser Men. But you, you are strong...  and our need is great. It is our blood  which is being spilled, our people who  are dying. Sauron is biding his time.  He’s massing fresh armies. He will  return. And when he does, we will be powerless to stop him. You must go.  Bring me back this mighty gift."
   ], 
   [
      "It’s dangerous, I know. Ever the Ring  will seek to corrupt the hearts of  lesser Men. But you, you are strong...  and our need is great. It is our blood  which is being spilled, our people who  are dying. Sauron is biding his time.  He’s massing fresh armies. He will  return. And when he does, we will be powerless to stop him. You must go.  Bring me back this mighty gift.", 
      "Would you deny your own father?"
   ], 
   [
      "If there is a need to go to Rivendell, send me in his stead.", 
      "I trust this mission only to your brother. The one who will not fail me."
   ]
]
 }