{ "lines" :  
[
   [
      "VIDEO OF ALDOUS’S FATHER, JONATHAN SNOW:", 
      "I wish my son all the best."
   ], 
   [
      "The Blackjack Dealer looks up.", 
      "Aldy?"
   ], 
   [
      "Hey, father.", 
      "Ay!  Ay!  Everyone look ‘ere it’s my son, famous rocker Aldy Snow."
   ], 
   [
      "Jonathan, Aldous and Aaron walk out of the casino.", 
      "You want to hit Morton’s, grab some steaks?  You’re buying!  Cause you’re the famous rocker, not me!"
   ], 
   [
      "Still a vegetarian, dad.", 
      "Except when it comes to the female persuasion.  Then you’re a proper carnivore.  So if you’re not going to gamble or go to a steakhouse, what do you gents feel like doing this evening?  You feel like a having proper night out?"
   ], 
   [
      "No.", 
      "Well, I’ve got just the thing.  This is going to blow your minds."
   ], 
   [
      "Oh, I knew he was going to say that!", 
      "What did I tell you?"
   ], 
   [
      "Aaron is peeing.  Jonathan walks in and goes up to the urinal  *right next to Aaron.", 
      "I have a gun."
   ], 
   [
      "ANGLE ON Jonathan AND ALDOUS.", 
      "It’s been a long time since we’ve done something like this.  Remember Bangkok?"
   ], 
   [
      "How could I forget?", 
      "I just want to say it wasn’t correct of me to write an unauthorized about you.  That’s not good parenting."
   ], 
   [
      "I was a bastard to you, I realize that now.", 
      "How could you not be?  I was never around when you were a kid."
   ], 
   [
      "Mum wasn’t the easiest person to live with and what with me in and out of juvey --", 
      "Still no excuse.  You were just a boy."
   ], 
   [
      "Water under the bridge.  Life is too short.  We all make mistakes.  The biggest mistake is not forgiving.", 
      "It’s good to see you, boy.  It really is."
   ], 
   [
      "Well let me just say that I did not complete the sex!  So there!  I am high and I am not enjoying this sensation!  My heart is going like crazy!", 
      "Why is jewboy talking so much?"
   ], 
   [
      "I’m totally having a heart attack!", 
      "Well then I wouldn’t suck on that."
   ], 
   [
      "Why the fuck is it called Jeffrey?", 
      "Cause who could be scared of Jeffrey?  Jeffrey’s just a nice bloke from down the road."
   ], 
   [
      "No you’re not.", 
      "He could be.  The Jeffrey gives people in much better shape heart attacks.  I knew this footballer who had a heart attack who had just like one puff of the Jeffrey and unlike, Jewfro, he had zero percent body fat."
   ], 
   [
      "**", 
      "I had to get my side of the story across."
   ], 
   [
      "You ain’t got no side.", 
      "You were a bastard as a kid and you’re a bastard now!"
   ], 
   [
      "Ah!  Ah!  Ah!", 
      "Catwoman!  It’s Catwoman!"
   ], 
   [
      "Aldous pulls Aaron off of Jonathan.", 
      "What the bloody fuck?  You’re like Catwoman!"
   ]
]
 }